[
  {
    "id": "limited_resource",
    "name": "Ограниченный ресурс",
    "layer": "economy",
    "description": "Ресурс, доступный в конечном, недостаточном количестве относительно потребностей пользователей. Создает дефицит, необходимость выбора и стратегического распределения.",
    "tags": ["дефицит", "редкость", "распределение", "ограничение"],
    "interaction_type": ["mental"],
    "motivation": {
      "type": "hybrid",
      "notes": "Экстринсивная: необходимость эффективного использования для достижения целей. Интринсивная: интеллектуальное удовольствие от решения задачи оптимального распределения, чувство значимости ресурса."
    },
    "game_examples": [
      {
        "title": "Цивилизация",
        "implementation": "Ограниченное количество клеток для строительства городов, стратегических ресурсов (железо, нефть)"
      },
      {
        "title": "Карточные игры",
        "implementation": "Ограниченное количество карт в руке, маны для розыгрыша"
      }
    ],
    "product_examples": [
      "Лимитированные акции или предложения 'первым 100 покупателям'",
      "Ограниченное пространство хранилища в облачных сервисах",
      "Выделенная пропускная способность API или количество запросов"
    ],
    "education_examples": [
      "Ограниченное время на экзамен или выполнение задания",
      "Количество попыток для сдачи теста",
      "Доступ к редкому оборудованию или материалам в лаборатории",
      "Места в престижной учебной группе или на курсе"
    ],
    "abuse_risks": [
      "Создание искусственного дефицита для манипуляции поведением",
      "Несправедливое распределение, усиливающее неравенство",
      "Формирование черных рынков и неофициальных схем обхода ограничений"
    ],
    "ethical_constraints": [
      "Ограничения должны иметь объективное обоснование, а не быть произвольными",
      "Должны существовать прозрачные и справедливые механизмы распределения",
      "Пользователи должны понимать причины ограничений и их временные рамки"
    ],
    "toxicity_level": "high",
    "risk_color": "red",
    "scaling_risk": "При масштабировании сложно балансировать ограничения для разных сегментов пользователей. Жесткие ограничения могут сдерживать рост, а слишком мягкие — не выполнять свою функцию. Также риск создания 'ресурсных аристократов' — пользователей, получивших преимущества на ранних этапах.",
    "related_mechanics": ["action_cost", "economic_choice", "scarcity_creation"]
  },
  {
    "id": "renewable_resource",
    "name": "Возобновляемый ресурс",
    "layer": "economy",
    "description": "Ресурс, который восстанавливается со временем или через определенные действия. Создает ритмичную экономику с циклами расходования и восстановления.",
    "tags": ["восстановление", "цикличность", "поток", "регенерация"],
    "interaction_type": ["mental"],
    "motivation": {
      "type": "extrinsic",
      "notes": "Предоставляет предсказуемый поток ресурсов, позволяющий планировать деятельность. Создает естественный ритм взаимодействия с системой (периоды активности и ожидания)."
    },
    "game_examples": [
      {
        "title": "Мобильные F2P игры",
        "implementation": "Энергия/стамина, восстанавливаемая со временем (1 единица в 5 минут)"
      },
      {
        "title": "RTS игры",
        "implementation": "Ресурсы (минералы, газ), добываемые постоянно с базы"
      }
    ],
    "product_examples": [
      "Ежедневные бонусы за вход в приложение",
      "Месячная квота на определенные операции, обновляемая 1-го числа",
      "Восстанавливаемые кредиты API после периода ожидания"
    ],
    "education_examples": [
      "Еженедельные консультационные часы преподавателя, обновляемые каждый понедельник",
      "Возможность пересдачи теста через определенный период (например, через неделю)",
      "Доступ к тренажерам, ограниченный по времени в день, но восстанавливаемый ежедневно"
    ],
    "abuse_risks": [
      "Навязывание неестественного ритма активности ('зайти каждый день, не пропустить')",
      "Создание зависимости от регулярного 'вливания' ресурсов",
      "Использование как инструмента монетизации (покупка ускорения восстановления)"
    ],
    "ethical_constraints": [
      "Ритм восстановления должен соответствовать естественным циклам деятельности, а не быть произвольным",
      "Пользователи должны иметь возможность накапливать ресурсы в разумных пределах",
      "Не должно быть наказания за неиспользование ресурсов в период их доступности"
    ],
    "toxicity_level": "medium",
    "risk_color": "yellow",
    "scaling_risk": "При масштабировании сложно балансировать скорость восстановления для разных типов пользователей. Активные пользователи могут чувствовать нехватку, а casual-пользователи — избыток. Также риск создания 'ресурсных инвесторов', которые копят и используют ресурсы стратегически, нарушая предполагаемый ритм.",
    "related_mechanics": ["cooldown", "resource_hoarding", "time_gating"]
  },
  {
    "id": "non_renewable_resource",
    "name": "Невозобновляемый ресурс",
    "layer": "economy",
    "description": "Ресурс, доступный в строго конечном количестве на все время взаимодействия с системой. Создает высокие ставки, постоянные последствия выбора и историю принятия решений.",
    "tags": ["окончательность", "уникальность", "история", "необратимость"],
    "interaction_type": ["mental"],
    "motivation": {
      "type": "hybrid",
      "notes": "Экстринсивная: критическая важность каждого решения об использовании ресурса. Интринсивная: глубокое вовлечение, осознание уникальности опыта, создание личной истории с неповторимыми выборами."
    },
    "game_examples": [
      {
        "title": "Roguelike игры",
        "implementation": "Единственная жизнь персонажа в классическом режиме (permadeath)"
      },
      {
        "title": "Стратегии с уникальными юнитами",
        "implementation": "Легендарные герои или юниты, которых можно получить только один раз за кампанию"
      }
    ],
    "product_examples": [
      "Единственная бесплатная миграция данных при переходе на новую платформу",
      "Ограниченный выпуск физического продукта с серийным номером",
      "Единоразовый бонус при регистрации или приглашении друзей"
    ],
    "education_examples": [
      "Единственная возможность сдать выпускной экзамен или защитить диплом",
      "Уникальный доступ к архивным материалам или историческим артефактам",
      "Возможность участвовать в конкретном исследовательском проекте только один раз"
    ],
    "abuse_risks": [
      "Чрезмерный стресс и тревожность из-за необратимости решений",
      "Создание ситуации, где одна ошибка делает дальнейший прогресс невозможным",
      "Несправедливость при неравном распределении уникальных ресурсов"
    ],
    "ethical_constraints": [
      "Пользователи должны четко понимать невозобновляемость ресурса до его использования",
      "Должны существовать механизмы исправления критических ошибок (например, при misunderstanding)",
      "Невозобновляемые ресурсы не должны блокировать доступ к базовому функционалу"
    ],
    "toxicity_level": "high",
    "risk_color": "red",
    "scaling_risk": "При масштабировании невозможно обеспечить уникальность опыта для всех пользователей. То, что уникально для одного, становится шаблонным при массовом применении. Также проблема архивирования и сохранения 'историй' использования ресурсов для больших объемов пользователей.",
    "related_mechanics": ["permadeath", "irreversible_choice", "player_legacy"]
  },
  {
    "id": "resource_exchange",
    "name": "Обмен ресурсов",
    "layer": "economy",
    "description": "Добровольная передача ресурсов между пользователями или между пользователем и системой по взаимно согласованным условиям. Создает рынки, социальные связи и специализацию.",
    "tags": ["торговля", "рынок", "взаимность", "передача"],
    "interaction_type": ["mental", "social"],
    "motivation": {
      "type": "hybrid",
      "notes": "Экстринсивная: получение нужных ресурсов, которых не хватает, в обмен на избыточные. Интринсивная: удовольствие от процесса торга, социального взаимодействия, чувство справедливости взаимовыгодного обмена."
    },
    "game_examples": [
      {
        "title": "MMO (World of Warcraft)",
        "implementation": "Аукцион, торговля между игроками предметами, ресурсами, золотом"
      },
      {
        "title": "Экономические симуляторы",
        "implementation": "Биржевая торговля ресурсами между игроками"
      }
    ],
    "product_examples": [
      "Партнерские программы обмена трафиком или пользователями",
      "Marketplace для обмена услугами между пользователями",
      "Система бартера или обмена бонусными баллами"
    ],
    "education_examples": [
      "Обмен конспектами, материалами между студентами",
      "Парное рецензирование работ (peer review)",
      "Система взаимного обучения (peer teaching), где студенты обмениваются экспертизой"
    ],
    "abuse_risks": [
      "Формирование черных рынков и неучтенных обменов",
      "Эксплуатация неопытных пользователей в неравноценных сделках",
      "Манипуляции рынком (скупка, искусственное создание дефицита, инсайдерская торговля)"
    ],
    "ethical_constraints": [
      "Система должна обеспечивать прозрачность условий обмена и истории сделок",
      "Должны существовать механизмы защиты от мошенничества и недобросовестных сделок",
      "Обмен не должен нарушать права интеллектуальной собственности или конфиденциальность"
    ],
    "toxicity_level": "medium",
    "risk_color": "yellow",
    "scaling_risk": "При масштабировании возникает проблема ликвидности: для нишевых ресурсов может не находиться контрагентов. Также сложность модерации большого количества сделок и предотвращения мошенничества. Риск возникновения монополий или олигополий, контролирующих ключевые ресурсы.",
    "related_mechanics": ["negotiation", "market_dynamics", "community_economy"]
  },
  {
    "id": "resource_conversion",
    "name": "Конвертация ресурсов",
    "layer": "economy",
    "description": "Преобразование одного типа ресурса в другой по установленным правилам или рецептам. Создает производственные цепочки, планирование и стратегическую глубину.",
    "tags": ["трансформация", "производство", "рецепты", "цепочки"],
    "interaction_type": ["mental"],
    "motivation": {
      "type": "extrinsic",
      "notes": "Позволяет превращать избыточные или менее ценные ресурсы в более нужные или ценные. Создает ощущение производственного процесса и контроля над экономической цепочкой."
    },
    "game_examples": [
      {
        "title": "Крафтовые игры (Minecraft)",
        "implementation": "Превращение древесины в доски, досок в верстак, верстака в инструменты"
      },
      {
        "title": "Экономические стратегии",
        "implementation": "Переработка сырья в товары, товаров в более сложные продукты"
      }
    ],
    "product_examples": [
      "Конвертация бонусных баллов в скидки или реальные товары",
      "Преобразование времени активности в статус или привилегии",
      "Перевод одной валюты лояльности в другую (например, авиамили в отельные баллы)"
    ],
    "education_examples": [
      "Перезачет ранее полученных кредитов при переходе на новую программу",
      "Конвертация активности в курсе (обсуждения, задания) в итоговые баллы",
      "Преобразование теоретических знаний в практические навыки через проекты"
    ],
    "abuse_risks": [
      "Создание невыгодных или эксплуататорских коэффициентов конвертации",
      "Непрозрачность правил конвертации, позволяющая манипулировать пользователями",
      "Формирование бессмысленных цепочек конвертации без реальной ценности"
    ],
    "ethical_constraints": [
      "Коэффициенты конвертации должны быть стабильными и предсказуемыми",
      "Пользователи должны понимать полную цепочку конвертации до начала процесса",
      "Конвертация не должна приводить к необратимой потере ценности без ясного предупреждения"
    ],
    "toxicity_level": "low",
    "risk_color": "green",
    "scaling_risk": "При добавлении новых ресурсов и рецептов сложно поддерживать сбалансированную экономику. Непродуманные коэффициенты конвертации могут создать инфляцию или дефляцию определенных ресурсов. Также риск возникновения 'оптимальных путей', которые делают остальные цепочки нецелесообразными.",
    "related_mechanics": ["crafting", "economic_chain", "upgrade"]
  },
  {
    "id": "resource_loss",
    "name": "Потеря ресурсов",
    "layer": "economy",
    "description": "Уменьшение количества ресурсов пользователя в результате действий, ошибок, штрафов или системных механизмов. Создает риск, последствия и необходимость защиты активов.",
    "tags": ["штраф", "риск", "стоимость_ошибки", "убыток"],
    "interaction_type": ["mental"],
    "motivation": {
      "type": "extrinsic",
      "notes": "Отрицательное подкрепление, обучающее избегать определенных действий или поведений. Повышает значимость ресурсов, создавая страх их потери. Добавляет драматизма и эмоциональной вовлеченности."
    },
    "game_examples": [
      {
        "title": "Хардкорные режимы",
        "implementation": "Потеря всего снаряжения и ресурсов при смерти персонажа"
      },
      {
        "title": "Экономические симуляторы",
        "implementation": "Штрафы, налоги, убытки от неудачных инвестиций"
      }
    ],
    "product_examples": [
      "Штрафы за отмену бронирования или возврат товара после определенного срока",
      "Сгорание бонусных баллов по истечении срока действия",
      "Потеря статуса или привилегий при невыполнении условий"
    ],
    "education_examples": [
      "Снижение оценки за сдачу работы после дедлайна",
      "Потеря баллов за неправильные ответы в тестах с отрицательной оценкой",
      "Лишение доступа к ресурсам за нарушение правил (плагиат, списывание)"
    ],
    "abuse_risks": [
      "Чрезмерно суровые наказания, демотивирующие пользователей",
      "Непрозрачные или несправедливые условия потери ресурсов",
      "Эксплуатационная механика, вынуждающая постоянно 'пополнять' теряемые ресурсы"
    ],
    "ethical_constraints": [
      "Потеря ресурсов должна быть соразмерна 'проступку' или риску",
      "Пользователи должны четко понимать условия, ведущие к потере, до их наступления",
      "Должны существовать механизмы восстановления или компенсации в разумных пределах"
    ],
    "toxicity_level": "high",
    "risk_color": "red",
    "scaling_risk": "При масштабировании сложно персонализировать штрафы под разные ситуации пользователей. Стандартизированные потери могут быть несправедливыми в отдельных случаях. Также риск каскадных эффектов, когда потеря ресурсов одним пользователем влияет на других в связанной экономике.",
    "related_mechanics": ["error_punishment", "risk_action", "economic_consequence"]
  },
  {
    "id": "resource_hoarding",
    "name": "Накопление ресурсов",
    "layer": "economy",
    "description": "Сознательное сохранение и аккумулирование ресурсов сверх текущих потребностей для будущего использования, инвестирования или статуса. Создает экономическое планирование и разнообразие стратегий.",
    "tags": ["сбережения", "инвестиции", "стратегия", "накопление"],
    "interaction_type": ["mental"],
    "motivation": {
      "type": "hybrid",
      "notes": "Экстринсивная: безопасность от будущих нехваток, возможность крупных приобретений. Интринсивная: удовольствие от наблюдения за ростом запасов, чувство контроля и предусмотрительности."
    },
    "game_examples": [
      {
        "title": "Симуляторы выживания",
        "implementation": "Сбор и хранение еды, воды, материалов на зиму или кризис"
      },
      {
        "title": "RPG",
        "implementation": "Накопление золота или редких предметов для покупки эндгейм-экипировки"
      }
    ],
    "product_examples": [
      "Накопление бонусных миль или баллов для крупной покупки или поездки",
      "Сохранение бесплатных запросов в API для пиковых нагрузок",
      "Аккумулирование контента или данных 'про запас'"
    ],
    "education_examples": [
      "Создание личной базы знаний, конспектов, материалов для будущего использования",
      "Накопление кредитов или сертификатов для получения более высокой степени",
      "Сбережение 'времени на подумать' или 'возможностей обратиться за помощью' для сложных задач"
    ],
    "abuse_risks": [
      "Чрезмерное накопительство в ущерб текущему прогрессу или удовольствию",
      "Создание экономического неравенства между накопителями и тратящими",
      "Искажение экономики системы (дефляция, недостаточная ликвидность)"
    ],
    "ethical_constraints": [
      "Накопление не должно блокировать доступ к ресурсам для других пользователей",
      "Должны быть разумные пределы накопления или механизмы 'сгорания' излишков",
      "Система не должна поощрять патологическое накопительство"
    ],
    "toxicity_level": "medium",
    "risk_color": "yellow",
    "scaling_risk": "При масштабировании накопленные ресурсы могут создавать огромный разрыв между новыми и старыми пользователями. Также проблема 'замороженных' ресурсов, выведенных из оборота, что может нарушить экономику. Сложность управления инфляцией/дефляцией при массовом накопительстве.",
    "related_mechanics": ["collection", "economic_planning", "scarcity_creation"]
  },
  {
    "id": "crafting",
    "name": "Крафт",
    "layer": "economy",
    "description": "Процесс создания новых предметов, инструментов или ресурсов путем комбинирования других ресурсов по определенным рецептам или правилам. Создает производственные цепочки и чувство созидания.",
    "tags": ["создание", "производство", "рецепты", "синтез"],
    "interaction_type": ["mental"],
    "motivation": {
      "type": "intrinsic",
      "notes": "Удовлетворение от превращения сырья в полезные предметы, от процесса созидания и мастерства. Радость от открытия новых рецептов и создания уникальных комбинаций."
    },
    "game_examples": [
      {
        "title": "Minecraft",
        "implementation": "Создание инструментов, оружия, блоков, механизмов из базовых ресурсов"
      },
      {
        "title": "MMORPG (World of Warcraft)",
        "implementation": "Профессии: кузнечное дело, алхимия, инженерия для создания предметов"
      }
    ],
    "product_examples": [
      "Конструктор отчетов или дашбордов из различных виджетов и данных",
      "Создание собственных workflows из стандартных блоков автоматизации",
      "Дизайнер документов или презентаций из готовых элементов"
    ],
    "education_examples": [
      "Создание конспектов или шпаргалок из разрозненных материалов",
      "Сборка экспериментальных установок из стандартных компонентов",
      "Написание программ из библиотек функций и модулей",
      "Создание исследовательских проектов из данных и методов анализа"
    ],
    "abuse_risks": [
      "Чрезмерная сложность или гринди для доступа к полезным рецептам",
      "Создание бессмысленных или бесполезных предметов для 'галочки'",
      "Эксплуатационные модели, где крафт необходим, но ресурсы для него монетизированы"
    ],
    "ethical_constraints": [
      "Крафт должен иметь осмысленный результат, полезный для пользователя",
      "Рецепты должны быть открыты или разумно доступны для изучения",
      "Не должно быть принуждения к крафту для базового функционирования"
    ],
    "toxicity_level": "low",
    "risk_color": "green",
    "scaling_risk": "При добавлении новых рецептов и ресурсов сложно поддерживать баланс и избегать power creep (когда новые предметы делают старые бесполезными). Также проблема discoverability: пользователи могут не находить полезные рецепты среди сотен. Риск возникновения 'мета-крафта' — оптимальных путей, которые игнорируют творческий аспект.",
    "related_mechanics": ["resource_conversion", "upgrade", "discovery"]
  },
  {
    "id": "upgrade",
    "name": "Апгрейд",
    "layer": "economy",
    "description": "Улучшение существующих предметов, инструментов, характеристик или возможностей через вложение ресурсов. Создает прогрессию внутри отдельных элементов системы.",
    "tags": ["улучшение", "модернизация", "усиление", "инвестиция"],
    "interaction_type": ["mental"],
    "motivation": {
      "type": "extrinsic",
      "notes": "Прямое и измеримое улучшение эффективности знакомых инструментов или возможностей. Чувство развития и кастомизации под свои нужды. Защита предыдущих инвестиций (предмет не заменяется, а улучшается)."
    },
    "game_examples": [
      {
        "title": "Инкрементальные игры",
        "implementation": "Улучшение генераторов ресурсов (больше ресурсов в секунду)"
      },
      {
        "title": "RPG",
        "implementation": "Улучшение оружия и брони (+1 к урону, +1 к защите)"
      }
    ],
    "product_examples": [
      "Улучшение тарифного плана на более дорогой с большими возможностями",
      "Апгрейд программного обеспечения с базовой до профессиональной версии",
      "Улучшение характеристик облачного сервера (больше CPU, RAM, storage)"
    ],
    "education_examples": [
      "Углубленное изучение темы после освоения базового уровня",
      "Переход от решения типовых задач к творческим или исследовательским",
      "Улучшение навыка от 'знаю теорию' до 'умею применять в реальных условиях'",
      "Апгрейд методологии исследования от простых методов к сложным"
    ],
    "abuse_risks": [
      "Бесконечная лестница улучшений без качественных изменений (гриндинг)",
      "Несправедливое преимущество тех, кто может инвестировать больше ресурсов",
      "Обесценивание базовой версии, делающее ее нежизнеспособной без апгрейда"
    ],
    "ethical_constraints": [
      "Каждое улучшение должно приносить ощутимую пользу, а не быть чисто косметическим",
      "Базовые версии должны оставаться функциональными для выполнения основных задач",
      "Условия улучшения должны быть прозрачными и предсказуемыми"
    ],
    "toxicity_level": "medium",
    "risk_color": "yellow",
    "scaling_risk": "Power creep: каждое новое улучшение должно быть лучше предыдущих, что ведет к инфляции эффективности. Сложность балансировки стоимости улучшений с их ценностью. Риск создания 'обязательных' апгрейдов, без которых невозможно конкурировать, что превращает улучшение из опции в необходимость.",
    "related_mechanics": ["vertical_progress", "stat_enhancement", "investment"]
  }
]