[
  {
    "id": "complete_information",
    "name": "Полная информация",
    "layer": "information",
    "description": "Все игроки имеют доступ ко всей релевантной информации о состоянии системы, правилах и возможных действиях. Создает условия для чисто стратегического мышления без элемента неожиданности.",
    "tags": ["прозрачность", "стратегия", "предсказуемость", "симметрия"],
    "interaction_type": ["mental"],
    "motivation": {
      "type": "intrinsic",
      "notes": "Удовлетворение от решения чисто интеллектуальной задачи, где успех зависит исключительно от умения анализировать, планировать и предвидеть. Справедливость, так как все участники находятся в равных условиях."
    },
    "game_examples": [
      {
        "title": "Шахматы, Го",
        "implementation": "Вся позиция на доске, все фигуры и их возможности видны обоим игрокам"
      },
      {
        "title": "Совершенная информация в карточных играх",
        "implementation": "Теоретически, если бы все карты были открыты (на практике редко)"
      }
    ],
    "product_examples": [
      "Прозрачное ценообразование со всеми сборами, указанными заранее",
      "Полные и доступные условия пользовательского соглашения",
      "Открытая roadmap разработки продукта для пользователей"
    ],
    "education_examples": [
      "Предоставление полного плана курса, критериев оценки и всех материалов в первый день",
      "Открытый банк заданий для экзамена, из которого будут выбраны вопросы",
      "Прозрачная система начисления баллов, где студент может точно рассчитать свою оценку",
      "Изучение детерминированных систем (физика Ньютона, формальная логика), где все начальные условия известны"
    ],
    "abuse_risks": [
      "Может привести к решению путем полного перебора или к статичной 'решенной' мета-игре (как в крестиках-ноликах)",
      "Отсутствие сюрпризов может сделать опыт предсказуемым и скучным для некоторых",
      "Давление на перфекционистов, так как любая ошибка очевидно является результатом их просчета"
    ],
    "ethical_constraints": [
      "Если система заявляет о полной информации, она должна быть действительно полной и актуальной",
      "Сложную информацию (условия соглашения) необходимо представлять в понятном виде",
      "В образовании это этичный стандарт для критериев оценки, но не обязательно для всего учебного процесса"
    ],
    "toxicity_level": "low",
    "risk_color": "green",
    "scaling_risk": "С увеличением сложности системы обеспечить истинную полноту и понятность информации для всех пользователей становится невозможно. Может возникнуть иллюзия полноты, когда ключевая информация технически доступна, но практически не находима. Сложность поддержания актуальности всей информации при частых изменениях.",
    "related_mechanics": ["strategy_depth", "perfect_knowledge", "transparency"]
  },
  {
    "id": "incomplete_information",
    "name": "Неполная информация",
    "layer": "information",
    "description": "Игроки имеют доступ только к части релевантной информации о системе. Они должны делать выводы, строить догадки и принимать решения в условиях неопределенности. Отражает реальные условия большинства сложных ситуаций.",
    "tags": ["неопределенность", "дедукция", "предположения", "реализм"],
    "interaction_type": ["mental"],
    "motivation": {
      "type": "intrinsic",
      "notes": "Интеллектуальный вызов, аналогичный реальным исследовательским и жизненным ситуациям. Удовольствие от успешной дедукции, построения ментальных моделей и принятия решений на основе ограниченных данных."
    },
    "game_examples": [
      {
        "title": "Покер",
        "implementation": "Игроки не видят карт соперников, но видят общие карты на столе и ставки"
      },
      {
        "title": "Стратегии с туманом войны (Fog of War)",
        "implementation": "Игрок видит только область вокруг своих юнитов"
      }
    ],
    "product_examples": [
      "Рекомендательные алгоритмы, чья внутренняя логика не раскрыта",
      "Система подбора кандидатов или партнеров, где полные критерии неясны",
      "Динамическое ценообразование, где факторы, влияющие на цену, не полностью прозрачны"
    ],
    "education_examples": [
      "Решение исследовательских проблем, где ответ неизвестен даже преподавателю",
      "Case studies из реального бизнеса или истории, где часть информации утеряна или скрыта",
      "Научные эксперименты, где студенты должны выдвинуть гипотезу, не зная ожидаемого результата",
      "Обучение диагностике (медицина, техника) на основе неполного набора симптомов"
    ],
    "abuse_risks": [
      "Может вызывать фрустрацию и ощущение несправедливости, если информация скрыта произвольно",
      "Поощрение дедукции может превратиться в поощрение угадывания или поиска лазеек",
      "Создание искусственных барьеров через намеренное сокрытие важной информации"
    ],
    "ethical_constraints": [
      "Сокрытие информации должно иметь педагогическую или игровую цель, а не быть манипуляцией",
      "Критически важная для принятия решений информация (критерии оценки, правила безопасности) не должна скрываться",
      "В образовании студенты должны развивать навыки работы с неполной информацией, а не просто сталкиваться с ее отсутствием"
    ],
    "toxicity_level": "medium",
    "risk_color": "yellow",
    "scaling_risk": "Сложность балансировки степени неполноты информации для разных типов учеников. Слишком мало информации приводит к угадыванию, слишком много — сводит задачу к простой. При масштабировании невозможно персонализировать, какая информация скрыта от кого, что может создать неравные условия.",
    "related_mechanics": ["hidden_information", "deduction", "risk_assessment"]
  },
  {
    "id": "hidden_information",
    "name": "Скрытая информация",
    "layer": "information",
    "description": "Информация принципиально существует в системе, но намеренно недоступна пользователю в данный момент. Она может быть раскрыта позже через определенные действия или условия. Создает интригу и цели для исследования.",
    "tags": ["секрет", "находка", "раскрытие", "интрига"],
    "interaction_type": ["mental"],
    "motivation": {
      "type": "intrinsic",
      "notes": "Сильное любопытство, движимое желанием раскрыть тайну, заполнить пробелы в картине мира. Предвкушение открытия и удовлетворение от его достижения. Чувство исключительности, если информация скрыта не от всех."
    },
    "game_examples": [
      {
        "title": "Квесты, приключенческие игры",
        "implementation": "Секретные комнаты, скрытые предметы, записки с частью сюжета"
      },
      {
        "title": "Карточные игры",
        "implementation": "Карты в руке соперника, скрытые от вас"
      }
    ],
    "product_examples": [
      "Скрытые функции (Easter eggs), активируемые специальными командами",
      "Прогрессивное раскрытие интерфейса по мере освоения продукта",
      "Контент (статьи, видео), доступный только после выполнения действий (например, подписка)"
    ],
    "education_examples": [
      "Дополнительные материалы, ответы или углубленные объяснения, доступные после самостоятельной попытки решить задачу",
      "Исторические документы или научные данные, 'рассекречиваемые' по мере прохождения курса",
      "Система намеков и подсказок в обучающей программе, где следующая подсказка скрыта, пока студент не попробует",
      "Скрытые взаимосвязи между темами, которые студент должен обнаружить самостоятельно"
    ],
    "abuse_risks": [
      "Сокрытие критически важной информации, необходимой для прогресса (искусственный барьер)",
      "Фрустрация, если скрытая информация так и не находится, оставляя ощущение незавершенности",
      "Создание социального неравенства, если скрытая информация становится известна только части сообщества (например, через внешние гайды)"
    ],
    "ethical_constraints": [
      "Скрытая информация не должна блокировать доступ к базовому функционалу или обязательным учебным результатам",
      "Должны существовать разумные и доступные способы ее обнаружения, а не слепой поиск",
      "В образовании скрытие должно мотивировать к исследованию, а не быть наказанием за незнание"
    ],
    "toxicity_level": "low",
    "risk_color": "green",
    "scaling_risk": "При большом количестве пользователей и скрытых элементов сложно обеспечить, чтобы все секреты были в принципе обнаружены и оценены. Риск создания 'неразгаданных тайн', которые разочаровывают сообщество. Также сложность обновления системы: новые пользователи могут найти старые секреты, предназначенные для другого этапа развития продукта.",
    "related_mechanics": ["information_revelation", "discovery", "exploration"]
  },
  {
    "id": "information_revelation",
    "name": "Раскрытие информации",
    "layer": "information",
    "description": "Процесс постепенного или событийного открытия ранее скрытой информации пользователю. Управляет темпом обучения, создает нарратив и структурирует опыт.",
    "tags": ["прогрессивность", "нарратив", "обучение", "дозирование"],
    "interaction_type": ["mental"],
    "motivation": {
      "type": "intrinsic",
      "notes": "Удовлетворение от прогрессивного понимания, складывания картины мира из пазлов. Чувство продвижения и роста компетентности. Дозированная сложность предотвращает когнитивную перегрузку."
    },
    "game_examples": [
      {
        "title": "Сюжетные игры с линейным повествованием",
        "implementation": "История раскрывается через кат-сцены, диалоги и найденные записи по мере прохождения"
      },
      {
        "title": "Игры-головоломки (The Witness)",
        "implementation": "Новые механики и правила головоломок постепенно объясняются через игровой опыт"
      }
    ],
    "product_examples": [
      "Пошаговый онбординг, который объясняет функции постепенно",
      "Система подсказок, появляющихся при первом использовании функции",
      "Выпуск информации о новых фичах через блог или email-рассылку"
    ],
    "education_examples": [
      "Структура учебного курса: от простых концепций к сложным",
      "Метод Сократа: наводящие вопросы, которые подводят ученика к самостоятельному открытию знания",
      "Поэтапное проведение эксперимента: гипотеза → метод → данные → вывод",
      "Изучение языка: постепенное введение грамматических правил и лексики"
    ],
    "abuse_risks": [
      "Чрезмерно медленное или линейное раскрытие может frustrate продвинутых пользователей",
      "Создание искусственных 'ворот', блокирующих доступ к информации без причины",
      "Патернализм: система решает, что и когда пользователю 'полезно' знать"
    ],
    "ethical_constraints": [
      "Темп раскрытия должен учитывать разные стили обучения и позволять ускорять его при желании",
      "Конечная цель (полная картина) должна быть ясна с самого начала",
      "В образовании последовательность раскрытия должна быть педагогически обоснована, а не произвольна"
    ],
    "toxicity_level": "low",
    "risk_color": "green",
    "scaling_risk": "Сложно создать персонализированный темп раскрытия для тысяч пользователей. Универсальная последовательность может не подходить многим. При обновлениях и добавлении нового контента сложно интегрировать его в существующую последовательность раскрытия, не запутывая текущих пользователей.",
    "related_mechanics": ["gradual_reveal", "scaffolding", "curated_learning"]
  },
  {
    "id": "secret_goal",
    "name": "Тайная цель",
    "layer": "information",
    "description": "Индивидуальная, скрытая от других участников цель или задача, которую должен выполнить пользователь. Создает асимметрию, социальную дедукцию и потенциальный конфликт интересов.",
    "tags": ["скрытый_мотив", "предательство", "дедукция", "асимметрия"],
    "interaction_type": ["mental", "social"],
    "motivation": {
      "type": "intrinsic",
      "notes": "Волнение от ведения 'двойной игры', необходимость скрывать свои истинные намерения и вычислять намерения других. Удовольствие от успешного обмана или разгадки чужих секретов."
    },
    "game_examples": [
      {
        "title": "Социальные дедуктивные игры (Мафия, Among Us)",
        "implementation": "У предателя (мафии/импостера) есть скрытая цель убить всех, не будучи раскрытым"
      },
      {
        "title": "Настольные игры с секретными заданиями (Джек-потрошитель в Letters from Whitechapel)",
        "implementation": "У сыщиков и преступника разные, частично скрытые цели"
      }
    ],
    "product_examples": [
      "Скрытые критерии для получения статуса или награды, о которых пользователи догадываются",
      "Программы тестирования, где часть пользователей не знает, что участвует в A/B тесте",
      "Соревнования с неочевидными условиями победы"
    ],
    "education_examples": [
      "Ролевые игры и симуляции, где у студентов разные, потенциально конфликтующие цели (модель ООН, судебный процесс)",
      "Проектная работа, где у каждой группы есть своя 'секретная миссия' или критерий успеха, не известный другим",
      "Изучение истории с анализом скрытых мотивов исторических персонажей",
      "Задания на развитие эмпатии и понимания перспективы другого"
    ],
    "abuse_risks": [
      "Может поощрять патологический обман и подрыв доверия в реальных отношениях",
      "Фрустрация и чувство несправедливости у тех, чьи цели оказались сложнее или были раскрыты",
      "Токсичное поведение и обвинения в реальной жизни, если игра становится слишком серьезной"
    ],
    "ethical_constraints": [
      "Должно быть четкое разделение игры и реальности, ритуализированное пространство",
      "Все участники должны добровольно согласиться на возможность обмана и скрытых целей",
      "В образовательном контексте необходим тщательный дебрифинг после игры для анализа и снятия напряжения"
    ],
    "toxicity_level": "high",
    "risk_color": "red",
    "scaling_risk": "В больших группах сложно сбалансировать тайные цели, чтобы они были выполнимы и интересны. Риск возникновения коалиций, которые нарушают задумку. Сложность модерации взаимодействий и предотвращения реальных конфликтов, возникающих из-за игрового обмана. В онлайн-среде анонимность может усугубить токсичное поведение.",
    "related_mechanics": ["social_deduction", "hidden_role", "asymmetric_goals"]
  },
  {
    "id": "false_information",
    "name": "Ложная информация",
    "layer": "information",
    "description": "Намеренное представление пользователю информации, которая не соответствует действительности (дезинформация, мистификация, 'красная сельдь'). Тестирует критическое мышление и способность верифицировать данные.",
    "tags": ["дезинформация", "проверка", "критическое_мышление", "мистификация"],
    "interaction_type": ["mental"],
    "motivation": {
      "type": "intrinsic",
      "notes": "Интеллектуальный вызов отличить правду от лжи. Глубокое удовлетворение от разгадки обмана и восстановления истинной картины. В образовании — развитие здорового скептицизма и исследовательских навыков."
    },
    "game_examples": [
      {
        "title": "Детективные игры, триллеры",
        "implementation": "Ложные улики, ненадежные рассказчики, намеренно вводящие в заблуждение диалоги"
      },
      {
        "title": "Социальные игры с блефом (Покер)",
        "implementation": "Игроки намеренно демонстрируют ложные эмоции или ставки, чтобы обмануть соперников"
      }
    ],
    "product_examples": [
      "Тесты на безопасность (фишинг-симуляции) для сотрудников",
      "Капчи или задачи, предназначенные для отличия ботов от людей (хотя здесь ложность относительна)",
      "Рекламные или сатирические материалы, стилизованные под реальный контент"
    ],
    "education_examples": [
      "Задания на поиск ошибок или фальсификаций в научных статьях или исторических документах",
      "Введение контрпримеров или распространенных заблуждений в материал для их последующего разбора",
      "Симуляции информационных войн или анализа пропаганды",
      "Метод 'преподаватель-провокатор', намеренно делающий ошибку, чтобы студенты ее нашли"
    ],
    "abuse_risks": [
      "Подрыв общего доверия к системе или преподавателю как источнику информации",
      "Укрепление цинизма и всеобщего недоверия, а не здорового скептицизма",
      "Когнитивный диссонанс и замешательство, особенно у молодых или неискушенных учеников"
    ],
    "ethical_constraints": [
      "Использование должно быть крайне осторожным и педагогически обоснованным",
      "Ложная информация не должна касаться фактов, критических для безопасности, здоровья или этики",
      "Должен быть четкий и своевременный 'разбор полетов', раскрывающий правду и объясняющий цель обмана"
    ],
    "toxicity_level": "high",
    "risk_color": "red",
    "scaling_risk": "В цифровой среде ложная информация может выйти из-под контроля и распространиться без контекста, причиняя реальный вред. Сложно гарантировать, что все пользователи получат корректирующую информацию. Риск того, что механика будет использована злонамеренно самими пользователями для дезинформации других.",
    "related_mechanics": ["critical_thinking", "bluffing", "misinformation_challenge"]
  },
  {
    "id": "fog_of_war",
    "name": "Фог войны / Туман войны",
    "layer": "information",
    "description": "Пространственная метафора для скрытой информации: области пространства (карты, игрового поля), которые не исследованы пользователем, скрыты от него. Информация раскрывается по мере исследования.",
    "tags": ["исследование", "картография", "неизвестность", "открытие"],
    "interaction_type": ["mental"],
    "motivation": {
      "type": "intrinsic",
      "notes": "Сильное побуждение к исследованию, желание раскрыть темные области на карте и увидеть, что там находится. Чувство первооткрывателя. Стратегическая необходимость разведки для планирования действий."
    },
    "game_examples": [
      {
        "title": "Стратегии в реальном времени (StarCraft, Warcraft)",
        "implementation": "Карта изначально затемнена, открывается вокруг юнитов игрока"
      },
      {
        "title": "Рогалики (Roguelikes)",
        "implementation": "Подземелье генерируется и открывается по квадратам по мере движения"
      }
    ],
    "product_examples": [
      "Карты сервисов доставки, где виден только район пользователя и зона покрытия",
      "Интерфейсы аналитики, где данные сначала скрыты и 'проявляются' по запросу или со временем",
      "Прогрессивная загрузка контента (бесконечная лента)"
    ],
    "education_examples": [
      "Интерактивные карты знаний или концепт-карты, которые заполняются по мере изучения темы",
      "Симуляторы исторических открытий или географических экспедиций",
      "Изучение анатомии или сложных устройств слой за слоем",
      "Подход 'от частного к общему': сначала даются конкретные случаи (островки знания), затем открывается общая теория (континент)"
    ],
    "abuse_risks": [
      "Искусственное растягивание контента через необходимость механического 'засвета' всей карты",
      "Фрустрация от необходимости возвращаться в уже исследованные области из-за забытой информации (если карта снова затемняется)",
      "Создание ощущения бесконечной и бесцельной траты времени на исследование"
    ],
    "ethical_constraints": [
      "Исследование должно приводить к осмысленным открытиям (новый контент, знания), а не быть самоцелью",
      "Пользователь должен иметь возможность делать заметки или сохранять открытую информацию, чтобы не исследовать одно и то же дважды без причины",
      "В образовании 'карта' конечна и должна быть полностью открыта к концу курса"
    ],
    "toxicity_level": "low",
    "risk_color": "green",
    "scaling_risk": "Генерация и хранение состояния 'тумана войны' для миллионов пользователей в больших виртуальных пространствах требует значительных вычислительных ресурсов. Сложность проектирования мира, который интересно исследовать в масштабе, а не содержит огромные пустые области. Риск того, что пользователи будут обмениваться картами, сводя на нет исследовательский аспект.",
    "related_mechanics": ["exploration", "mapping", "procedural_generation"]
  },
  {
    "id": "information_memorization",
    "name": "Запоминание информации",
    "layer": "information",
    "description": "Необходимость запомнить ранее полученную информацию для ее последующего использования. Тестирует и тренирует память, создает внутреннюю ментальную модель системы у пользователя.",
    "tags": ["память", "вспоминание", "знание", "интернализация"],
    "interaction_type": ["mental"],
    "motivation": {
      "type": "intrinsic",
      "notes": "Чувство компетентности и мастерства от того, что информация усвоена и стала частью внутреннего багажа знаний. Удовлетворение от быстрого и точного вспоминания в нужный момент."
    },
    "game_examples": [
      {
        "title": "Игры на память (Memory, мемори)",
        "implementation": "Запомнить расположение парных карточек"
      },
      {
        "title": "Квесты с пазлами на запоминание",
        "implementation": "Запомнить код, увиденный в записке ранее, чтобы ввести его позже"
      }
    ],
    "product_examples": [
      "Необходимость запомнить мастер-пароль или коды доступа (хотя это плохая практика)",
      "Интерфейсы, где часто используемые функции скрыты за комбинациями клавиш (hotkeys), которые нужно выучить",
      "Системы, где логика работы строится на ранее введенных пользователем данных"
    ],
    "education_examples": [
      "Фундаментальный принцип обучения: запоминание фактов, формул, дат, определений, словарного запаса",
      "Использование техник интервального повторения (Spaced Repetition Systems) для эффективного запоминания",
      "Экзамены с закрытыми книгами",
      "Изучение систем (язык программирования, музыкальная нотация), где нужно запомнить синтаксис или символы"
    ],
    "abuse_risks": [
      "Поощрение механической зубрежки в ущерб пониманию и критическому мышлению",
      "Создание барьеров для людей с особенностями памяти или обучаемости (например, дислексия)",
      "Фрустрация, когда важная информация была показана лишь раз и в неподходящий момент"
    ],
    "ethical_constraints": [
      "Запоминание должно быть средством для достижения более высоких целей (понимание, применение), а не самоцелью",
      "Должны предоставляться справочные материалы для информации, которую неэтично или неразумно требовать запоминать (например, длинные списки)",
      "В образовании необходимо учитывать разные типы памяти и предлагать разнообразные методы закрепления"
    ],
    "toxicity_level": "low",
    "risk_color": "green",
    "scaling_risk": "Сложно персонализировать темп и объем информации для запоминания под каждого пользователя. Универсальный поток информации может перегружать одних и недорабатывать для других. При обновлении контента может потребоваться 'переучивание' пользователей, что вызывает сопротивление.",
    "related_mechanics": ["spaced_repetition", "recall_testing", "knowledge_internalization"]
  }
]