[
  {
    "id": "collections_meta",
    "name": "Коллекции (мета-уровень)",
    "layer": "meta",
    "description": "Система сбора и организации не игровых предметов, а meta-элементов: достижений, пройденных курсов, сертификатов, исторических моментов, созданных проектов. Формирует целостную картину долгосрочного прогресса и идентичности пользователя.",
    "tags": ["мета-прогресс", "архив", "портфолио", "история"],
    "interaction_type": ["mental"],
    "motivation": {
      "type": "intrinsic",
      "notes": "Удовлетворение от созерцания всего пройденного пути и собранного 'наследия'. Чувство завершенности и целостности опыта. Служит мощным инструментом для рефлексии, самооценки и демонстрации своих компетенций внешнему миру."
    },
    "game_examples": [
      {
        "title": "Системы галерей и музеев в играх (Hollow Knight, персонажи в Super Smash Bros. Ultimate)",
        "implementation": "Коллекция всех встреченных существ, найденных предметов или разблокированных персонажей, которую можно просмотреть в специальном меню."
      },
      {
        "title": "Архивы пройденных миссий или сюжетных моментов",
        "implementation": "Возможность пересмотреть кат-сцены, прочитать собранные записи или посмотреть статистику по завершенным играм."
      }
    ],
    "product_examples": [
      "Личный кабинет с историей всех заказов, поездок или транзакций",
      "Портфолио на профессиональных платформах (Behance для дизайнеров, GitHub для разработчиков)",
      "Приложения для отслежиния привычек или целей, показывающие историю прогресса за месяцы и годы"
    ],
    "education_examples": [
      "Цифровое портфолио студента, собирающее все работы, проекты, сертификаты и отзывы",
      "Транскрипт с историей всех пройденных курсов и оценок",
      "Карта освоенных компетенций или навыков, которая заполняется по мере обучения",
      "Личный учебный блог или дневник, документирующий образовательный путь"
    ],
    "abuse_risks": [
      "Накопление 'мусорных' коллекций, не несущих ценности, просто для объема",
      "Нарушение приватности, если личные коллекции достижений становятся публичными по умолчанию",
      "Давление необходимости 'заполнить' все коллекции, даже нерелевантные, превращая обучение в компульсивный сбор"
    ],
    "ethical_constraints": [
      "Пользователь должен иметь полный контроль над тем, что входит в его мета-коллекцию и кто может её видеть",
      "Коллекция должна помогать в рефлексии и развитии, а не быть просто витриной",
      "В образовании портфолио должно отражать реальный рост и может включать неудачи как часть learning journey"
    ],
    "toxicity_level": "low",
    "risk_color": "green",
    "scaling_risk": "Хранение и отображение огромного объема персонализированных мета-данных для миллионов пользователей требует мощной инфраструктуры. Сложность организации и поиска внутри больших коллекций. При изменении стандартов или форматов данных (например, сертификатов) может потребоваться миграция старых коллекций.",
    "related_mechanics": ["player_legacy", "achievement_archive", "progress_timeline"]
  },
  {
    "id": "seasonal_events",
    "name": "Сезонные события",
    "layer": "meta",
    "description": "Ограниченные по времени, тематические активности, контент и награды, приуроченные к реальным или игровым сезонам, праздникам или событиям. Оживляют продукт, создают повод для возвращения и вовлекают в ритм.",
    "tags": ["временные_ивенты", "тематика", "праздники", "ограниченность"],
    "interaction_type": ["mental", "social"],
    "motivation": {
      "type": "extrinsic",
      "notes": "FOMO (страх упустить уникальный контент), чувство новизны и праздника. Создает социальные поводы для общения и совместной деятельности. Помогает бороться с рутиной, периодически встряхивая опыт."
    },
    "game_examples": [
      {
        "title": "Праздничные ивенты в играх (Overwatch, Fortnite)",
        "implementation": "Зимние праздники, Хэллоуин, годовщины игры сопровождаются уникачными картами, модами, косметикой и заданиями."
      },
      {
        "title": "Сезонные лиги или battle passes",
        "implementation": "3-4-месячные сезоны с прогрессивной системой наград, обнуляемой и обновляемой с началом нового сезона."
      }
    ],
    "product_examples": [
      "Черная пятница, Киберпонедельник и другие сезонные распродажи",
      "Тематические маркетинговые кампании к праздникам",
      "Сезонные обновления интерфейса или функционала (например, летний режим в картографических сервисах)"
    ],
    "education_examples": [
      "Летние или зимние школы, интенсивные курсы во время каникул",
      "Тематические учебные недели или модули (Неделя науки, Месяц цифровой грамотности)",
      "Конкурсы, хакатоны или олимпиады, приуроченные к определенным датам",
      "Сезонные обсуждения или кейсы (например, налоговые кейсы перед концом финансового года)"
    ],
    "abuse_risks": [
      "Выгорание от постоянного давления участия в бесконечной череде событий",
      "Ощущение обязанности играть/учиться в праздники или отпуск, blurring work-life balance",
      "Разочарование пользователей, которые по объективным причинам пропустили событие и не могут получить контент"
    ],
    "ethical_constraints": [
      "Сезонный контент не должен содержать критически важные для прогресса механики или знания",
      "Должны учитываться культурные и религиозные различия глобальной аудитории при выборе тем праздников",
      "В образовании сезонные активности должны дополнять, а не нарушать основной учебный план"
    ],
    "toxicity_level": "medium",
    "risk_color": "yellow",
    "scaling_risk": "Организация масштабных событий для миллионов пользователей создает пиковую нагрузку на инфраструктуру. Необходимо тщательно балансировать доступность наград, чтобы они оставались желанными, но не невозможными для большинства. Сложность поддержания качества и баланса при частом выпуске нового контента для событий.",
    "related_mechanics": ["limited_time_events", "content_refresh", "community_celebration"]
  },
  {
    "id": "content_rotation",
    "name": "Ротация контента",
    "layer": "meta",
    "description": "Периодическое, запланированное добавление, удаление или изменение доступности игрового контента, заданий, тем обучения или функций. Поддерживает новизну, управляет балансом и сложностью среды.",
    "tags": ["обновление", "цикличность", "управление_контентом", "свежесть"],
    "interaction_type": ["mental"],
    "motivation": {
      "type": "hybrid",
      "notes": "Экстринсивная: возможность получить доступ к редкому или возвращающемуся контенту. Интринсивная: постоянное ощущение живой, развивающейся системы, в которой есть что исследовать. Борьба со стагнацией и predictability."
    },
    "game_examples": [
      {
        "title": "Карточные игры (Hearthstone, Magic: The Gathering Arena)",
        "implementation": "Формат 'Standard', в котором разрешены только карты из последних выпущенных наборов; старые карты уходят в 'Wild'."
      },
      {
        "title": "Игры с регулярными обновлениями карт/перков (Teamfight Tactics, Auto Chess)",
        "implementation": "Каждый сезон меняется набор чемпионов, предметов и синергий, полностью обновляя метагейм."
      }
    ],
    "product_examples": [
      "Ротация товаров в сервисах подписки (например, ежемесячные игры в PlayStation Plus, книги в Kindle Unlimited)",
      "Меню в сервисах доставки еды, которое меняется по сезонам",
      "Смена тем и фондов на краудфандинговых платформах"
    ],
    "education_examples": [
      "Обновление списка литературы, кейсов и заданий в курсе каждый семестр для актуальности",
      "Ротация тем для проектных работ или эссе",
      "Циклическое предложение элективных курсов (не каждый семестр все доступны)",
      "Использование текущих событий или новых исследований в качестве учебного материала"
    ],
    "abuse_risks": [
      "Ощущение, что усилия по освоению контента напрасны, так как он 'сгорит' или устареет",
      "Фрустрация от ухода любимого контента или необходимости переучиваться",
      "Создание искусственного дефицита и FOMO для мотивации, а не педагогической ценности"
    ],
    "ethical_constraints": [
      "Пользователи должны быть заранее предупреждены о планах ротации и её сроках",
      "Устаревший или убранный контент должен оставаться доступным в архивах или специальных режимах, если он не нарушает баланс",
      "В образовании ротация должна отражать развитие области знаний, а не быть произвольной"
    ],
    "toxicity_level": "medium",
    "risk_color": "yellow",
    "scaling_risk": "Управление жизненным циклом огромных объемов контента требует четких процессов и метаданных. Необходимо поддерживать баланс между новым и старым контентом, чтобы не фрагментировать сообщество и не перегружать новичков. Технический долг: старый контент может ломаться при обновлениях платформы.",
    "related_mechanics": ["meta_progression", "game_balance", "content_lifecycle"]
  },
  {
    "id": "user_generated_content",
    "name": "Пользовательский контент",
    "layer": "meta",
    "description": "Контент (уровни, моды, задания, статьи, видео, уроки), создаваемый самими пользователями для других пользователей. Превращает потребителей в со-творцов и расширяет возможности системы экспоненциально.",
    "tags": ["креативность", "сообщество", "моды", "краудсорсинг"],
    "interaction_type": ["mental", "social"],
    "motivation": {
      "type": "intrinsic",
      "notes": "Глубокое творческое самовыражение и удовлетворение от создания чего-то своего. Признание и слава внутри сообщества. Желание улучшить или персонализировать любимый продукт. Обучение через teaching others."
    },
    "game_examples": [
      {
        "title": "Игры с редакторами уровней (Super Mario Maker, LittleBigPlanet, Roblox)",
        "implementation": "Игроки создают собственные уровни, игры или миры, используя инструменты разработчика, и выкладывают их для других."
      },
      {
        "title": "Модификации игр (моды для The Elder Scrolls, Minecraft)",
        "implementation": "Сообщество создает новые текстуры, предметы, сюжеты, механики, значительно расширяя базовую игру."
      }
    ],
    "product_examples": [
      "Платформы для создания и продажи онлайн-курсов (Udemy, Teachable)",
      "Форумы, блоги, базы знаний, наполняемые пользователями (Stack Overflow, Wikipedia)",
      "Маркетплейсы тем, виджетов или расширений для продуктов (WordPress plugins, Figma community)"
    ],
    "education_examples": [
      "Студенты создают учебные материалы (конспекты, объясняющие видео, quiz-ы) для своих peers",
      "Практика peer instruction: более продвинутые студенты помогают или преподают начинающим",
      "Создание портфолио проектов, которое служит учебным ресурсом для следующих поколений студентов",
      "Краудсорсинговые исследовательские проекты или сбор данных"
    ],
    "abuse_risks": [
      "Качество контента может быть крайне неравномерным, от гениального до бесполезного или вредного",
      "Нарушение авторских прав, плагиат, публикация оскорбительного или неподходящего контента",
      "Эксплуатация труда создателей контента без справедливого вознаграждения или признания"
    ],
    "ethical_constraints": [
      "Платформа должна обеспечивать эффективную модерацию, систему рейтингов и отчетности",
      "Должны быть четкие правила и инструменты для защиты интеллектуальной собственности",
      "Создатели контента должны получать признание, а в некоторых случаях — и финансовое вознаграждение за свой труд"
    ],
    "toxicity_level": "medium",
    "risk_color": "yellow",
    "scaling_risk": "Модерация огромного объема пользовательского контента становится огромной и дорогостоящей проблемой (модерация UGC). Необходимость создания мощных и доступных инструментов для творчества. Риск того, что небольшая доля создателей контента будет обслуживать пассивное большинство, что может привести к выгоранию создателей.",
    "related_mechanics": ["community_creation", "crowdsourcing", "platform_for_expression"]
  },
  {
    "id": "community_economy",
    "name": "Экономика сообщества",
    "layer": "meta",
    "description": "Внутренняя экономическая система, управляемая и питаемая самим сообществом пользователей: обмен пользовательским контентом, услугами, внутренней валютой, репутацией. Создает глубокую взаимозависимость и социальную ткань.",
    "tags": ["рынок", "взаимность", "социальный_капитал", "крафт_экономика"],
    "interaction_type": ["social", "mental"],
    "motivation": {
      "type": "hybrid",
      "notes": "Экстринсивная: возможность получать реальную или виртуальную ценность за свои навыки, контент или услуги внутри сообщества. Интринсивная: чувство участия в живом, дышащем социальном организме, где твои действия имеют значение для других."
    },
    "game_examples": [
      {
        "title": "MMO с игровыми аукционами и торговлей между игроками (EVE Online, World of Warcraft)",
        "implementation": "Игроки производят ресурсы, крафтят предметы и продают их друг другу за внутриигровую валюту, формируя сложные рыночные отношения."
      },
      {
        "title": "Платформы для продажи внутриигровых предметов за реальные деньги (Steam Community Market)",
        "implementation": "Игроки торгуют косметическими предметами, создавая реальную экономику с колебаниями цен."
      }
    ],
    "product_examples": [
      "Фриланс-биржи и платформы для услуг (Upwork, Fiverr)",
      "Краудфандинговые платформы для поддержки создателей (Patreon, Kickstarter)",
      "Системы обмена или бартера между пользователями (например, книгообмен)"
    ],
    "education_examples": [
      "Система взаимопомощи и репетиторства между студентами (старшие курсы помогают младшим за 'баллы' или признание)",
      "Внутренние гранты или фонды сообщества для поддержки студенческих проектов",
      "Обмен учебными материалами, конспектами, инструментами внутри учебной группы или факультета",
      "Создание и продажа учебных пособий, шаблонов или инструментов выпускниками и студентами"
    ],
    "abuse_risks": [
      "Возникновение реальных финансовых споров, мошенничества или эксплуатации внутри сообщества",
      "Формирование экономического неравенства и элитных групп, контролирующих ресурсы",
      "Нарушение основных целей продукта (например, обучение подменяется гриндингом ради заработка в виртуальной экономике)"
    ],
    "ethical_constraints": [
      "Платформа должна обеспечивать безопасность сделок, разрешение споров и защиту от мошенничества",
      "Экономика не должна создавать pay-to-win динамику или несправедливые преимущества",
      "В образовательном контекссе экономика должна дополнять и усиливать учебные цели, а не отвлекать от них"
    ],
    "toxicity_level": "high",
    "risk_color": "red",
    "scaling_risk": "Управление сложной экономикой с тысячами транзакций требует серьезных систем и иногда регуляторного соответствия (если задействованы реальные деньги). Балансировка экономики (борьба с инфляцией, дефляцией, монополиями) — постоянная и сложная задача. Экономические кризисы внутри игры могут привести к реальному недовольству и оттоку пользователей.",
    "related_mechanics": ["player_driven_market", "social_capital", "virtual_economy"]
  },
  {
    "id": "meta_goals",
    "name": "Мета-цели",
    "layer": "meta",
    "description": "Долгосрочные, глобальные цели, стоящие над повседневными задачами и циклами прогресса. Часто требуют комбинации достижений из разных областей или посвящения значительного времени. Придают общий смысл и направление всему опыту.",
    "tags": ["сверхзадача", "долгосрочная_цель", "легенда", "наследие"],
    "interaction_type": ["mental"],
    "motivation": {
      "type": "intrinsic",
      "notes": "Удовлетворение от работы над чем-то грандиозным и значительным, что выходит за рамки повседневности. Чувство цели и направления на протяжении месяцев или лет. Глубокая гордость и уникальность при достижении."
    },
    "game_examples": [
      {
        "title": "Титулы и достижения за полное завершение игры (Platinum Trophy)",
        "details": "Требует выполнить все остальные достижения в игре, что часто означает освоение всех аспектов геймплея."
      },
      {
        "title": "Легендарные квесты или предметы в MMO",
        "details": "Многоэтапные, растянутые на месяцы цепочки заданий для получения легендарного оружия или способности (например, легендарный клинок в WoW)."
      }
    ],
    "product_examples": [
      "Карьерные цели или путь к партнерству в профессиональных сетях",
      "Долгосрочные программы лояльности с финальной наградой (собери 10 штампов, получи бесплатный продукт на год)",
      "Челленджи по self-improvement на год (прочитать 50 книг, пробежать 1000 км)"
    ],
    "education_examples": [
      "Получение ученой степени (бакалавр, магистр, PhD) как финальная цель многолетнего обучения",
      "Завершение большой дипломной работы или диссертации",
      "Построение полноценного портфолио проектов для трудоустройства",
      "Долгосрочный исследовательский или научный проект, длящийся семестр или год"
    ],
    "abuse_risks": [
      "Чрезмерный гриндинг и выгорание на пути к цели",
      "Ощущение бессмысленности или пустоты после достижения мета-цели, если не задано новое направление",
      "Несправедливость, если цель требует недоступных для некоторых пользователей ресурсов (крайне много времени, специальных условий)"
    ],
    "ethical_constraints": [
      "Мета-цели должны быть добровольными и не блокировать доступ к основному контенту",
      "Путь к цели должен быть разнообразным и интересным, а не состоять из монотонного повторения",
      "В образовании мета-цели должны соответствовать реальным образовательным результатам и быть достижимыми при разумных усилиях"
    ],
    "toxicity_level": "medium",
    "risk_color": "yellow",
    "scaling_risk": "Создание и поддержание значимых и сбалансированных мета-целей для опытной, 'эндгейм' аудитории сложно. Новые мета-цели не должны обесценивать старые. Риск создания 'элитного' класса игроков, завершивших все мета-цели, которым нечего делать.",
    "related_mechanics": ["long_term_motivation", "prestige_challenge", "legacy_building"]
  },
  {
    "id": "player_legacy",
    "name": "Наследие игрока",
    "layer": "meta",
    "description": "Постоянный, неизгладимый след, который пользователь оставляет в системе: его имя в списках победителей, созданный контент, фундаментальные изменения в игровом мире, влияние на сообщество или учеников. Трансцендирует отдельные сессии и аккаунты.",
    "tags": ["память", "влияние", "след", "бессмертие"],
    "interaction_type": ["mental", "social"],
    "motivation": {
      "type": "intrinsic",
      "notes": "Глубочайшая потребность в значимости и том, чтобы что-то после себя оставить. Желание быть remembered и влиять на мир даже после своего 'ухода'. Связь с чем-то большим, чем собственная временная активность."
    },
    "game_examples": [
      {
        "title": "Игры с постоянными изменениями мира (EVE Online)",
        "details": "Действия альянсов игроков (войны, разрушение структур) навсегда меняют политическую карту и экономику игровой вселенной, становясь частью её истории."
      },
      {
        "title": "Системы именования открытий или творений (No Man's Sky, Minecraft сервера)",
        "details": "Игрок, первым открывший планету или построивший значимое сооружение, может дать ему имя, которое увидят все последующие игроки."
      }
    ],
    "product_examples": [
      "Системы, где лучшие ответы или контент пользователя остаются и приносят пользу годами (как ответы на Stack Overflow)",
      "Профиль или страница основателя/лидера в сообществе",
      "Физические или цифровые 'доски почета' с именами выдающихся пользователей"
    ],
    "education_examples": [
      "Выпускник, чья дипломная работа или изобретение используется в университете или стало основой для стартапа",
      "Студент-ментор, чьи учебные материалы или методологии перенимаются следующими поколениями",
      "Создание выпускного проекта, который становится общественным достоянием или open-source инструментом",
      "Участие в долгосрочном исследовании, результаты которого публикуются и цитируются"
    ],
    "abuse_risks": [
      "Вандализм: попытки оставить негативный или разрушительный след в системе",
      "Создание культа личности вокруг отдельных влиятельных пользователей",
      "Конфликты из-за 'права' на наследие или признания авторства"
    ],
    "ethical_constraints": [
      "Система должна иметь механизмы против вандализма и защиты позитивного наследия",
      "Признание должно быть заслуженным и соответствовать реальному вкладу",
      "В образовании важно подчеркивать ценность коллективного наследия и вклада каждого, а не только 'звезд'"
    ],
    "toxicity_level": "low",
    "risk_color": "green",
    "scaling_risk": "С ростом числа пользователей обеспечить каждому возможность оставить значимое наследие становится невозможно — возникает конкуренция за 'место в истории'. Хранение и отображение наследия миллионов пользователей требует инновационных решений. Риск того, что наследие старых игроков будет мешать или непонятно новым.",
    "related_mechanics": ["persistent_impact", "digital_immortality", "community_history"]
  },
  {
    "id": "social_recognition",
    "name": "Социальное признание",
    "layer": "meta",
    "description": "Публичное, часто церемониальное признание системой и сообществом достижений, статуса, вклада или мастерства пользователя. Формализует и усиливает социальный статус, полученный через другие механики.",
    "tags": ["похвала", "церемония", "награда", "престиж"],
    "interaction_type": ["social", "mental"],
    "motivation": {
      "type": "extrinsic",
      "notes": "Мощное внешнее подтверждение собственной значимости и компетентности. Удовлетворение от публичной похвалы и уважения со стороны peers и авторитетов (системы). Является одной из высших форм социального вознаграждения."
    },
    "game_examples": [
      {
        "title": "Церемонии награждения в онлайн-играх (например, вручение виртуальных кубков в конце сезона)",
        "details": "Попадание в топ лидерборда или завершение сложнейшего рейда сопровождается анимацией, объявлением на сервере или уникальным визуальным эффектом."
      },
      {
        "title": "Системы титулов или званий, отображаемых рядом с именем игрока",
        "details": "Титулы вроде 'Завоеватель' или 'Мудрец', которые видны всем другим игрокам в чате или при наведении курсора."
      }
    ],
    "product_examples": [
      "Сертификаты, дипломы, грамоты с подписями и печатями",
      "Номинации 'Сотрудник месяца' или 'Лучший автор' с публичным объявлением",
      "Функции 'Выбор редакции' или 'Топ-автор' на контент-платформах"
    ],
    "education_examples": [
      "Выпускная церемония, вручение дипломов, награждение медалями за академические успехи",
      "Публичная защита диплома или диссертации перед комиссией и коллегами",
      "Публикация лучших студенческих работ в сборнике или на сайте вуза",
      "Система рекомендательных писем от преподавателей для трудоустройства или дальнейшей учебы"
    ],
    "abuse_risks": [
      "Создание нездоровой конкуренции и зависти внутри сообщества",
      "Формирование 'элитарного клуба' признанных пользователей, который отдаляет остальных",
      "Снижение ценности признания, если оно раздается слишком часто или не заслуженно"
    ],
    "ethical_constraints": [
      "Критерии признания должны быть прозрачными, справедливыми и разнообразными (признавать разные типы вкладов)",
      "Процесс должен быть инклюзивным и давать шанс разным пользователям, а не только самой громкой группе",
      "В образовании важно признавать прогресс и усилия, а не только абсолютные достижения"
    ],
    "toxicity_level": "medium",
    "risk_color": "yellow",
    "scaling_risk": "В больших сообществах обеспечить meaningful recognition для многих сложно — оно может стать обезличенным или превратиться в формальность. Риск манипуляции системой признания (например, накрутка голосов). Поддержание церемониальности и значимости в масштабе требует креативных решений.",
    "related_mechanics": ["prestige", "ceremony", "status_enforcement"]
  }
]