[
  {
    "id": "gradual_reveal",
    "name": "Постепенное раскрытие",
    "layer": "onboarding",
    "description": "Стратегия представления функционала, возможностей и контента системы дозированно, по мере готовности пользователя к их восприятию и использованию. Предотвращает когнитивную перегрузку.",
    "tags": ["дозирование", "поэтапность", "управление_сложностью", "прогрессивность"],
    "interaction_type": ["mental"],
    "motivation": {
      "type": "intrinsic",
      "notes": "Снижает начальный барьер входа, делая сложную систему доступной. Поддерживает чувство прогресса и открытия нового на каждом этапе. Соответствует естественному процессу обучения — от простого к сложному."
    },
    "game_examples": [
      {
        "title": "Игры-головоломки (The Witness, Portal)",
        "implementation": "Новые механики и правила вводятся по одной через простые обучающие уровни, прежде чем игрок столкнется с их комбинацией."
      },
      {
        "title": "Стратегические игры с кампанией (StarCraft)",
        "implementation": "В кампании каждый миссия знакомит с новым юнитом, зданием или тактикой, постепенно расширяя арсенал игрока."
      }
    ],
    "product_examples": [
      "Прогрессивное раскрытие интерфейса в сложных программах (например, Adobe Photoshop с базовыми и расширенными панелями)",
      "Многоэтапный онбординг в мобильных приложениях, где каждый экран объясняет одну ключевую функцию",
      "Email-курсы или drip-кампании, которые отправляют уроки по одному в течение дней или недель"
    ],
    "education_examples": [
      "Структура учебного курса: от фундаментальных понятий к продвинутым темам",
      "Введение новых научных методов или инструментов только после освоения базовых",
      "Модульное обучение, где следующий модуль блокируется до успешного завершения предыдущего",
      "Изучение языка: сначала алфавит и базовые фразы, затем грамматика, и только потом свободная речь"
    ],
    "abuse_risks": [
      "Чрезмерное замедление и 'разжевывание' может frustrate продвинутых или любознательных пользователей",
      "Создание искусственных 'ворот', блокирующих доступ к нужному функционалу без веской причины",
      "Линейность, не учитывающая альтернативные пути обучения или разные стартовые знания"
    ],
    "ethical_constraints": [
      "Пользователи должны иметь возможность ускорить или пропустить постепенное введение, если они уже компетентны",
      "Конечная цель и полная картина возможностей должны быть видны с самого начала, чтобы задавать направление",
      "В образовании последовательность должна быть педагогически обоснована, а не произвольна"
    ],
    "toxicity_level": "low",
    "risk_color": "green",
    "scaling_risk": "Сложно создать персонализированный темп раскрытия для тысяч пользователей с разным бэкграундом. Универсальная линейная последовательность может не подходить многим. При обновлениях и добавлении нового контента сложно интегрировать его в существующую последовательность, не запутывая текущих пользователей.",
    "related_mechanics": ["scaffolding", "progressive_disclosure", "curated_learning_path"]
  },
  {
    "id": "tutorial",
    "name": "Туториал",
    "layer": "onboarding",
    "description": "Структурированное, часто линейное обучающее взаимодействие, которое напрямую инструктирует пользователя, как выполнять базовые действия в системе, через подсказки, демонстрации и контролируемую практику.",
    "tags": ["обучение", "инструктаж", "введение", "гид"],
    "interaction_type": ["mental"],
    "motivation": {
      "type": "extrinsic",
      "notes": "Обеспечивает быстрый и гарантированный старт, минимизируя фрустрацию от непонимания. Дает уверенность в своих действиях. Прямое обучение через doing с немедленной обратной связью."
    },
    "game_examples": [
      {
        "title": "Почти любая современная игра",
        "implementation": "Первые минуты или уровень игры, где текст или голос говорит: 'Используй WASD для движения', 'Нажми ЛКМ, чтобы атаковать', с обязательным выполнением действия."
      },
      {
        "title": "Интерактивные обучающие миссии",
        "implementation": "Специальный уровень, имитирующий реальный геймплей, но с постоянными подсказками и без угрозы провала."
      }
    ],
    "product_examples": [
      "Интерактивные туры по интерфейсу при первом запуске приложения (product tour)",
      "Пошаговые руководства (wizards) для настройки сложных функций",
      "База знаний с видео-инструкциями или guided walkthroughs"
    ],
    "education_examples": [
      "Вводная лекция или ориентационная сессия перед началом курса",
      "Практическое занятие по использованию учебной платформы (как загрузить работу, где найти материалы)",
      "Лабораторный инструктаж по технике безопасности и работе с оборудованием",
      "Набор тренировочных упражнений с ключами для самопроверки перед основными заданиями"
    ],
    "abuse_risks": [
      "Слишком длинный, навязчивый или нем Skippable туториал, который воспринимается как помеха",
      "Излишняя линейность и патернализм, не оставляющие места для самостоятельного исследования",
      "Обучение тривиальным или интуитивно понятным действиям, что вызывает раздражение"
    ],
    "ethical_constraints": [
      "Туториал должен быть коротким, релевантным и skippable для опытных пользователей",
      "Обучение должно фокусироваться на non-obvious, критически важных для успеха действиях",
      "В образовании туториал должен вести к самостоятельной деятельности, а не заменять её"
    ],
    "toxicity_level": "low",
    "risk_color": "green",
    "scaling_risk": "Создание и поддержание актуального туториала при каждом обновлении интерфейса или функционала требует ресурсов. Единый туториал не может учесть разные стили обучения (визуальный, текстовый, кинестетический). Для сложных систем туториал рискует стать слишком объемным.",
    "related_mechanics": ["guided_learning", "interactive_demo", "first_time_experience"]
  },
  {
    "id": "contextual_hint",
    "name": "Контекстная подсказка",
    "layer": "onboarding",
    "description": "Краткая, ненавязчивая помощь или информация, которая появляется в момент, когда пользователь, вероятно, в ней нуждается — например, при первом посещении раздела, при бездействии или при повторяющейся ошибке.",
    "tags": ["помощь", "поддержка", "вовремя", "ненавязчивость"],
    "interaction_type": ["mental"],
    "motivation": {
      "type": "intrinsic",
      "notes": "Предоставляет помощь именно тогда, когда она наиболее релевантна, не прерывая поток мыслей. Снижает фрустрацию от застревания, позволяя пользователю продолжить прогрессировать самостоятельно. Воспринимается как умная и заботливая система."
    },
    "game_examples": [
      {
        "title": "Игры с динамическими подсказками",
        "implementation": "Если игрок долго не может решить головоломку или несколько раз умирает в одном месте, игра может показать текстовую подсказку или визуальный указатель."
      },
      {
        "title": "Подсказки к комбинациям клавиш в интерфейсе",
        "implementation": "При наведении курсора на элемент интерфейса может показываться shortcut key."
      }
    ],
    "product_examples": [
      "Всплывающие подсказки (tooltips) при наведении на иконки или кнопки",
      "Советы на экранах загрузки или ожидания",
      "Чат-боты поддержки, активируемые при определенных паттернах поведения пользователя"
    ],
    "education_examples": [
      "Подсказки в интерактивных учебных задачах, которые открываются после нескольких неудачных попыток",
      "Автоматические рекомендации дополнительных материалов при низком результате теста по теме",
      "Напоминания о дедлайнах или следующем шаге в учебном плане",
      "Объяснение ошибок в заданиях по программированию или математике с указанием на конкретное место"
    ],
    "abuse_risks": [
      "Чрезмерные или слишком очевидные подсказки, лишающие пользователя удовольствия от самостоятельного открытия",
      "Неправильная тайминг: подсказка появляется слишком рано (не давая подумать) или слишком поздно (после фрустрации)",
      "Раздражающая навязчивость, если подсказки невозможно отключить"
    ],
    "ethical_constraints": [
      "Пользователь должен иметь контроль над частотой и типом подсказок (настройки)",
      "Подсказки не должны давать прямого ответа, а направлять к нему, поддерживая когнитивную нагрузку",
      "В образовании важно, чтобы подсказки развивали мета-когнитивные навыки (как думать), а не только давали факты"
    ],
    "toxicity_level": "low",
    "risk_color": "green",
    "scaling_risk": "Разработка умных алгоритмов, точно определяющих момент необходимости подсказки для миллионов пользователей с разным уровнем навыков — сложная задача AI/ML. Риск того, что алгоритм будет работать плохо и предлагать неуместные или раздражающие подсказки. Персонализация требует сбора и анализа данных о поведении.",
    "related_mechanics": ["just_in_time_help", "adaptive_support", "hint_system"]
  },
  {
    "id": "protected_environment",
    "name": "Защищенная среда",
    "layer": "onboarding",
    "description": "Специально созданные условия (уровень, режим, пространство), где новые пользователи могут экспериментировать, учиться и совершать ошибки без риска серьезных негативных последствий, таких как потеря ресурсов, прогресса или социального осуждения.",
    "tags": ["песочница", "безопасность", "тренировка", "эксперимент"],
    "interaction_type": ["mental"],
    "motivation": {
      "type": "intrinsic",
      "notes": "Снижает страх неудачи, который является главным барьером для экспериментов и обучения. Позволяет развивать мастерство и уверенность в контролируемых условиях перед выходом в 'реальный мир'. Поощряет любопытство и исследование."
    },
    "game_examples": [
      {
        "title": "Тренировочные режимы или тиры в шутерах",
        "implementation": "Режим без реальных противников или с ботами низкой сложности, где можно изучить карту, прицеливание, оружие."
      },
      {
        "title": "Creative/Peaceful режим в играх-песочницах (Minecraft)",
        "implementation": "Режим с неограниченными ресурсами, отсутствием врагов и неуязвимостью, предназначенный для свободного творчества и строительства."
      }
    ],
    "product_examples": [
      "Песочницы или тестовые среды для разработчиков (sandbox API, staging server)",
      "Демо-версии программного обеспечения с полным функционалом, но без возможности сохранить работу",
      "Тренажеры для отработки навыков (например, симуляторы вождения)"
    ],
    "education_examples": [
      "Лабораторные работы в компьютерных симуляторах перед работой с реальным, дорогим или опасным оборудованием",
      "Пробные (formative) тесты и задания, не влияющие на итоговую оценку",
      "Ролевые игры и симуляции для отработки коммуникативных или профессиональных навыков в безопасной обстановке",
      "Работа с учебными данными или кейсами вместо реальных клиентских ситуаций"
    ],
    "abuse_risks": [
      "Формирование нереалистичных ожиданий от основной среды (например, что ресурсы бесконечны или враги глупы)",
      "Застревание в безопасной среде из-за страха перед реальными ставками",
      "Использование защищенной среды для эксплойтов или фарма ресурсов, если есть возможность переноса в основную игру"
    ],
    "ethical_constraints": [
      "Должно быть четкое разграничение между защищенной и основной средой, чтобы пользователь понимал переход",
      "Защищенная среда должна готовить к реалиям основной, а не полностью от них отличаться",
      "В образовании важно постепенно уменьшать защиту, переводя студента к самостоятельной, ответственной работе"
    ],
    "toxicity_level": "low",
    "risk_color": "green",
    "scaling_risk": "Содержание отдельной инфраструктуры (серверов, инстансов) для защищенной среды может быть дорого. Необходимо предотвращать возможность нанесения ущерба основной экономике или опыту других игроков из защищенной среды (например, если есть обмен). Сложность проектирования среды, которая одновременно безопасна и релевантна.",
    "related_mechanics": ["safe_mode", "training_grounds", "risk_free_exploration"]
  },
  {
    "id": "trial_action",
    "name": "Пробное действие",
    "layer": "onboarding",
    "description": "Возможность бесплатно, с минимальными обязательствами или рисками попробовать ключевое действие, функцию или опыт системы. Позволяет оценить ценность перед полноценным вовлечением.",
    "tags": ["тест", "демо", "бесплатный_образец", "знакомство"],
    "interaction_type": ["mental", "physical"],
    "motivation": {
      "type": "extrinsic",
      "notes": "Снимает психологический барьер перед совершением первого действия, особенно если оно связано с затратами (деньги, время, регистрация). Предоставляет tangible доказательство ценности продукта. Основано на принципе 'попробуй перед покупкой'."
    },
    "game_examples": [
      {
        "title": "Бесплатные пробные версии игр (game trials)",
        "implementation": "Возможность бесплатно поиграть первые несколько уровней или в течение ограниченного времени (например, 10 часов)."
      },
      {
        "title": "Бесплатные вращения в казино-играх или демо-режимы",
        "implementation": "Несколько бесплатных попыток без реальных ставок, чтобы понять механику."
      }
    ],
    "product_examples": [
      "Бесплатный пробный период подписки (например, 14 дней)",
      "Демо-версии программного обеспечения с ограниченным функционалом или водяными знаками",
      "Бесплатный первый урок или консультация в услугах (коучинг, обучение)"
    ],
    "education_examples": [
      "Пробный урок или вводный модуль курса, доступный до оплаты",
      "Возможность бесплатно посетить первое занятие в кружке или на курсах",
      "Доступ к части материалов курса (силлабус, первые лекции) для ознакомления",
      "Участие в открытых днях вуза или пробных экзаменах"
    ],
    "abuse_risks": [
      "Предоставление нерепрезентативного, чрезмерно упрощенного или улучшенного опыта, не отражающего реальность",
      "Эксплуатация: создание зависимости от продукта во время пробного периода, чтобы сделать отказ болезненным",
      "Злоупотребление пользователями: создание множества аккаунтов для бесконечных пробных периодов"
    ],
    "ethical_constraints": [
      "Пробный опыт должен быть честным и репрезентативным для основного продукта",
      "Условия пробного периода (что включено, как отменить) должны быть абсолютно прозрачны",
      "В образовании пробный опыт должен давать реальное представление о содержании, темпе и требованиях курса"
    ],
    "toxicity_level": "low",
    "risk_color": "green",
    "scaling_risk": "Предотвращение злоупотреблений пробными периодами (например, с помощью верификации телефона или карты) создает барьер для законных пользователей. Обеспечение качества пробного опыта для тысяч новых пользователей одновременно требует ресурсов. Сложность конвертации пробных пользователей в платных, если пробный период не выстроен правильно.",
    "related_mechanics": ["free_sample", "conversion_funnel", "first_impression"]
  }
]