[
  {
    "id": "points_accumulation",
    "name": "Накопление очков",
    "layer": "progression",
    "description": "Количественное измерение достижений пользователя через присвоение числовых значений (очков) за выполнение действий. Создает измеримый прогресс.",
    "tags": ["квантификация", "измерение", "счет", "рост"],
    "interaction_type": ["mental"],
    "motivation": {
      "type": "extrinsic",
      "notes": "Конкретная, измеримая обратная связь о прогрессе. Очки служат универсальной валютой достижений, сравнимой между пользователями и во времени."
    },
    "game_examples": [
      {
        "title": "Аркадные игры",
        "implementation": "Очки за уничтожение врагов, сбор предметов, время выживания"
      },
      {
        "title": "RPG",
        "implementation": "Опыт (XP) за победу над врагами и выполнение квестов"
      }
    ],
    "product_examples": [
      "Бонусные баллы за покупки в лояльностных программах",
      "Рейтинг продавцов на маркетплейсах",
      "Карма/рейтинг на форумах"
    ],
    "education_examples": [
      "Баллы за выполненные задания и тесты",
      "Накопление кредитов ECTS в системе высшего образования",
      "Рейтинг активности на курсе (посещение, участие в обсуждениях)"
    ],
    "abuse_risks": [
      "Подмена цели процессом (гонка за очками вместо реального обучения)",
      "Манипуляция системой для фарма очков без реальных достижений",
      "Социальное неравенство и демотивация отстающих"
    ],
    "ethical_constraints": [
      "Очки должны отражать реальные достижения или усилия",
      "Система должна быть устойчива к накруткам",
      "Необходимы альтернативные пути признания прогресса помимо очков"
    ],
    "toxicity_level": "medium",
    "risk_color": "yellow",
    "scaling_risk": "Инфляция очков при масштабировании: новые действия должны давать соразмерное количество очков. Сложность сравнения прогресса пользователей с разными стартовыми условиями. Риск гонки вооружений в накрутке.",
    "related_mechanics": ["levels", "progress_visualization", "leaderboard"]
  },
  {
    "id": "levels",
    "name": "Уровни",
    "layer": "progression",
    "description": "Дискретные этапы развития пользователя, обычно требующие достижения определенного порога очков/опыта. Обеспечивают структурированный прогресс с четкими вехами.",
    "tags": ["этапы", "ранги", "ступени", "дискретность"],
    "interaction_type": ["mental"],
    "motivation": {
      "type": "hybrid",
      "notes": "Экстринсивная: конкретные награды и признание за достижение уровня. Интринсивная: чувство завершенности этапа, ясное понимание прогресса и следующих целей."
    },
    "game_examples": [
      {
        "title": "World of Warcraft",
        "implementation": "Уровни персонажа от 1 до 60 (ранее до 120), с ростом характеристик и открытием контента"
      },
      {
        "title": "Мобильные игры",
        "implementation": "Уровни игрока, разблокирующие новые функции и контент"
      }
    ],
    "product_examples": [
      "Уровни статуса в авиалиниях (Silver, Gold, Platinum)",
      "Уровни доверия на торговых площадках (новичок, проверенный, эксперт)",
      "Карьерные грейды в компаниях"
    ],
    "education_examples": [
      "Курсы, разделенные на уровни (A1, A2, B1, B2 в языках)",
      "Академические степени (бакалавр, магистр, PhD)",
      "Уровни владения навыком (начальный, средний, продвинутый, эксперт)"
    ],
    "abuse_risks": [
      "Искусственное замедление прогресса для монетизации",
      "Создание социальной иерархии и элитизма",
      "Демотивация при застревании на уровне"
    ],
    "ethical_constraints": [
      "Критерии перехода на уровень должны быть прозрачными и справедливыми",
      "Должна быть возможность прогресса для пользователей с разными стартовыми условиями",
      "Уровни не должны создавать неоправданные преимущества во вред другим"
    ],
    "toxicity_level": "medium",
    "risk_color": "yellow",
    "scaling_risk": "При добавлении новых уровней может возникнуть разрыв между старыми и новыми игроками. Сложность балансировки наград для разных уровней. Риск обесценивания нижних уровней при фокусе на эндгейм-контенте.",
    "related_mechanics": ["points_accumulation", "content_unlock", "social_status"]
  },
  {
    "id": "progress_threshold",
    "name": "Порог прогресса",
    "layer": "progression",
    "description": "Конкретное числовое значение, которое необходимо достичь для активации следующего этапа прогресса (нового уровня, награды, возможности). Создает четкие цели.",
    "tags": ["цели", "требования", "вехи", "триггеры"],
    "interaction_type": ["mental"],
    "motivation": {
      "type": "extrinsic",
      "notes": "Предоставляет абсолютно ясную и измеримую цель. Снижает неопределенность в прогрессе, позволяя точно планировать усилия для достижения порога."
    },
    "game_examples": [
      {
        "title": "Игры с прокачкой",
        "implementation": "1000 XP для перехода с 5 на 6 уровень"
      },
      {
        "title": "Сезонные события",
        "implementation": "500 очков события для получения уникальной награды"
      }
    ],
    "product_examples": [
      "Минимальная сумма покупки для бесплатной доставки",
      "Количество отзывов для получения статуса 'проверенный автор'",
      "Порог активности для сохранения премиум-статуса"
    ],
    "education_examples": [
      "Проходной балл для сдачи экзамена (например, 60% из 100%)",
      "Минимальное количество кредитов для перехода на следующий курс",
      "Порог посещаемости для допуска к зачету"
    ],
    "abuse_risks": [
      "Неоправданно высокие пороги, создающие искусственные барьеры",
      "Резкие скачки сложности при переходе порога",
      "Манипуляция через изменение порогов уже в процессе"
    ],
    "ethical_constraints": [
      "Пороги должны быть достижимыми при разумных усилиях",
      "Изменения порогов должны быть заранее анонсированы",
      "Должны учитываться разные возможности пользователей (инклюзивность)"
    ],
    "toxicity_level": "low",
    "risk_color": "green",
    "scaling_risk": "При масштабировании сложно устанавливать единые пороги для разнородной аудитории. Персонализация порогов может восприниматься как несправедливость. Также риск создания 'мертвых зон' сразу после порога, когда прогресс кажется бесцельным.",
    "related_mechanics": ["points_accumulation", "content_unlock", "levels"]
  },
  {
    "id": "progress_visualization",
    "name": "Визуализация прогресса",
    "layer": "progression",
    "description": "Графическое представление прогресса пользователя (прогресс-бары, карты, диаграммы, анимации). Делает абстрактный прогресс осязаемым и понятным.",
    "tags": ["отображение", "интерфейс", "графика", "обратная_связь"],
    "interaction_type": ["mental"],
    "motivation": {
      "type": "intrinsic",
      "notes": "Удовлетворяет потребность в ясности и предсказуемости. Визуальное приближение к цели создает позитивное ожидание и поддерживает мотивацию."
    },
    "game_examples": [
      {
        "title": "Прогресс-бар уровня",
        "implementation": "Заполняющаяся шкала, показывающая, сколько XP осталось до следующего уровня"
      },
      {
        "title": "Карты приключений",
        "implementation": "Визуальный путь с отметками пройденных и будущих этапов"
      }
    ],
    "product_examples": [
      "Индикатор заполнения профиля пользователя",
      "Визуализация этапов доставки заказа",
      "График накопления на пенсионном счете"
    ],
    "education_examples": [
      "Прогресс-бар прохождения курса с процентом завершения",
      "Карта курса с модулями и темами, где пройденные отмечены",
      "Визуализация роста навыков в радар-диаграмме"
    ],
    "abuse_risks": [
      "Визуальные манипуляции (прогресс-бар, который быстро заполняется вначале и медленно в конце)",
      "Создание ложного ощущения прогресса через декоративные элементы",
      "Информационная перегрузка сложными визуализациями"
    ],
    "ethical_constraints": [
      "Визуализация должна точно отражать реальный прогресс",
      "Дизайн должен быть доступен для людей с особенностями восприятия цвета/формы",
      "Сложные визуализации должны сопровождаться текстовыми пояснениями"
    ],
    "toxicity_level": "low",
    "risk_color": "green",
    "scaling_risk": "С ростом количества метрик прогресса сложно создавать неперегруженные визуализации. Персонализация визуализаций под разные типы пользователей требует значительных ресурсов. Консистентность дизайна при добавлении новых элементов прогресса.",
    "related_mechanics": ["points_accumulation", "progress_threshold", "collection"]
  },
  {
    "id": "content_unlock",
    "name": "Разблокировка контента",
    "layer": "progression",
    "description": "Предоставление доступа к новому контенту (уровням, функциям, возможностям, историям) по достижении определенного прогресса. Является основной наградой за прогресс.",
    "tags": ["доступ", "награда", "новизна", "открытие"],
    "interaction_type": ["mental"],
    "motivation": {
      "type": "extrinsic",
      "notes": "Конкретная, осязаемая награда за усилия. Создает ощущение достижения и предоставляет новый опыт как вознаграждение за прогресс."
    },
    "game_examples": [
      {
        "title": "Платформеры",
        "implementation": "Новые уровни открываются после прохождения предыдущих"
      },
      {
        "title": "Стратегии",
        "implementation": "Новые юниты и технологии открываются по мере развития"
      }
    ],
    "product_examples": [
      "Премиум-функции, открывающиеся после определенного времени использования",
      "Доступ к beta-тестированию новых функций для активных пользователей",
      "Разблокировка профессиональных инструментов после прохождения обучения"
    ],
    "education_examples": [
      "Доступ к продвинутым модулям после сдачи базовых",
      "Открытие дополнительных материалов и исследований по теме",
      "Доступ к лабораторному оборудованию после прохождения ТБ"
    ],
    "abuse_risks": [
      "Искусственное сокрытие базового функционала за прогрессом",
      "Создание зависимости от постоянной разблокировки нового контента",
      "Несправедливое распределение доступа, создающее элитарность"
    ],
    "ethical_constraints": [
      "Базовый функционал должен быть доступен без требований прогресса",
      "Критерии разблокировки должны быть педагогически обоснованны",
      "Альтернативные пути доступа для пользователей с разными способностями"
    ],
    "toxicity_level": "medium",
    "risk_color": "yellow",
    "scaling_risk": "При постоянном добавлении нового контента возникает проблема 'раздутия' — пользователи никогда не чувствуют завершенности. Также сложность балансировки ценности разблокируемого контента: новые вещи не должны обесценивать старые, но должны быть достаточно ценными.",
    "related_mechanics": ["levels", "progress_threshold", "horizontal_progress"]
  },
  {
    "id": "stat_enhancement",
    "name": "Усиление характеристик",
    "layer": "progression",
    "description": "Увеличение числовых параметров пользователя или его аватара (сила, ловкость, интеллект, здоровье и т.д.), улучшающее эффективность в определенных действиях.",
    "tags": ["рост", "улучшение", "параметры", "специализация"],
    "interaction_type": ["mental"],
    "motivation": {
      "type": "hybrid",
      "notes": "Экстринсивная: конкретное улучшение возможностей, делающее достижение целей проще. Интринсивная: чувство роста и развития, кастомизация под свой стиль игры/обучения."
    },
    "game_examples": [
      {
        "title": "RPG",
        "implementation": "Увеличение характеристики 'Сила' повышает урон в ближнем бою"
      },
      {
        "title": "Спортивные симуляторы",
        "implementation": "Улучшение скорости, выносливости, точности игрока"
      }
    ],
    "product_examples": [
      "Увеличение лимитов хранилища или пропускной способности",
      "Повышение приоритета поддержки или скорости обработки запросов",
      "Улучшение качества рекомендаций на основе обучения алгоритмов"
    ],
    "education_examples": [
      "Рост показателей по конкретным навыкам (скорость чтения, точность вычислений)",
      "Увеличение 'емкости памяти' для запоминания информации",
      "Повышение 'критического мышления' для решения сложных задач"
    ],
    "abuse_risks": [
      "Создание непропорционального преимущества опытных пользователей над новичками",
      "Минимизация разнообразия через определение 'оптимальных' сборок",
      "Зависимость от постоянного роста характеристик (синдром 'белки в колесе')"
    ],
    "ethical_constraints": [
      "Характеристики должны отражать реальные компетенции или усилия",
      "Система должна позволять разные стили игры/обучения, а не одну оптимальную сборку",
      "Новички должны иметь шанс против опытных в определенных условиях"
    ],
    "toxicity_level": "medium",
    "risk_color": "yellow",
    "scaling_risk": "Power creep: новые характеристики или улучшения должны быть сильнее старых, чтобы быть интересными, что ведет к инфляции силы и обесцениванию старого контента. Также сложность баланса между разными характеристиками при расширении системы.",
    "related_mechanics": ["vertical_progress", "skill_mastery", "upgrade"]
  },
  {
    "id": "restriction_reduction",
    "name": "Ослабление ограничений",
    "layer": "progression",
    "description": "Уменьшение или снятие ограничений, наложенных на новичков, по мере роста опыта и мастерства пользователя. Предоставляет больше свободы и возможностей.",
    "tags": ["свобода", "доверие", "автономия", "зрелость"],
    "interaction_type": ["mental"],
    "motivation": {
      "type": "intrinsic",
      "notes": "Удовлетворяет потребность в автономии и контроле. Вознаграждает мастерство не новой наградой, а снижением контроля и увеличением доверия системы к пользователю."
    },
    "game_examples": [
      {
        "title": "Игры с туториалами",
        "implementation": "Исчезновение подсказок и ограничивающих элементов интерфейса"
      },
      {
        "title": "Экономические симуляторы",
        "implementation": "Снятие лимитов на торговые операции для опытных игроков"
      }
    ],
    "product_examples": [
      "Уменьшение частоты капчи или двухфакторной аутентификации для доверенных устройств",
      "Снятие лимитов на операции для проверенных пользователей",
      "Предоставление доступа к экспериментальным функциям для опытных"
    ],
    "education_examples": [
      "Снятие ограничений на использование справочных материалов на экзаменах для продвинутых студентов",
      "Уменьшение контроля самостоятельной работы по мере демонстрации ответственности",
      "Предоставление доступа к опасному оборудованию после подтверждения компетенций"
    ],
    "abuse_risks": [
      "Преждевременное снятие ограничений, ведущее к ошибкам и злоупотреблениям",
      "Создание неявных барьеров для пользователей, которые не достигают критериев ослабления",
      "Потеря контроля над системой при массовом снятии ограничений"
    ],
    "ethical_constraints": [
      "Критерии ослабления должны быть четкими и достижимыми",
      "Пользователи должны понимать новые риски, связанные со свободой",
      "Должна быть возможность возврата ограничений при злоупотреблениях"
    ],
    "toxicity_level": "low",
    "risk_color": "green",
    "scaling_risk": "При масштабировании сложно персонализировать момент снятия ограничений. Автоматизированные системы могут ошибочно снимать ограничения или, наоборот, никогда не снимать их. Также риск создания двух классов пользователей: 'доверенных' и 'ограниченных'.",
    "related_mechanics": ["skill_mastery", "trust_mechanic", "protected_environment"]
  },
  {
    "id": "horizontal_progress",
    "name": "Горизонтальный прогресс",
    "layer": "progression",
    "description": "Расширение возможностей пользователя без увеличения их 'силы' или эффективности. Добавление новых вариантов, стилей, подходов, а не улучшение существующих.",
    "tags": ["разнообразие", "вариативность", "широта", "коллекция"],
    "interaction_type": ["mental"],
    "motivation": {
      "type": "intrinsic",
      "notes": "Удовлетворяет потребность в самовыражении, любопытстве и разнообразии. Позволяет пользователю находить свой уникальный стиль и подход, а не следовать оптимизированному пути."
    },
    "game_examples": [
      {
        "title": "Игры с кастомизацией",
        "implementation": "Открытие новых скинов, экипировки, эмотов, не влияющих на геймплей"
      },
      {
        "title": "Стратегии",
        "implementation": "Разблокировка новых фракций или цивилизаций с уникальными механиками, но сбалансированными по силе"
      }
    ],
    "product_examples": [
      "Доступ к новым темам оформления, шрифтам, настройкам интерфейса",
      "Разблокировка дополнительных способов организации информации (разные виды таблиц, досок)",
      "Новые экспорты и интеграции без улучшения основных функций"
    ],
    "education_examples": [
      "Изучение альтернативных методов решения задач",
      "Доступ к материалам из разных культурных контекстов по одной теме",
      "Возможность выбрать формат представления результатов (эссе, презентация, видео)"
    ],
    "abuse_risks": [
      "Раздутие контента без реальной ценности ('коллекция ради коллекции')",
      "Сокрытие вертикального прогресса за видимостью горизонтального",
      "Перегрузка пользователя выбором без четких критериев (паралич анализа)"
    ],
    "ethical_constraints": [
      "Горизонтальный прогресс должен иметь реальную ценность для пользователя, а не быть просто 'заполнителем'",
      "Должна быть ясная навигация по множеству опций",
      "Не должно быть скрытого вертикального прогресса в замаскированном виде"
    ],
    "toxicity_level": "low",
    "risk_color": "green",
    "scaling_risk": "При постоянном добавлении горизонтального контента возникает проблема discoverability: пользователи не знают о существовании многих опций. Также сложность поддержания баланса и актуальности всех вариантов. Риск фрагментации сообщества на группы, пользующиеся разными опциями.",
    "related_mechanics": ["collection", "self_expression", "content_unlock"]
  },
  {
    "id": "vertical_progress",
    "name": "Вертикальный прогресс",
    "layer": "progression",
    "description": "Повышение эффективности, мощности, скорости или других количественных показателей пользователя. Делает выполнение тех же задач быстрее, легче или с лучшими результатами.",
    "tags": ["сила", "эффективность", "мощность", "оптимизация"],
    "interaction_type": ["mental"],
    "motivation": {
      "type": "extrinsic",
      "notes": "Прямое и измеримое улучшение результатов. Позволяет достигать большего с теми же усилиями или те же результаты с меньшими усилиями. Создает ощущение роста и компетентности."
    },
    "game_examples": [
      {
        "title": "RPG прокачка",
        "implementation": "Увеличение урона оружия, запаса здоровья, скорости атаки"
      },
      {
        "title": "Инкрементальные игры",
        "implementation": "Улучшение генерации ресурсов за клик или за время"
      }
    ],
    "product_examples": [
      "Повышение скорости обработки данных или отклика интерфейса",
      "Увеличение лимитов на операции или объемы хранения",
      "Автоматизация рутинных действий, ранее требовавших ручного вмешательства"
    ],
    "education_examples": [
      "Увеличение скорости чтения или решения типовых задач",
      "Повышение точности выполнения операций (меньше ошибок)",
      "Способность решать более сложные задачи того же типа"
    ],
    "abuse_risks": [
      "Создание непреодолимого разрыва между новичками и опытными",
      "Обесценивание раннего контента и опыта новых пользователей",
      "Зависимость от постоянного роста показателей (гонка вооружений)"
    ],
    "ethical_constraints": [
      "Вертикальный прогресс не должен создавать несправедливых преимуществ в конкурентных условиях",
      "Должны существовать механизмы защиты новичков от доминирования опытных",
      "Прогресс должен быть обоснован реальным ростом компетенций"
    ],
    "toxicity_level": "high",
    "risk_color": "red",
    "scaling_risk": "Power creep: постоянное добавление новых уровней вертикального прогресса требует постоянного усложнения контента, что создает барьер для новых пользователей. Также проблема ребалансировки всей системы при введении новых элементов вертикального прогресса.",
    "related_mechanics": ["stat_enhancement", "upgrade", "levels"]
  },
  {
    "id": "skill_mastery",
    "name": "Мастерство навыка",
    "layer": "progression",
    "description": "Глубокое, качественное освоение конкретного навыка или действия, выходящее за рамки базовой компетенции. Включает тонкое понимание, адаптивность и творческое применение.",
    "tags": ["экспертность", "глубина", "качество", "искусство"],
    "interaction_type": ["physical", "mental"],
    "motivation": {
      "type": "intrinsic",
      "notes": "Удовлетворяет потребность в компетентности, совершенстве и самоактуализации. Радость от владения навыком на уровне, позволяющем решать нестандартные задачи и получать эстетическое удовольствие от процесса."
    },
    "game_examples": [
      {
        "title": "Спортивные симуляторы",
        "implementation": "Идеальное выполнение сложных трюков после сотен часов тренировки"
      },
      {
        "title": "Музыкальные игры (Guitar Hero)",
        "implementation": "Игра сложнейших композиций на максимальной сложности без ошибок"
      }
    ],
    "product_examples": [
      "Владение профессиональным инструментом на уровне, позволяющем создавать сложные workflows",
      "Глубокое понимание платформы, позволяющее решать нестандартные задачи",
      "Экспертное использование языка запросов или скриптового языка системы"
    ],
    "education_examples": [
      "Свободное владение иностранным языком с пониманием нюансов и идиом",
      "Глубокое понимание математической теории, позволяющее доказывать новые теоремы",
      "Мастерское владение лабораторным оборудованием для проведения оригинальных исследований"
    ],
    "abuse_risks": [
      "Элитизм и создание закрытых сообществ 'мастеров'",
      "Демотивация новичков из-за кажущейся недостижимости мастерства",
      "Подмена реального мастерства механическим повторением (натаскивание)"
    ],
    "ethical_constraints": [
      "Путь к мастерству должен быть доступен для всех желающих при достаточных усилиях",
      "Система должна признавать разные стили и подходы к мастерству, а не один 'канонический'",
      "Мастерство не должно использоваться для доминирования или подавления других"
    ],
    "toxicity_level": "medium",
    "risk_color": "yellow",
    "scaling_risk": "С ростом числа пользователей сложно оценивать истинное мастерство, а не статистические показатели. Риск создания 'метагейма' — оптимальных путей достижения мастерства, которые вытесняют разнообразие. Также сложность поддержания значимости мастерства при добавлении новых навыков.",
    "related_mechanics": ["action_chain", "achievements", "reputation_system"]
  }
]