[
  {
    "id": "achievements",
    "name": "Достижения",
    "layer": "psychology",
    "description": "Виртуальные значки, трофеи или записи, отмечающие выполнение пользователем конкретных, часто неочевидных или сложных задач. Служат внешним маркером мастерства и опыта.",
    "tags": ["трофеи", "значки", "мастерство", "признание"],
    "interaction_type": ["mental"],
    "motivation": {
      "type": "extrinsic",
      "notes": "Конкретное, часто публичное подтверждение компетентности и завершенности. Удовлетворяет потребность в коллекционировании, завершении наборов и социальном сравнении ('show off')."
    },
    "game_examples": [
      {
        "title": "Xbox Achievements, PlayStation Trophies, Steam Achievements",
        "details": "Система кросс-игровых достижений за выполнение специфических внутриигровых задач (пройти игру на сложности, найти все секреты, выполнить комбо)."
      },
      {
        "title": "World of Warcraft Achievements",
        "details": "Огромная внутриигровая система достижений за исследование, PvP, PvE, коллекционирование, отмечающая прогресс игрока."
      }
    ],
    "product_examples": [
      "Бейджи или сертификаты за завершение онлайн-курсов (Coursera, Udemy)",
      "Награды за активность в приложениях (Foursquare/Swarm badges)",
      "Внутрикорпоративные награды за стаж или выполнение целей"
    ],
    "education_examples": [
      "Сертификаты об окончании курсов, дипломы, грамоты за участие в олимпиадах",
      "Цифровые бейджи за освоение микро-навыков (цифровая грамотность, soft skills)",
      "Система 'достижений' в обучающей платформе за активность (первый пост на форуме, сдача работы вовремя)",
      "Портфолио студента, куда собираются все академические и внеучебные достижения"
    ],
    "abuse_risks": [
      "Подмена цели процессом: погоня за достижениями вместо реального обучения или удовольствия",
      "Формирование обсессивно-компульсивного поведения (необходимость 'почистить' все достижения)",
      "Достижения за тривиальные или обязательные действия, обесценивающие систему"
    ],
    "ethical_constraints": [
      "Достижения должны отмечать реальные усилия или мастерство, а не просто наличие времени",
      "Не должно быть достижений, поощряющих вредное или антисоциальное поведение",
      "В образовании достижения должны отражать рост компетенций, а не просто активность"
    ],
    "toxicity_level": "low",
    "risk_color": "green",
    "scaling_risk": "При добавлении сотен достижений возникает проблема discoverability и ценности: пользователь не знает о многих из них, а их получение перестает быть значимым. Также сложность балансировки: достижения не должны быть ни слишком легкими, ни невозможными для большинства.",
    "related_mechanics": ["collection", "status_display", "completionism"]
  },
  {
    "id": "collection",
    "name": "Коллекционирование",
    "layer": "psychology",
    "description": "Побуждение пользователя к сбору полного набора связанных предметов, персонажей, знаний или других элементов. Эксплуатирует потребность в завершенности и порядке.",
    "tags": ["сбор", "комплект", "полнота", "организация"],
    "interaction_type": ["mental"],
    "motivation": {
      "type": "intrinsic",
      "notes": "Глубокое психологическое удовлетворение от завершения паттерна, приведения мира в порядок, обладания полным набором. Активирует центры вознаграждения в мозгу при нахождении недостающего элемента."
    },
    "game_examples": [
      {
        "title": "Pokémon",
        "details": "Фраза 'Поймай их всех' (Gotta Catch 'Em All) — фундаментальная механика сбора всех покемонов в Покедексе."
      },
      {
        "title": "Коллекционные карточные игры (Magic: The Gathering, Hearthstone)",
        "details": "Сбор полных сетов карт для построения колод и ради самого обладания коллекцией."
      }
    ],
    "product_examples": [
      "Программы лояльности с набором штампов для бесплатного продукта",
      "Сбор наклеек или карточек в потребительских товарах",
      "Коллекционирование NFT или цифровых предметов искусства"
    ],
    "education_examples": [
      "Сбор всех сертификатов в профессиональной траектории (например, все курсы по Data Science)",
      "Составление полной библиографии по теме исследования",
      "Коллекционирование решенных типов задач или изученных методов в предмете",
      "Создание личного глоссария или базы знаний по курсу"
    ],
    "abuse_risks": [
      "Провоцирование обсессивно-компульсивного расстройства (ОКР) или навязчивого поведения",
      "Монетизация через продажу редких элементов коллекции, создающая pay-to-win или несправедливость",
      "Фрустрация и разочарование, если завершение коллекции невозможно (ограниченный тираж, удаленный контент)"
    ],
    "ethical_constraints": [
      "Коллекция должна быть в принципе завершаемой при разумных усилиях",
      "Редкие элементы не должны блокировать доступ к игровому или образовательному прогрессу",
      "Не следует эксплуатировать уязвимости людей, склонных к компульсивному собирательству"
    ],
    "toxicity_level": "medium",
    "risk_color": "yellow",
    "scaling_risk": "При постоянном добавлении новых элементов в коллекцию возникает ощущение 'беличьего колеса' — её никогда нельзя завершить. Управление балансом между редкостью и доступностью элементов для большей аудитории сложно. В больших коллекциях поиск и организация элементов становятся проблемой.",
    "related_mechanics": ["set_completion", "completionism", "curation"]
  },
  {
    "id": "set_completion",
    "name": "Завершение набора",
    "layer": "psychology",
    "description": "Конкретный момент или действие, когда пользователь завершает сбор всей коллекции или набора элементов. Сопровождается значительной наградой и чувством завершенности.",
    "tags": ["завершение", "награда_за_набор", "миссия_выполнена", "целостность"],
    "interaction_type": ["mental"],
    "motivation": {
      "type": "intrinsic",
      "notes": "Мощное чувство удовлетворения, закрытия гештальта и достижения. Мозг выделяет дофамин в момент завершения долгосрочной цели. Является кульминацией процесса коллекционирования."
    },
    "game_examples": [
      {
        "title": "Игры с системами достижений",
        "details": "Получение платинового трофея/достижения за сбор всех остальных трофеев в игре."
      },
      {
        "title": "Сбор комплектов экипировки в RPG",
        "details": "Нахождение последней части сетового доспеха, что активирует бонус за полный комплект."
      }
    ],
    "product_examples": [
      "Получение главного приза после сбора всех штампов в карте лояльности",
      "Бонус за подписку на все сервисы экосистемы (Apple One, Microsoft 365)",
      "Скидка за покупку полной линейки продуктов"
    ],
    "education_examples": [
      "Получение диплома после завершения всех курсов учебной программы",
      "Сертификат об окончании специализации после прохождения всех входящих в неё курсов",
      "Завершение личного учебного челленджа (прочитать 10 книг по теме, решить 100 задач)",
      "Сбор полного портфолио проектов по освоенной специальности"
    ],
    "abuse_risks": [
      "Чрезмерно высокие требования для завершения, ведущие к выгоранию",
      "Искусственное создание 'последнего редкого элемента', который почти невозможно получить, чтобы заставить пользователя тратить деньги/время",
      "Разочарование после завершения, если нет новой значимой цели (пост-достиженческая депрессия)"
    ],
    "ethical_constraints": [
      "Награда за завершение должна быть соразмерна затраченным усилиям",
      "Должны быть альтернативные пути получения редких элементов, а не только платные или основанные на чистой удаче",
      "После завершения одного набора должна открываться новая, необязательная, но интересная цель"
    ],
    "toxicity_level": "low",
    "risk_color": "green",
    "scaling_risk": "С ростом количества наборов и коллекций в системе поддержание ценности и значимости каждого завершения становится сложным. Наборы могут начать восприниматься как рутина. Также сложно балансировать награды, чтобы завершение одного набора не обесценивало другие.",
    "related_mechanics": ["collection", "achievements", "closure"]
  },
  {
    "id": "fomo",
    "name": "FOMO (Страх упустить выгоду)",
    "layer": "psychology",
    "description": "Чувство тревоги или беспокойства, что другие получают rewarding опыт или возможности, которые ты упускаешь. Используется для создания срочности и побуждения к немедленному действию.",
    "tags": ["срочность", "тревога", "ограничение", "не_упусти"],
    "interaction_type": ["mental"],
    "motivation": {
      "type": "extrinsic",
      "notes": "Отрицательное подкрепление через страх потери. Сильный внешний стимул, основанный на социальном сравнении и желании не отстать от группы или не потерять уникальную возможность."
    },
    "game_examples": [
      {
        "title": "Сезонные события и battle passes",
        "details": "Ограниченные по времени награды, косметика или контент, которые исчезают навсегда после окончания сезона, заставляя играть регулярно."
      },
      {
        "title": "Лимитированные издания или предзаказы",
        "details": "Игра или предметы, доступные только ограниченное время или в ограниченном количестве."
      }
    ],
    "product_examples": [
      "Всплывающие окна 'Последние 2 места по этой цене!' или 'Акция заканчивается через 1 час!'",
      "Уведомления 'Ваш друг только что купил этот товар'",
      "Функции 'Последний просмотренный' или 'Часто покупают вместе'"
    ],
    "education_examples": [
      "Ограниченный набор на престижный курс или программу",
      "Дедлайны на подачу заявок на гранты, стажировки, конференции",
      "Вебинар или мастер-класс известного эксперта, который не будет записан",
      "Временный бесплатный доступ к платному образовательному ресурсу"
    ],
    "abuse_risks": [
      "Вызывает хроническую тревожность, стресс и принятие необдуманных решений",
      "Эксплуатация психологической уязвимости, особенно у молодых и впечатлительных пользователей",
      "Может привести к финансовым потерям или перегруженности обязательствами"
    ],
    "ethical_constraints": [
      "Не следует создавать искусственное ощущение дефицита там, где его нет",
      "Критически важный образовательный контент не должен быть доступен только ограниченное время",
      "Пользователей следует учить осознанно управлять своим FOMO, а не только эксплуатировать его"
    ],
    "toxicity_level": "high",
    "risk_color": "red",
    "scaling_risk": "При частом использовании пользователи могут стать невосприимчивыми к FOMO или, наоборот, испытывать постоянный стресс и в итоге покинуть систему. В больших сообществах FOMO может создавать волны массовой истерии и нерационального поведения. Сложность калибровки: слишком слабый FOMO не работает, слишком сильный — отталкивает.",
    "related_mechanics": ["limited_window", "social_comparison", "scarcity_tactics"]
  },
  {
    "id": "curiosity",
    "name": "Любопытство",
    "layer": "psychology",
    "description": "Внутреннее побуждение исследовать, узнавать новое, раскрывать тайны и заполнять пробелы в знаниях. Фундаментальный драйвер обучения и вовлеченности.",
    "tags": ["исследование", "интрига", "вопрос", "открытие"],
    "interaction_type": ["mental"],
    "motivation": {
      "type": "intrinsic",
      "notes": "Одно из самых чистых форм внутренней мотивации. Удовольствие от самого процесса поиска ответов, решения головоломок, удовлетворение информационного голода. Связано с выбросом дофамина при обучении новому."
    },
    "game_examples": [
      {
        "title": "Игры-исследования и мистерии (The Witness, Outer Wilds)",
        "details": "Игровой мир полон загадок и странностей, которые не объясняются прямо, побуждая игрока самостоятельно выяснять правила и историю."
      },
      {
        "title": "Игры с environmental storytelling (Dark Souls, BioShock)",
        "details": "Сюжет и лор раскрываются не через кат-сцены, а через предметы, дизайн уровней и короткие описания, которые нужно собирать воедино."
      }
    ],
    "product_examples": [
      "Интерфейсы, которые поощряют исследование через Easter eggs или скрытые жесты",
      "Продукты, которые постепенно раскрывают свои возможности (Progressive Disclosure)",
      "Маркетинг, построенный на интриге и загадках (тизерные кампании)"
    ],
    "education_examples": [
      "Проблемное обучение: начало урока с intriguing вопроса или парадокса",
      "Исследовательские проекты, где студенты сами формулируют вопросы и ищут ответы",
      "Использование загадок, головоломок и квестов для преподавания материала",
      "Предоставление неполных данных или противоречивых источников для стимулирования критического анализа"
    ],
    "abuse_risks": [
      "Создание ложной или бессмысленной интриги, которая разочаровывает при раскрытии",
      "Чрезмерная сложность или непонятность, ведущая к фрустрации, а не любопытству",
      "Манипуляция: пробуждение любопытства к контенту, который является просто рекламой или низкокачественным"
    ],
    "ethical_constraints": [
      "Интрига должна вести к содержательному открытию или знанию, а не быть пустой",
      "Не следует эксплуатировать любопытство для раскрытия травмирующего или неподходящего контента",
      "В образовании любопытство должно направляться к достижению учебных целей"
    ],
    "toxicity_level": "low",
    "risk_color": "green",
    "scaling_risk": "Сложно поддерживать постоянный уровень интриги и новизны для опытных пользователей. При массовом использовании секреты быстро раскрываются сообществом, что может лишить новых пользователей удовольствия самостоятельного открытия. Баланс между подсказками и полной неопределенностью тонок.",
    "related_mechanics": ["discovery", "information_revelation", "mystery"]
  },
  {
    "id": "self_expression",
    "name": "Самовыражение",
    "layer": "psychology",
    "description": "Возможность для пользователя проявить свою индивидуальность, творчество и личные предпочтения через кастомизацию аватара, пространства, стиля игры или созданного контента.",
    "tags": ["индивидуальность", "кастомизация", "творчество", "идентичность"],
    "interaction_type": ["mental"],
    "motivation": {
      "type": "intrinsic",
      "notes": "Фундаментальная потребность в самоактуализации и демонстрации уникального 'Я'. Удовольствие от творчества, контроля над своим представлением в цифровом мире и получения социальной обратной связи на свое творение."
    },
    "game_examples": [
      {
        "title": "Игры с глубокой кастомизацией персонажа (The Sims, RPG)",
        "details": "Создание уникального внешнего вида, выбора одежды, черт характера, дома."
      },
      {
        "title": "Игры-песочницы (Minecraft, Roblox)",
        "details": "Возможность строить уникальные миры, создавать свои игры или предметы."
      }
    ],
    "product_examples": [
      "Настройка профилей в соцсетях, темы оформления в приложениях",
      "Платформы для создания личных сайтов, портфолио, блогов (Wix, WordPress)",
      "Продукты, позволяющие настраивать рабочие процессы или интерфейсы под себя"
    ],
    "education_examples": [
      "Создение личного учебного блога, портфолио или цифровой тетради",
      "Выбор темы для исследовательского проекта, отражающей личные интересы студента",
      "Кастомизация плана обучения или траектории в рамках курса",
      "Творческие задания, где важен не только результат, но и уникальный подход (эссе, арт-проекты, презентации)"
    ],
    "abuse_risks": [
      "Монетизация самовыражения, создающая неравенство (дорогая косметика = более высокий статус)",
      "Давление соответствовать трендам или определенным стандартам в сообществе",
      "Использование самовыражения для троллинга, провокаций или нарушения норм (оскорбительные имена, символы)"
    ],
    "ethical_constraints": [
      "Базовые средства самовыражения должны быть доступны бесплатно",
      "Система должна балансировать свободу выражения с необходимостью поддерживать уважительную и безопасную среду",
      "В образовании важно оценивать суть работы, а не только её эстетическое оформление"
    ],
    "toxicity_level": "low",
    "risk_color": "green",
    "scaling_risk": "В больших системах модерация пользовательского контента, созданного для самовыражения, становится огромной проблемой. Обеспечение совместимости и стабильности при огромном количестве кастомизационных опций технически сложно. Риск фрагментации сообщества на множество микрогрупп со своими нормами самовыражения.",
    "related_mechanics": ["personalization", "creativity", "identity_formation"]
  },
  {
    "id": "role_identification",
    "name": "Ролевая идентификация",
    "layer": "psychology",
    "description": "Процесс, при котором пользователь мысленно принимает на себя роль персонажа, эксперта, лидера или другого аватара в системе, начиная действовать и принимать решения в соответствии с этой ролью.",
    "tags": ["вживание_в_роль", "аватар", "перспектива", "симуляция"],
    "interaction_type": ["mental"],
    "motivation": {
      "type": "intrinsic",
      "notes": "Глубокое погружение, эскапизм и возможность безопасно экспериментировать с разными идентичностями, навыками и типами поведения. Развивает эмпатию и понимание разных точек зрения."
    },
    "game_examples": [
      {
        "title": "Ролевые игры (Dungeons & Dragons, компьютерные RPG)",
        "details": "Игрок создает персонажа с определенной биографией, характером, моральным компасом и принимает решения от его лица."
      },
      {
        "title": "Симуляторы (Flight Simulator, Surgeon Simulator)",
        "details": "Игрок идентифицирует себя с пилотом или хирургом, стараясь выполнять действия профессионально."
      }
    ],
    "product_examples": [
      "Программы для тренировки публичных выступлений или собеседований с виртуальной аудиторией",
      "Сервисы, где пользователь выступает в роли консультанта или эксперта (например, на Q&A платформах)",
      "Корпоративные тренинги с ролевыми играми"
    ],
    "education_examples": [
      "Метод case study, где студенты анализируют ситуацию с позиции конкретного участника (CEO, инженера, политика)",
      "Исторические реконструкции или симуляции, где студенты играют роли исторических фигур",
      "Изучение литературы через 'вхождение в роль' персонажа и анализ его мотивов",
      "Профессиональные пробы и симуляции рабочих мест (например, суд присяжных, научная лаборатория)"
    ],
    "abuse_risks": [
      "Размывание границ между ролью и реальностью, особенно у молодых или впечатлительных пользователей",
      "Укрепление стереотипов через упрощенные или карикатурные роли",
      "Эмоциональное выгорание или дистресс от погружения в тяжелые или травмирующие ролевые ситуации (например, в исторических симуляциях войн)"
    ],
    "ethical_constraints": [
      "Ролевые симуляции должны проводиться в безопасной, поддерживающей среде с возможностью выхода",
      "Важно проводить 'дебрифинг' после ролевой игры, чтобы отделить игровой опыт от реальности",
      "Роли должны быть уважительными и не увековечивать вредные стереотипы"
    ],
    "toxicity_level": "medium",
    "risk_color": "yellow",
    "scaling_risk": "Сложно создавать персонализированные и глубокие ролевые опыты для массовой аудитории — они часто становятся шаблонными. В многопользовательских ролевых играх могут возникать конфликты из-за разного понимания ролей и 'отыгрыша'. Модерация ролевого поведения (roleplay) сложна, так как требует понимания контекста.",
    "related_mechanics": ["immersion", "perspective_taking", "simulation"]
  },
  {
    "id": "challenge",
    "name": "Вызов",
    "layer": "psychology",
    "description": "Предложение пользователю задачи, сложность которой оптимально соответствует или слегка превышает его текущий уровень навыков. Создает условия для состояния потока (flow) и роста.",
    "tags": ["сложность", "поток", "рост", "оптимальный_уровень"],
    "interaction_type": ["mental"],
    "motivation": {
      "type": "intrinsic",
      "notes": "Внутреннее стремление к преодолению, росту и проверке своих способностей. Удовольствие от концентрации, приложения усилий и успешного решения трудной задачи. Ведущий к развитию компетентности."
    },
    "game_examples": [
      {
        "title": "Игры с настраиваемой сложностью (Celeste)",
        "details": "Игра предлагает невероятно сложные платформенные испытания, но с щедрой системой чекпоинтов и вспомогательными режимами, позволяющими каждому найти свой уровень вызова."
      },
      {
        "title": "Соревновательные игры с ранговой системой",
        "details": "Матчмейкинг подбирает противников примерно равного уровня, создавая честный и сложный матч в каждом бою."
      }
    ],
    "product_examples": [
      "Приложения для изучения языка, которые адаптируют сложность упражнений (Duolingo)",
      "Фитнес-приложения, увеличивающие нагрузку по мере прогресса",
      "Профессиональные тренажеры с увеличивающейся сложностью сценариев"
    ],
    "education_examples": [
      "Адаптивное обучение, где следующее задание зависит от успехов в предыдущем",
      "Дифференциация заданий: предоставление заданий разного уровня сложности на выбор или в зависимости от уровня студента",
      "Постановка учебных целей по методу SMART (конкретные, измеримые, достижимые, релевантные, ограниченные по времени)",
      "Использование проектов открытого типа (open-ended), где сложность определяется амбициями студента"
    ],
    "abuse_risks": [
      "Неадекватно завышенная сложность, ведущая к фрустрации и отказу",
      "Слишком низкая сложность, вызывающая скуку и отсутствие прогресса",
      "Давление принимать вызовы, к которым пользователь не готов"
    ],
    "ethical_constraints": [
      "Вызов должен быть добровольным, с возможностью отступить или снизить сложность без стыда",
      "Система должна точно оценивать текущий уровень навыков пользователя, чтобы предлагать адекватные вызовы",
      "В образовании вызов должен вести к освоению учебного материала, а не быть самоцелью"
    ],
    "toxicity_level": "low",
    "risk_color": "green",
    "scaling_risk": "Персонализация вызовов для миллионов пользователей с разными навыками, стилями обучения и темпами прогресса — крайне сложная задача AI/ML. Риск создания 'локальных оптимумов', где система застревает в предложении вызовов одного типа. Сложность обновления контента: новые вызовы должны оставаться сбалансированными для всей существующей аудитории.",
    "related_mechanics": ["flow_state", "adaptive_difficulty", "skill_development"]
  },
  {
    "id": "flow_state",
    "name": "Поток",
    "layer": "psychology",
    "description": "Психическое состояние полного погружения и сосредоточенности на деятельности, сопровождаемое чувством полного контроля, потерей ощущения времени и внутренним удовлетворением. Возникает при идеальном балансе между вызовом и навыками.",
    "tags": ["погружение", "концентрация", "удовольствие_от_процесса", "оптимальный_опыт"],
    "interaction_type": ["mental"],
    "motivation": {
      "type": "intrinsic",
      "notes": "Высшая форма внутренней мотивации. Состояние само по себе является наградой — приносит глубокое удовлетворение, ощущение осмысленности и эффективности. Связано с выбросом нейромедиаторов, связанных с удовольствием и фокусом (дофамин, норадреналин)."
    },
    "game_examples": [
      {
        "title": "Игры с плавным, требовательным геймплеем (серия Souls, хардкорные платформеры)",
        "details": "Высокая, но справедливая сложность требует полной концентрации, что при успехе погружает в состояние потока."
      },
      {
        "title": "Ритм-игры (Beat Saber, Guitar Hero)",
        "details": "Синхронизация действий с музыкой на подходящей сложности легко вызывает состояние потока."
      }
    ],
    "product_examples": [
      "Дизайн интерфейсов, минимизирующий отвлечения и создающий плавный workflow (например, в профессиональных инструментах вроде Figma или код-редакторах)",
      "Приложения для медитации или фокусировки (например, использующие технику Pomodoro)",
      "Сервисы, которые структурируют сложную работу на управляемые этапы"
    ],
    "education_examples": [
      "Организация учебного процесса, где задания последовательны, ясны и соответствуют уровню студента",
      "Использование таймеров и методов глубокой работы (deep work) для структурирования учебных сессий",
      "Проектная работа, которая достаточно сложна, чтобы быть интересной, но не подавляющей",
      "Создание среды, свободной от внешних отвлекающих факторов, способствующей концентрации"
    ],
    "abuse_risks": [
      "Чрезмерное погружение может привести к пренебрежению базовыми потребностями (еда, сон, общение)",
      "Использование для создания зависимого поведения, когда пользователь постоянно ищет это состояние в ущерб другим сферам жизни",
      "Фрустрация и выгорание, если состояние потока постоянно прерывается (плохой дизайн, уведомления, баги)"
    ],
    "ethical_constraints": [
      "Дизайн, способствующий потоку, не должен эксплуатировать уязвимость пользователя к зависимостям",
      "Важно напоминать пользователям о необходимости перерывов и баланса",
      "В образовании поток должен вести к обучению, а не быть просто приятным времяпрепровождением"
    ],
    "toxicity_level": "low",
    "risk_color": "green",
    "scaling_risk": "Обеспечение условий для потока для разнородной аудитории невозможно с единым дизайном. То, что вызывает поток у одного (сложный интерфейс), вызывает стресс у другого. Постоянный мониторинг и адаптация для поддержания потока в долгосрочной перспективе ресурсоемки.",
    "related_mechanics": ["challenge", "immersion", "optimal_experience"]
  },
  {
    "id": "personalization",
    "name": "Персонализация",
    "layer": "psychology",
    "description": "Адаптация контента, интерфейса, рекомендаций или сложности системы под уникальные предпочтения, поведение, уровень знаний или цели конкретного пользователя.",
    "tags": ["адаптация", "индивидуальность", "рекомендации", "кастомизация"],
    "interaction_type": ["mental"],
    "motivation": {
      "type": "intrinsic",
      "notes": "Удовлетворение от того, что система 'понимает' и учитывает именно тебя. Повышает relevance опыта, снижает когнитивную нагрузку (не нужно пробираться через ненужное) и создает чувство заботы."
    },
    "game_examples": [
      {
        "title": "Адаптивные системы сложности (Left 4 Dead 'AI Director')",
        "details": "Игра динамически подстраивает количество и сложность врагов в зависимости от успешности команды игроков."
      },
      {
        "title": "Персонализированные рекомендации игр (Steam, PlayStation Store)",
        "details": "Алгоритмы предлагают игры на основе библиотеки, времени в играх и предпочтений сообщества."
      }
    ],
    "product_examples": [
      "Персонализированные ленты новостей и рекомендации (Netflix, Spotify, YouTube)",
      "Адаптивные интерфейсы и настройки по умолчанию, подстраивающиеся под паттерны использования",
      "Маркетинговые рассылки и предложения, основанные на истории покупок"
    ],
    "education_examples": [
      "Адаптивные обучающие платформы (Knewton, Smart Sparrow), меняющие материал в зависимости от ответов студента",
      "Индивидуальные траектории обучения и рекомендации курсов",
      "Персонализированные учебные планы и задания, учитывающие интересы и пробелы студента",
      "Системы, предлагающие дополнительные материалы или практику именно в тех темах, где студент слаб"
    ],
    "abuse_risks": [
      "Создание 'фильтрующего пузыря' (filter bubble) — пользователь видит только контент, соответствующий его текущим взглядам, что ограничивает кругозор",
      "Нарушение приватности через сбор данных, необходимых для персонализации",
      "Непрозрачность алгоритмов, которые могут манипулировать выбором или предлагать неоптимальные пути"
    ],
    "ethical_constraints": [
      "Пользователь должен контролировать степень персонализации и видеть, на каких данных она основана",
      "Система должна иногда предлагать контент за пределами 'пузыря' для разнообразия и роста",
      "В образовании персонализация не должна вести к изоляции студентов или полностью разным учебным опытам без веской причины"
    ],
    "toxicity_level": "medium",
    "risk_color": "yellow",
    "scaling_risk": "Техническая сложность создания точных и эффективных алгоритмов персонализации для миллионов пользователей. Риск ошибок, когда система неправильно 'понимает' пользователя и предлагает нерелевантный или даже оскорбительный контент. Поддержание и обновление моделей требует постоянных ресурсов.",
    "related_mechanics": ["adaptive_systems", "recommendation_engines", "user_modeling"]
  }
]