[
  {
    "id": "attempt_limit",
    "name": "Ограничение попыток",
    "layer": "restriction",
    "description": "Установление максимального количества раз, которое пользователь может попытаться выполнить действие, решить задачу или пройти испытание за определенный период или в целом.",
    "tags": ["лимит", "шансы", "финальность", "давление"],
    "interaction_type": ["mental"],
    "motivation": {
      "type": "extrinsic",
      "notes": "Создает высокие ставки и чувство срочности, заставляя тщательно обдумывать каждую попытку. Повышает ценность успеха и создает драматическое напряжение. Обучает расчету рисков и подготовке."
    },
    "game_examples": [
      {
        "title": "Классические аркадные игры",
        "implementation": "Игрок начинает с 3 жизней/попыток. После их потери игра заканчивается (Game Over), часто требуя новой монеты."
      },
      {
        "title": "Стратегические игры или головоломки с лимитом ходов",
        "implementation": "Уровень нужно пройти за ограниченное количество ходов или действий."
      }
    ],
    "product_examples": [
      "Ограниченное количество бесплатных пробных периодов или демо-версий",
      "Лимит на запросы к API или операции в бесплатном тарифе",
      "Количество попыток ввода неправильного пароля до блокировки аккаунта"
    ],
    "education_examples": [
      "Ограниченное количество попыток для сдачи экзамена или теста (например, 2 пересдачи)",
      "Лимит на использование подсказок или справочных материалов в ходе задания",
      "Выполнение лабораторной работы или эксперимента с ограниченным количеством реагентов или времени",
      "Участие в конкурсе или олимпиаде, где подача работы возможна только один раз"
    ],
    "abuse_risks": [
      "Чрезмерный стресс и тревожность, парализующие мышление",
      "Несправедливость, если неудача вызвана факторами вне контроля учащегося (технический сбой, плохое самочувствие)",
      "Демотивация и отказ от дальнейших попыток после исчерпания лимита"
    ],
    "ethical_constraints": [
      "Лимит должен быть разумным и соответствовать сложности задачи",
      "Должны существовать механизмы апелляции или восстановления попыток в исключительных обстоятельствах",
      "В образовании ограничение должно стимулировать ответственную подготовку, а не быть чистым наказанием"
    ],
    "toxicity_level": "high",
    "risk_color": "red",
    "scaling_risk": "Сложно установить универсальный справедливый лимит для разнородной аудитории. Автоматизированная система не может учесть индивидуальные обстоятельства каждой неудачи. При масштабировании жалобы на несправедливость лимитов могут создавать значительную нагрузку на службу поддержки.",
    "related_mechanics": ["risk_action", "resource_scarcity", "high_stakes"]
  },
  {
    "id": "permadeath",
    "name": "Перманентная смерть",
    "layer": "restriction",
    "description": "Полная и необратимая потеря прогресса, персонажа, мира или достижений при 'смерти' (неудаче). Создает максимально высокие ставки и ощущение хрупкости достижений.",
    "tags": ["необратимость", "потеря", "хардкор", "риск"],
    "interaction_type": ["mental"],
    "motivation": {
      "type": "intrinsic",
      "notes": "Глубокое эмоциональное вовлечение и предельная концентрация, так как каждое решение имеет вечные последствия. Чувство подлинного достижения и уникальности опыта, который нельзя просто переиграть. Развивает осторожность, планирование и уважение к опасности."
    },
    "game_examples": [
      {
        "title": "Roguelike игры (классические как NetHack)",
        "implementation": "Смерть персонажа означает удаление сохранения. Игрок начинает заново с пустым инвентарем, но часто с meta-знанием."
      },
      {
        "title": "Хардкор-режимы в играх (Minecraft Hardcore, Diablo)",
        "implementation": "Отдельный режим игры, где смерть персонажа блокирует мир или персонажа навсегда."
      }
    ],
    "product_examples": [
      "Удаление аккаунта или данных после длительного неиспользования (политика неактивности)",
      "Физическое уничтожение товара или актива при определенных условиях (например, конфискация)",
      "Безвозвратная потеря статуса или привилегий за серьезные нарушения"
    ],
    "education_examples": [
      "Единственная и окончательная защита диплома или диссертации (нельзя просто 'перезапустить')",
      "Участие в уникальном полевом исследовании или экспедиции, которую нельзя повторить",
      "Работа с опасными материалами или оборудованием, где ошибка ведет к реальному, необратимому ущербу (в симуляторе с высокими ставками)",
      "Изучение исторических событий, которые произошли единожды и имели необратимые последствия"
    ],
    "abuse_risks": [
      "Экстремальный стресс, тревога и потенциально травмирующий опыт от потери многих часов работы",
      "Отталкивание широкой аудитории, для которой такая жесткость неприемлема",
      "Поощрение чрезмерно осторожного, медленного и консервативного стиля, подавляющего эксперименты"
    ],
    "ethical_constraints": [
      "Должно быть абсолютно ясное и недвусмысленное предупреждение о правилах permadeath до начала",
      "Нельзя применять к прогрессу, достигнутому за реальные деньги, без крайней осторожности и согласия",
      "В образовательных симуляторах с высокими ставками (хирургия, авиация) должен быть четкий учебный контекст и разбор ошибок, а не просто 'смерть'."
    ],
    "toxicity_level": "high",
    "risk_color": "red",
    "scaling_risk": "Для большинства пользователей permadeath неприемлем, что резко ограничивает аудиторию продукта. Потеря прогресса может привести к полному уходу пользователя из системы. В многопользовательских играх permadeath одного игрока может негативно сказаться на группе. Технически сложно обеспечить 'честность' условий, ведущих к permadeath.",
    "related_mechanics": ["irreversible_consequence", "high_stakes_gameplay", "loss_aversion"]
  },
  {
    "id": "error_punishment",
    "name": "Наказание за ошибку",
    "layer": "restriction",
    "description": "Применение негативных последствий (потеря ресурсов, прогресса, времени, статуса) в ответ на неправильное действие или решение пользователя. Цель — обучение через негативное подкрепление.",
    "tags": ["штраф", "негативное_подкрепление", "обучение_на_ошибках", "последствие"],
    "interaction_type": ["mental"],
    "motivation": {
      "type": "extrinsic",
      "notes": "Формирует условный рефлекс избегания определенных действий. Делает процесс более реалистичным, так как в реальном мире ошибки часто имеют стоимость. Повышает внимательность и тщательность подготовки."
    },
    "game_examples": [
      {
        "title": "Игры с потерей опыта или валюты при смерти (Dark Souls, MMO)",
        "implementation": "После смерти игрок теряет часть нераспределенного опыта или валюты, которую должен вернуться забрать."
      },
      {
        "title": "Симуляторы с повреждением оборудования (Kerbal Space Program, симуляторы вождения)",
        "implementation": "Неудачная посадка или авария повреждают или уничтожают дорогостоящий аппарат."
      }
    ],
    "product_examples": [
      "Штрафы за просрочку платежа или отмену бронирования",
      "Снижение кредитного рейтинга при финансовых нарушениях",
      "Временная блокировка функционала за нарушение правил сообщества"
    ],
    "education_examples": [
      "Снижение оценки за сдачу работы после дедлайна",
      "Потеря баллов за неправильные ответы в тестах (negative marking)",
      "Необходимость переделать лабораторную работу или проект с нуля после фундаментальной ошибки",
      "Потеря привилегий (например, доступа к оборудованию) за нарушение техники безопасности"
    ],
    "abuse_risks": [
      "Создание атмосферы страха, подавляющей креативность и готовность пробовать новое",
      "Несправедливость, если наказание непропорционально ошибке или если ошибка была неочевидной",
      "Демотивация и развитие выученной беспомощности, если ошибки воспринимаются как неизбежные"
    ],
    "ethical_constraints": [
      "Наказание должно быть корректирующим и обучающим, а не просто карательным",
      "Пользователь должен четко понимать связь между конкретным действием и последствием",
      "Должна быть возможность исправить ошибку или компенсировать наказание через дополнительные усилия"
    ],
    "toxicity_level": "high",
    "risk_color": "red",
    "scaling_risk": "Балансировка severity наказания для разных типов ошибок и пользователей сложна. Автоматизированные системы могут ошибочно наказывать за действия, не являющиеся ошибками. Накопление наказаний может привести к тому, что пользователь окажется в 'долговой яме', из которой не может выбраться, и покинет систему.",
    "related_mechanics": ["choice_consequence", "resource_loss", "negative_feedback"]
  },
  {
    "id": "uncompensated_risk",
    "name": "Риск без компенсации",
    "layer": "restriction",
    "description": "Ситуация, в которой пользователь принимает на себя значительный риск (тратит ресурсы, время), но при неудаче не получает вообще никакой компенсации, награды или даже прогресса. Чистый потенциал потерь.",
    "tags": ["асимметричный_риск", "чистый_убыток", "жесткость", "суровая_реальность"],
    "interaction_type": ["mental"],
    "motivation": {
      "type": "intrinsic",
      "notes": "Проверяет истинную готовность идти на риск и принимать решения в условиях полной неопределенности. Создает наиболее аутентичные и напряженные ситуации, где выигрыш — это спасение, а не бонус. Учит стоическому принятию потерь."
    },
    "game_examples": [
      {
        "title": "Хардкорные выживалки или симуляторы (Project Zomboid, The Long Dark на высоких сложностях)",
        "implementation": "Отправляясь в опасный рейд за ресурсами, игрок может погибнуть и потерять всё, не получив ничего."
      },
      {
        "title": "Игры с PvP и полной потерей лута (full loot PvP, как в Albion Online)",
        "implementation": "Проигравший в PvP-столкновении теряет всю экипировку, которую имел при себе."
      }
    ],
    "product_examples": [
      "Инвестиции в высокорисковые стартапы или криптовалюты, которые могут обесцениться до нуля",
      "Покупка непроверенного программного обеспечения или услуги, которая может оказаться бесполезной",
      "Участие в азартных играх (чистейшая форма)"
    ],
    "education_examples": [
      "Проведение оригинального научного исследования, которое может не дать значимых результатов",
      "Выбор сложной, никем не изученной темы для диссертации с высоким риском провала",
      "Участие в высококонкурентном конкурсе или олимпиаде без гарантий какого-либо признания",
      "Этические дилеммы в симуляциях, где любое решение ведет к негативным последствиям для одной из сторон"
    ],
    "abuse_risks": [
      "Чрезвычайное разочарование и ощущение напрасно потраченного времени, ведущее к уходу",
      "Поощрение гиперконсервативного поведения и избегания любых рисков, что тормозит прогресс",
      "Восприятие как несправедливости и произвола со стороны системы"
    ],
    "ethical_constraints": [
      "Такой риск должен быть добровольным выбором, а не единственным путем вперед",
      "Пользователи должны быть полностью информированы о природе и масштабе возможных потерь",
      "В образовании следует использовать крайне редко и только для моделирования специфических реалий, сопровождая глубокой рефлексией"
    ],
    "toxicity_level": "high",
    "risk_color": "red",
    "scaling_risk": "Механика отталкивает большинство casual-пользователей, сужая аудиторию до niche хардкорного сегмента. Может создать токсичную среду, где выживают только самые безжалостные или удачливые. Сложность балансировки: если риск оправдан слишком часто, он перестает быть 'без компенсации'; если никогда — становится бессмысленным.",
    "related_mechanics": ["high_risk_high_reward", "gambling", "loss_acceptance"]
  },
  {
    "id": "irreversible_choice",
    "name": "Необратимость выбора",
    "layer": "restriction",
    "description": "Ситуация, когда принятое пользователем решение имеет постоянные, неизменяемые последствия, которые влияют на дальнейший опыт и не могут быть отменены или пересмотрены.",
    "tags": ["точка_невозврата", "постоянство", "ветвление", "история"],
    "interaction_type": ["mental"],
    "motivation": {
      "type": "intrinsic",
      "notes": "Придает огромный вес каждому решению, заставляя глубоко обдумывать последствия. Создает уникальную, персонализированную историю для каждого пользователя, основанную на его выборах. Развивает чувство ответственности и принятия последствий своих действий."
    },
    "game_examples": [
      {
        "title": "Ролевые игры с моральным выбором (Mass Effect, The Witcher)",
        "implementation": "Ключевые сюжетные решения (кого спасти, кому доверять) навсегда меняют отношения с персонажами, доступные квесты и финал."
      },
      {
        "title": "Стратегические игры с постоянным миром",
        "implementation": "Решение разрушить город или заключить союз может иметь долгосрочные последствия для всей кампании."
      }
    ],
    "product_examples": [
      "Покупка недвижимости или другого крупного актива, который сложно продать без потерь",
      "Выбор специализации или карьерного пути, требующего долгосрочных инвестиций",
      "Подписание юридического контракта с обязательствами"
    ],
    "education_examples": [
      "Выбор основной специальности или научного руководителя в вузе",
      "Определение темы и методологии для долгосрочного исследовательского проекта",
      "Этические решения в профессиональных симуляциях (медицина, юриспруденция), имеющие виртуальные, но 'постоянные' последствия",
      "Участие в конкурсе, где подается одна окончательная версия работы"
    ],
    "abuse_risks": [
      "Сильный стресс и 'паралич анализа' из-за страха совершить непоправимую ошибку",
      "Сожаление и фрустрация, если последствия выбора оказываются негативными и неожиданными",
      "Несправедливость, если пользователь принял решение, не обладая всей необходимой информацией"
    ],
    "ethical_constraints": [
      "Пользователь должен иметь достаточно информации для осознанного выбора, даже если не всю",
      "Критически важные решения, блокирующие дальнейший прогресс, не должны быть необратимыми",
      "Система может предлагать 'моменты сожаления' или возможность частичной компенсации, не отменяя самого выбора"
    ],
    "toxicity_level": "medium",
    "risk_color": "yellow",
    "scaling_risk": "Поддержка множества уникальных ветвей развития, создаваемых необратимыми выборами, экспоненциально усложняет разработку и тестирование контента. При массовом использовании большинство пользователей может совершать 'ошибочные' выборы, требующие поддержки или приводящие к негативным отзывам. Сложность общения в сообществе, когда у всех разный опыт.",
    "related_mechanics": ["branching_narrative", "consequence_permanence", "fateful_decision"]
  },
  {
    "id": "inactivity_penalty",
    "name": "Штраф за бездействие",
    "layer": "restriction",
    "description": "Негативные последствия (потеря прогресса, ресурсов, статуса, возможностей), наступающие, если пользователь не взаимодействует с системой в течение определенного периода.",
    "tags": ["распад", "обязательность", "поддержание", "наказание_за_паузу"],
    "interaction_type": ["mental"],
    "motivation": {
      "type": "extrinsic",
      "notes": "Создает постоянное внешнее давление для регулярного возвращения в систему, формируя привычку. Страх потери накопленного заставляет пользователя включать продукт в свою рутину. Полезно для поддержания активности сообщества или экономики."
    },
    "game_examples": [
      {
        "title": "Мобильные игры с 'распадающимися' ресурсами или зданиями (FarmVille, Clash of Clans)",
        "implementation": "Если не заходить регулярно, урожай гибнет, или здания/войска могут быть атакованы."
      },
      {
        "title": "MMO с деклайном навыков (EVE Online)",
        "implementation": "Навыки, стоящие в очереди на обучение, прогрессируют, но если очередь пуста, прогресс не идет."
      }
    ],
    "product_examples": [
      "Потеря статуса в программах лояльности при неактивности (например, мили авиакомпании сгорают)",
      "Архивация или удаление данных аккаунта после длительного неиспользования",
      "Сгорание неиспользованных бонусных баллов или подписки по истечении срока"
    ],
    "education_examples": [
      "Снижение оценки за пропуски занятий или неучастие в обсуждениях на форуме",
      "Потеря доступа к курсу или материалам после окончания семестра без возможности продления",
      "Необходимость 'освежить' сертификацию или пройти повторное обучение через определенный период",
      "Система, где нерегулярная практика приводит к 'забыванию' материала и необходимости повторения"
    ],
    "abuse_risks": [
      "Восприятие как навязчивости и попытки контролировать время пользователя, leading to resentment",
      "Несправедливость по отношению к пользователям, которые не могут быть активными по объективным причинам (болезнь, отпуск)",
      "Создание чувства вины и обязательства, которые могут ассоциироваться с негативными эмоциями"
    ],
    "ethical_constraints": [
      "Штрафы должны быть соразмерными и предсказуемыми, с четкими и длительными grace periods",
      "Должны существовать разумные механизмы 'заморозки' прогресса или статуса на время отсутствия",
      "В образовании поощрение регулярности должно быть позитивным (бонусы за активность), а не только негативным (штрафы за отсутствие)"
    ],
    "toxicity_level": "medium",
    "risk_color": "yellow",
    "scaling_risk": "Может привести к волнам массового возвращения пользователей перед моментом наступления штрафа, создавая нагрузку на сервера, а затем к такому же массовому оттоку после потери прогресса. Сложно учитывать культурные и жизненные обстоятельства глобальной аудитории (праздники, часовые пояса, доступ в интернет).",
    "related_mechanics": ["maintenance_cost", "engagement_pressure", "fear_of_loss"]
  }
]