[
  {
    "id": "cooperation",
    "name": "Кооперация",
    "layer": "social",
    "description": "Игроки работают вместе для достижения общей цели, распределяя роли, ресурсы и усилия. Требует коммуникации, доверия и взаимопомощи.",
    "tags": ["командная_работа", "взаимопомощь", "синергия", "совместная_цель"],
    "interaction_type": ["mental", "verbal", "social"],
    "cross_references": {
      "synergies": ["team_play", "shared_rewards", "complementary_roles"],
      "antipatterns": ["free_rider_problem", "toxic_collaboration"],
      "upgrades_to": ["complex_coordination", "emergent_cooperation"],
      "requires": ["clear_common_goals", "communication_tools"]
    },
    "engagement_metrics": {
      "retention_impact": "very_high",
      "reason": "Социальные связи - сильнейший фактор удержания. Чувство принадлежности к группе и ответственность перед другими удерживает пользователей.",
      "monetization_potential": "medium",
      "virality_potential": "high",
      "learning_curve": "medium",
      "session_length_impact": "high",
      "daily_activity_impact": "high"
    },
    "motivation": {
      "type": "intrinsic",
      "notes": "Удовлетворяет базовые социальные потребности в принадлежности, взаимопомощи и коллективном достижении. Выделяются гормоны окситоцин и серотонин, укрепляющие социальные связи."
    },
    "game_examples": [
      {
        "title": "Overcooked!",
        "details": "Игроки распределяют роли на кухне для приготовления блюд под давлением времени, требуя постоянной коммуникации."
      },
      {
        "title": "MMO рейды (World of Warcraft)",
        "details": "Группа из 10-25 игроков со специализированными ролями (танк, хилер, дд) координируется для победы над боссом."
      }
    ],
    "product_examples": [
      "Совместное редактирование документа в Google Docs или Figma в реальном времени",
      "Краудфандинговые кампании, где многие вносят вклад для достижения общей финансовой цели",
      "Платформы для краудсорсинга решений (например, Stack Overflow для ответов на вопросы)"
    ],
    "education_examples": [
      "Групповые проекты и исследования, где оценка зависит от коллективного результата",
      "Парное программирование (pair programming) или взаимное рецензирование работ (peer review)",
      "Изучение языка в тандеме с носителем, где оба участника помогают друг другу",
      "Совместное решение сложных кейсов или задач на семинарах"
    ],
    "abuse_risks": [
      "Проблема 'безбилетника' (free-rider) — участник, который не вносит вклад, но получает выгоду",
      "Токсичная кооперация: давление на участников, агрессивная 'опека', потеря индивидуальной ответственности",
      "Социальное принуждение: чувство вины или обязанности, вынуждающее к участию против желания"
    ],
    "ethical_constraints": [
      "Система должна учитывать и вознаграждать индивидуальный вклад, а не только общий результат",
      "Участие в кооперации должно быть добровольным, с возможностью выхода без серьезных санкций",
      "Необходимы инструменты для разрешения конфликтов и модерации взаимодействия внутри группы"
    ],
    "toxicity_level": "medium",
    "risk_color": "yellow",
    "scaling_risk": "С ростом размера группы координация становится экспоненциально сложнее. Возникают проблемы коммуникации, социальной лености (эффект Рингельмана) и рассогласования целей. Система должна поддерживать как малые (2-5 чел.), так и большие группы, что требует разных механизмов.",
    "related_mechanics": ["team_play", "shared_goal", "social_rewards"]
  },
  {
    "id": "competition",
    "name": "Соревнование",
    "layer": "social",
    "description": "Игроки противостоят друг другу за ограниченные ресурсы, позиции, статус или признание. Создает динамику 'нулевой суммы', где выигрыш одного означает проигрыш другого.",
    "tags": ["PvP", "соперничество", "ранги", "победа"],
    "interaction_type": ["mental", "social"],
    "cross_references": {
      "synergies": ["leaderboards", "tournaments", "ranked_play"],
      "antipatterns": ["toxic_competition", "unbalanced_matchmaking"],
      "upgrades_to": ["esports", "high_stakes_competition"],
      "requires": ["fair_matchmaking", "clear_win_conditions"]
    },
    "engagement_metrics": {
      "retention_impact": "very_high",
      "reason": "Стремление к улучшению, победе и социальному признанию — мощные долгосрочные драйверы. Сравнение себя с другими создает постоянную мета-цель.",
      "monetization_potential": "high",
      "virality_potential": "high",
      "learning_curve": "steep",
      "session_length_impact": "medium",
      "daily_activity_impact": "high"
    },
    "motivation": {
      "type": "hybrid",
      "notes": "Экстринсивная: получение наград, статуса, признания. Интринсивная: удовлетворение от преодоления вызова, доказательства своего мастерства, выброс дофамина при победе и адреналина во время состязания."
    },
    "game_examples": [
      {
        "title": "MOBA игры (Dota 2, League of Legends)",
        "details": "Ранговые матчи 5 на 5 с системой MMR (Matchmaking Rating), определяющей уровень игроков."
      },
      {
        "title": "Киберспортивные дисциплины (Counter-Strike, StarCraft)",
        "details": "Соревнование на высшем уровне мастерства с четкими правилами и призовыми фондами."
      }
    ],
    "product_examples": [
      "Рейтинги продавцов на маркетплейсах (Amazon, eBay)",
      "Сравнение продуктивности сотрудников или отделов (может быть токсичным)",
      "Конкурсы пользовательского контента с призами"
    ],
    "education_examples": [
      "Академические олимпиады, конкурсы научных работ",
      "Рейтинги успеваемости в классе или на курсе (требует осторожности)",
      "Дебаты или интеллектуальные игры (брейн-ринг, квизы) между командами",
      "Соревновательные проекты, например, конкурс стартапов или дизайнерских решений"
    ],
    "abuse_risks": [
      "Токсичное поведение, кибербуллинг, оскорбления проигравших или менее умелых игроков",
      "Читерство и эксплуатация системных уязвимостей для получения нечестного преимущества",
      "Выгорание, стресс и тревожность от постоянного давления и страха проиграть"
    ],
    "ethical_constraints": [
      "Соревнование должно быть добровольным и не блокировать доступ к базовому контенту",
      "Необходимы системы защиты от токсичности, честного матчмейкинга и борьбы с читерством",
      "В образовании важно подчеркивать ценность участия и обучения, а не только победы"
    ],
    "toxicity_level": "high",
    "risk_color": "red",
    "scaling_risk": "С ростом числа участников обеспечение справедливого матчмейкинга становится сложной технической задачей. Токсичность может масштабироваться и отравлять все сообщество. Также риск расслоения сообщества на элиту и 'пушечное мясо', где новички постоянно проигрывают и уходят.",
    "related_mechanics": ["leaderboard", "tournament", "pvp_balance"]
  },
  {
    "id": "reputation_system",
    "name": "Система репутации",
    "layer": "social",
    "description": "Числовая, уровневая или иная визуализированная оценка, отражающая доверие, статус или историю взаимодействий игрока с системой или другими участниками. Формирует социальный капитал.",
    "tags": ["доверие", "статус", "карма", "история"],
    "interaction_type": ["mental", "social"],
    "cross_references": {
      "synergies": ["social_status", "trust_mechanic", "player_identity"],
      "antipatterns": ["stigmatization", "reputation_manipulation"],
      "upgrades_to": ["complex_reputation", "reputation_economies"],
      "requires": ["fair_reputation_mechanics", "reputation_recovery"]
    },
    "engagement_metrics": {
      "retention_impact": "high",
      "reason": "Создает долгосрочную социальную идентичность и предсказуемость в сообществе. Стремление построить и сохранить хорошую репутацию удерживает.",
      "monetization_potential": "low",
      "virality_potential": "medium",
      "learning_curve": "medium",
      "session_length_impact": "medium",
      "daily_activity_impact": "high"
    },
    "motivation": {
      "type": "extrinsic",
      "notes": "Желание построить позитивный социальный образ, получить доверие сообщества и связанные с ним привилегии. Страх потерять репутацию дисциплинирует поведение."
    },
    "game_examples": [
      {
        "title": "EVE Online",
        "details": "Security status (sec status) и сложная система репутации с NPC корпорациями, влияющая на доступ к пространству и услугам."
      },
      {
        "title": "Системы чести/репортов в онлайн-играх",
        "details": "Игроки могут оценивать поведение друг друга после матча (например, в Dota 2, Overwatch)."
      }
    ],
    "product_examples": [
      "Рейтинги и отзывы о продавцах на eBay, Airbnb, Uber",
      "Карма или система лайков на форумах (Reddit, Stack Exchange)",
      "Профессиональные репутационные системы (LinkedIn рекомендации, GitHub contributions)"
    ],
    "education_examples": [
      "Система академической репутации или портфолио достижений студента",
      "Оценка вклада студентов в групповые проекты друг другом (peer assessment)",
      "Система 'благодарностей' или рекомендаций между студентами за помощь",
      "Отслеживание цитирований и научного влияния для исследователей"
    ],
    "abuse_risks": [
      "Стигматизация и создание класса 'отверженных' с плохой репутацией, из которого невозможно выйти",
      "Манипуляция системой: накрутка положительных оценок, боты, договорные негативные отзывы",
      "Использование как инструмента мести или давления в социальных конфликтах"
    ],
    "ethical_constraints": [
      "Должна быть возможность исправить плохую репутацию через позитивные действия (механизм redemption)",
      "Процесс оценки должен быть защищен от злоупотреблений (верификация, ограничение частоты)",
      "Нельзя допускать, чтобы низкая репутация полностью блокировала доступ к базовым функциям"
    ],
    "toxicity_level": "medium",
    "risk_color": "yellow",
    "scaling_risk": "В крупных сообществах управление репутацией требует сложных алгоритмов для обнаружения манипуляций. Персональная репутация может терять смысл в анонимных или очень больших группах. Возникает проблема 'переноса репутации' — должна ли репутация из одного контекста влиять на другой.",
    "related_mechanics": ["social_status", "trust_metrics", "feedback_loop"]
  },
  {
    "id": "guilds_clans",
    "name": "Гильдии и кланы",
    "layer": "social",
    "description": "Организованные, часто формальные группы игроков с общей идентичностью, целями, иерархией и внутренними правилами. Создают устойчивые социальные структуры внутри системы.",
    "tags": ["сообщества", "организации", "альянсы", "иерархия"],
    "interaction_type": ["social", "mental"],
    "cross_references": {
      "synergies": ["cooperation", "social_spaces", "group_goals"],
      "antipatterns": ["toxic_guilds", "exclusive_clubs"],
      "upgrades_to": ["complex_organizations", "guild_economies"],
      "requires": ["guild_tools", "community_management"]
    },
    "engagement_metrics": {
      "retention_impact": "very_high",
      "reason": "Создает сильнейшие социальные связи, чувство принадлежности и ответственности перед группой. Является основным драйвером долгосрочной лояльности в MMO.",
      "monetization_potential": "medium",
      "virality_potential": "high",
      "learning_curve": "medium",
      "session_length_impact": "high",
      "daily_activity_impact": "high"
    },
    "motivation": {
      "type": "intrinsic",
      "notes": "Удовлетворяет глубокие потребности в принадлежности к группе, социальной идентичности, коллективных достижениях и структуре. Дает чувство защищенности и поддержки внутри большого сообщества."
    },
    "game_examples": [
      {
        "title": "World of Warcraft",
        "details": "Гильдии с системой рангов, общим банком, календарем событий (рейдов) и достижениями."
      },
      {
        "title": "Clash of Clans",
        "details": "Кланы для совместных войн, обмена войсками и общения."
      }
    ],
    "product_examples": [
      "Корпоративные команды и отделы в бизнес-софте (Slack, Microsoft Teams)",
      "Закрытые сообщества или группы по интересам на платформах (Discord, Facebook Groups)",
      "Партнерские программы или сети компаний"
    ],
    "education_examples": [
      "Учебные группы, научные кружки или исследовательские коллективы с постоянным составом",
      "Студенческие клубы, сообщества по интересам внутри вуза",
      "Долгосрочные проектные команды, работающие вместе над серией задач",
      "Моделирование организационных структур в деловых играх"
    ],
    "abuse_risks": [
      "Токсичная внутренняя культура, клановые войны и социальное давление внутри группы",
      "Эксклюзивность и дискриминация при приеме (по полу, возрасту, навыкам)",
      "Концентрация власти у лидеров, приводящая к злоупотреблениям (коррупция, фаворитизм)"
    ],
    "ethical_constraints": [
      "Система должна предоставлять инструменты для управления конфликтами, демократического принятия решений и смены лидерства",
      "Должна быть возможность покинуть группу без катастрофических потерь прогресса",
      "Необходимы механизмы борьбы с дискриминацией и создания инклюзивной среды"
    ],
    "toxicity_level": "medium",
    "risk_color": "yellow",
    "scaling_risk": "Управление большими гильдиями (сотни участников) требует сложных инструментов администрирования и модерации. Конфликты между крупными гильдиями могут отравлять всю экосистему игры. С ростом системы гильдии могут стать слишком влиятельными, диктуя условия разработчикам или монополизируя контент.",
    "related_mechanics": ["cooperation", "social_spaces", "group_identity"]
  },
  {
    "id": "social_spaces",
    "name": "Социальные пространства",
    "layer": "social",
    "description": "Выделенные виртуальные или физические зоны, где игроки могут свободно общаться, демонстрировать себя, творить и взаимодействовать без прямого игрового давления или целей.",
    "tags": ["общение", "самовыражение", "творчество", "сообщество"],
    "interaction_type": ["social", "verbal", "non_verbal"],
    "cross_references": {
      "synergies": ["guilds_clans", "social_rewards", "player_identity"],
      "antipatterns": ["empty_spaces", "toxic_chat", "exclusion_zones"],
      "upgrades_to": ["persistent_worlds", "player_housing", "virtual_economies"],
      "requires": ["communication_tools", "moderation", "content_for_interaction"]
    },
    "engagement_metrics": {
      "retention_impact": "high",
      "reason": "Формирует чувство места и живого сообщества, поощряет возвращение как в 'дом'. Способствует формированию неформальных связей.",
      "monetization_potential": "medium",
      "virality_potential": "medium",
      "learning_curve": "low",
      "session_length_impact": "high",
      "daily_activity_impact": "medium"
    },
    "motivation": {
      "type": "intrinsic",
      "notes": "Удовлетворяет базовые социальные потребности в неструктурированном общении, самовыражении и чувстве принадлежности к месту. Позволяет 'быть', а не 'достигать'."
    },
    "game_examples": [
      {
        "title": "Final Fantasy XIV",
        "details": "Главные города (Лимса Ломинса, Гридания), площади и таверны как центры социальной жизни, где игроки общаются, танцуют, показывают glamour (модную экипировку)."
      },
      {
        "title": "VR Chat, Rec Room",
        "details": "Пользовательские комнаты и миры, созданные для встреч, вечеринок, общения и творчества."
      }
    ],
    "product_examples": [
      "Форумы, Discord-сервера сообщества, чаты",
      "Виртуальные офисы или пространства для удаленных команд (Gather.town, SpatialChat)",
      "Публичные 'ленты' или 'стены' в социальных сетях для неформального контента"
    ],
    "education_examples": [
      "Общие зоны в кампусе, кулуары на конференциях, онлайн-фойе перед вебинаром",
      "Форумы курсов или чаты для неформального общения между студентами",
      "Виртуальные 'комнаты для переговоров' или 'кофе-брейки' в онлайн-обучении",
      "Интерактивные доски (Miro, Mural) для совместного мозгового штурма в свободной форме"
    ],
    "abuse_risks": [
      "Харассмент, троллинг, токсичное поведение и кибербуллинг в неконтролируемых пространствах",
      "Спам, реклама и распространение вредоносного контента",
      "Социальная изоляция и формирование закрытых, эксклюзивных кружков"
    ],
    "ethical_constraints": [
      "Обязательна эффективная модерация (автоматическая и ручная) и четкие правила поведения",
      "Должны быть инструменты для пользователей (игнор, жалоба, приватные пространства)",
      "Пространство должно быть инклюзивным и доступным, а не местом для клик и буллинга"
    ],
    "toxicity_level": "medium",
    "risk_color": "yellow",
    "scaling_risk": "Сложность модерации и поддержания позитивной культуры в больших масштабах. Публичные пространства могут становиться переполненными и хаотичными. Риск фрагментации на множество пустующих приватных комнат. Технические проблемы с синхронизацией большого числа пользователей в одном инстансе.",
    "related_mechanics": ["player_housing", "virtual_gathering", "community_hub"]
  },
  {
    "id": "social_rewards",
    "name": "Социальные награды",
    "layer": "social",
    "description": "Вознаграждения, которые получают игроки за социальные действия: помощь другим, позитивное взаимодействие, совместную игру, менторство. Поощряют просоциальное поведение.",
    "tags": ["признание", "альтруизм", "позитивное_подкрепление", "вклад"],
    "interaction_type": ["mental", "social"],
    "cross_references": {
      "synergies": ["reputation_system", "cooperation", "player_identity"],
      "antipatterns": ["gamified_social_pressure", "reward_manipulation"],
      "upgrades_to": ["social_economies", "community_governance"],
      "requires": ["clear_social_rules", "tracking_positive_behavior"]
    },
    "engagement_metrics": {
      "retention_impact": "medium",
      "reason": "Укрепляет здоровое сообщество и поощряет поведение, которое делает систему приятнее для всех. Косвенно влияет на удержание через улучшение среды.",
      "monetization_potential": "low",
      "virality_potential": "low",
      "learning_curve": "low",
      "session_length_impact": "low",
      "daily_activity_impact": "medium"
    },
    "motivation": {
      "type": "extrinsic",
      "notes": "Внешнее признание и одобрение за социальный вклад. Побуждает повторять позитивные действия, даже если изначальная мотивация была внутренней. Помогает новичкам узнать, какое поведение ценится."
    },
    "game_examples": [
      {
        "title": "Dota 2",
        "details": "Система 'поведенческих очков' и награды (сундуки) за позитивное поведение и высокий рейтинг поведения."
      },
      {
        "title": "League of Legends",
        "details": "Система чести (Honor), где игроки благодарят друг друга после матча за хорошую игру, лидерство или доброту."
      }
    ],
    "product_examples": [
      "Системы благодарностей и похвалы между сотрудниками (Kudos в Slack, Bonusly)",
      "Публичное признание лучших помощников на форумам (отметка 'Лучший ответ')",
      "Баджи или достижения за помощь другим пользователям (например, на Stack Overflow)"
    ],
    "education_examples": [
      "Значки или баллы за помощь однокурсникам, участие в групповой работе, менторство",
      "Система 'благодарностей' от преподавателя или студентов за вклад в обсуждение",
      "Публичное признание студентов, которые активно помогают другим на форуме курса",
      "Дополнительные 'бонусные' баллы за волонтерскую деятельность или организацию мероприятий"
    ],
    "abuse_risks": [
      "Намеренная 'игра' в про-социальность ради наград, а не искреннее поведение",
      "Фарминг наград через сговоры или фейковые взаимодействия",
      "Социальное давление: ожидание, что помощь всегда будет вознаграждена, и обида, если нет"
    ],
    "ethical_constraints": [
      "Награды должны быть скромными, чтобы не превращать социальные действия в инструментальные",
      "Система должна выявлять и игнорировать манипулятивное поведение",
      "Важно сохранять пространство для искреннего альтруизма, не требующего награды"
    ],
    "toxicity_level": "low",
    "risk_color": "green",
    "scaling_risk": "Сложность автоматического определения искренности и качества социальных действий. Алгоритмы могут быть обмануты или, наоборот, не замечать тонкие формы помощи. При масштабировании система может превратиться в формальную 'охоту за очками', а не в органическое признание.",
    "related_mechanics": ["positive_reinforcement", "community_building", "altruism_encouragement"]
  },
  {
    "id": "team_play",
    "name": "Командная игра",
    "layer": "social",
    "description": "Организованная форма кооперации, где группа игроков объединена не только общей целью, но и четкой структурой, распределением ролей и часто тактическим планом.",
    "tags": ["организация", "тактика", "роли", "стратегия"],
    "interaction_type": ["mental", "verbal", "social"],
    "motivation": {
      "type": "hybrid",
      "notes": "Экстринсивная: достижение сложных целей, недоступных в одиночку. Интринсивная: глубокое удовлетворение от слаженной работы команды как единого организма, чувство мастерства в коллективной деятельности."
    },
    "game_examples": [
      {
        "title": "Тактические шутеры (Rainbow Six: Siege, Valorant)",
        "details": "Команда из 5 игроков с уникальными оперативниками/агентами координирует штурм, защиту, использует комбинации способностей."
      },
      {
        "title": "Спортивные симуляторы (Rocket League, FIFA pro clubs)",
        "details": "Команда игроков управляет разными футболистами или машинами, требуя понимания позиционной игры и пасов."
      }
    ],
    "product_examples": [
      "Совместная работа над проектом в инструментах вроде Jira, Asana, где есть роли (менеджер, исполнитель, тестировщик)",
      "Кросс-функциональные команды в компаниях, работающие над продуктом",
      "Онлайн-хакатоны, где команды соревнуются в создании прототипов"
    ],
    "education_examples": [
      "Сложные групповые проекты с распределением ролей (лидер, исследователь, аналитик, презентатор)",
      "Моделирование профессиональных ситуаций (судебный процесс, медицинский консилиум, инженерная группа)",
      "Участие в спортивных или интеллектуальных командах (дебаты, робототехника)",
      "Кооперативное решение кейсов, где каждый участник отвечает за свой аспект анализа"
    ],
    "abuse_risks": [
      "Жесткая иерархия и давление со стороны 'капитана' или более опытных членов команды",
      "Конфликты из-за распределения ролей и признания заслуг",
      "Потеря мотивации, если команда неэффективна или один участник постоянно подводит"
    ],
    "ethical_constraints": [
      "Роли и ответственность должны быть четко определены и согласованы всеми участниками",
      "Должны быть механизмы ротации ролей и разрешения внутренних конфликтов",
      "Система оценки должна учитывать как командный результат, так и индивидуальный вклад"
    ],
    "toxicity_level": "medium",
    "risk_color": "yellow",
    "scaling_risk": "Чем больше команда, тем сложнее координация и выше риск социальной лености. Сложность автоматического подбора сбалансированных команд по навыкам и ролям. Риск создания статичных 'элитных' команд, которые доминируют и не пускают новичков.",
    "related_mechanics": ["cooperation", "role_specialization", "tactical_coordination"]
  },
  {
    "id": "individual_responsibility",
    "name": "Индивидуальная ответственность",
    "layer": "social",
    "description": "Механика, обеспечивающая, что каждый участник группы несет персональную ответственность за определенную часть задачи или результат. Предотвращает проблему 'безбилетника' и уравнивает вклад.",
    "tags": ["подотчетность", "личный_вклад", "ответственность", "измеримость"],
    "interaction_type": ["mental"],
    "motivation": {
      "type": "extrinsic",
      "notes": "Обеспечивает справедливость: награда или признание соответствуют реальному вкладу. Страх быть уличенным в безделье или подвести команду стимулирует участие."
    },
    "game_examples": [
      {
        "title": "Overcooked!",
        "details": "Хотя цель общая, каждый игрок физически контролирует своего повара и отвечает за свои действия (нарезать, пожарить, подать). Провал одного приводит к общему провалу."
      },
      {
        "title": "Рейды в MMO с персональными заданиями",
        "details": "В некоторых энкаунтерах у каждого игрока есть уникальная механика (убежать от луча, забрать дебафф), невыполнение которой ведет к вайпу."
      }
    ],
    "product_examples": [
      "Системы трекинга задач, где видно, кто и что сделал (Git commit history, Jira assignee)",
      "Индивидуальные KPI или цели в рамках командного проекта",
      "Системы ревью, где оценивается вклад каждого сотрудника"
    ],
    "education_examples": [
      "Групповой проект с отдельным отчетом или оценкой за личный вклад каждого участника",
      "Семинар, где каждый студент отвечает за представление и анализ определенного источника или аспекта темы",
      "Лабораторная работа, где у каждого члена группы своя четкая роль и задание, которые фиксируются в протоколе",
      "Система взаимного оценивания (peer assessment) вклада в командную работу"
    ],
    "abuse_risks": [
      "Чрезмерное давление и страх совершить ошибку, парализующий участников",
      "Обвинение и поиск 'козла отпущения' при неудаче команды",
      "Фокус на индивидуальных задачах в ущерб общему видению и синергии"
    ],
    "ethical_constraints": [
      "Индивидуальная ответственность должна быть сбалансирована с командной поддержкой — возможность помочь друг другу в случае трудностей",
      "Ошибки должны восприниматься как возможность для обучения команды, а не только для наказания индивида",
      "Критерии оценки личного вклада должны быть прозрачными и справедливыми"
    ],
    "toxicity_level": "medium",
    "risk_color": "yellow",
    "scaling_risk": "В больших командах сложно объективно отслеживать и оценивать индивидуальный вклад каждого. Автоматические метрики могут быть поверхностными и не отражать реальной ценности работы. Риск создания атмосферы тотальной слежки и недоверия.",
    "related_mechanics": ["accountability", "contribution_tracking", "free_rider_prevention"]
  },
  {
    "id": "shared_goal",
    "name": "Общая цель",
    "layer": "social",
    "description": "Конкретная, ясная задача или результат, которого должна достичь группа пользователей совместными усилиями. Объединяет участников и синхронизирует их действия.",
    "tags": ["коллективная_цель", "единство", "направление", "миссия"],
    "interaction_type": ["mental", "social"],
    "motivation": {
      "type": "hybrid",
      "notes": "Экстринсивная: конкретная награда или признание за достижение цели. Интринсивная: чувство сопричастности к чему-то большему, чем индивидуальные достижения, удовольствие от коллективного усилия."
    },
    "game_examples": [
      {
        "title": "Рейды в MMO",
        "details": "Цель группы — победить могучего босса, что требует координации всех 10-25 игроков на протяжении 5-15 минут."
      },
      {
        "title": "Кооперативные кампании (Left 4 Dead)",
        "details": "Группа из 4 выживших должна вместе добраться до точки эвакуации, защищая друг друга от зомби."
      }
    ],
    "product_examples": [
      "Краудфандинговая кампания с общей целью по сбору средств",
      "Командный KPI или квартальная цель в компании",
      "Общественные инициативы (сбор мусора, посадка деревьев) с измеримым результатом"
    ],
    "education_examples": [
      "Классный проект по созданию школьной газеты, сайта или организации мероприятия",
      "Научно-исследовательская работа группы студентов, направленная на публикацию статьи или выступление на конференции",
      "Коллективное решение сложной проблемы или case study, где ответ должен быть согласован",
      "Участие класса в общешкольном конкурсе или соревновании"
    ],
    "abuse_risks": [
      "Доминирование более активных или уверенных участников в определении пути к цели",
      "Конфликты из-за разных представлений о том, как достичь цели",
      "Давление на отдельных участников, которые могут тормозить прогресс группы"
    ],
    "ethical_constraints": [
      "Цель должна быть значимой и достижимой для всей группы, а не навязанной сверху",
      "Процесс достижения цели должен учитывать вклад и мнение всех участников",
      "Неудача в достижении общей цели не должна приводить к коллективным наказаниям, несоразмерным усилиям"
    ],
    "toxicity_level": "low",
    "risk_color": "green",
    "scaling_risk": "Чем больше группа, тем сложнее сформулировать цель, которая будет лично значима для каждого участника. Риск возникновения подгрупп с разными представлениями о цели. В очень больших сообществах общая цель может стать абстрактной и не мотивирующей.",
    "related_mechanics": ["cooperation", "team_play", "collective_achievement"]
  },
  {
    "id": "betrayal",
    "name": "Предательство",
    "layer": "social",
    "description": "Действие, при котором участник нарушает доверие или явные/неявные соглашения с другими игроками ради личной выгоды или выполнения скрытой цели. Создает драматическое напряжение и проверяет социальные связи.",
    "tags": ["обман", "доверие", "конфликт", "скрытая_роль"],
    "interaction_type": ["mental", "social"],
    "motivation": {
      "type": "hybrid",
      "notes": "Экстринсивная: получение уникальной награды, доступной только через предательство. Интринсивная: острые ощущения от социальной манипуляции, волнение 'двойной игры', удовольствие от тактического превосходства."
    },
    "game_examples": [
      {
        "title": "Социальные дедуктивные игры (Among Us, Мафия)",
        "details": "Импостер/мафия притворяется невиновным, чтобы саботировать или убивать членов команды, оставаясь нераскрытым."
      },
      {
        "title": "Дипломатические игры (Diplomacy)",
        "details": "Игроки заключают и нарушают союзы в ходе игры, что является ключевой механикой."
      }
    ],
    "product_examples": [
      "Конкурентные бизнес-ситуации, где партнер может переманить клиента или раскрыть информацию",
      "A/B тестирование функций, которое может восприниматься как 'предательство' ожиданий одной группы пользователей",
      "Ситуации в социальных сетях, когда конфиденциальная информация используется против человека"
    ],
    "education_examples": [
      "Ролевые игры и исторические симуляции, моделирующие предательство (например, Иуда в религиозных studies, шпионы в истории)",
      "Деловые игры, где участники могут нарушать устные договоренности для победы",
      "Анализ этических дилемм и последствий нарушения доверия в философии, психологии, бизнес-этике",
      "Изучение литературных произведений с темой предательства"
    ],
    "abuse_risks": [
      "Перенос игрового поведения в реальные отношения, подрыв доверия между участниками",
      "Сильные негативные эмоции, обида, кибербуллинг в адрес 'предателя'",
      "Создание токсичной атмосферы всеобщего подозрения, даже когда предательства нет"
    ],
    "ethical_constraints": [
      "Механика должна использоваться только в четко очерченных игровых рамках, с согласия всех участников",
      "После игры обязателен 'дебрифинг', чтобы отделить игровые роли от реальных личностей",
      "В образовательном контексте необходимо акцентировать рефлексию над последствиями предательства, а не поощрять его как таковое"
    ],
    "toxicity_level": "high",
    "risk_color": "red",
    "scaling_risk": "В больших онлайн-сообществах предательство может привести к масштабным конфликтам, харассменту и исключениям. Сложно модерировать тонкую грань между игровым предательством и реальным токсичным поведением. Риск создания культуры, где предательство становится нормой и разрушает любое сотрудничество.",
    "related_mechanics": ["secret_goal", "social_deduction", "trust_breaking"]
  },
  {
    "id": "alliances",
    "name": "Союзы",
    "layer": "social",
    "description": "Добровольные, часто временные соглашения между игроками или группами о сотрудничестве, взаимопомощи или ненападении для достижения общих или параллельных целей.",
    "tags": ["партнерство", "договор", "временный_союз", "коалиция"],
    "interaction_type": ["verbal", "social", "mental"],
    "motivation": {
      "type": "extrinsic",
      "notes": "Прагматическая выгода: объединение сил для победы над более сильным противником, обмен ресурсами, разделение рисков. Стратегическая необходимость в многопользовательской среде с ограниченными ресурсами."
    },
    "game_examples": [
      {
        "title": "Massively Multiplayer Online Games (EVE Online, Albion Online)",
        "details": "Корпорации и альянсы заключают договоры о ненападении, совместных операциях или разделе территорий."
      },
      {
        "title": "Дипломатия в глобальных стратегиях (Risk, Civilization)",
        "details": "Игроки договариваются о совместных действиях против лидера, но союзы непостоянны."
      }
    ],
    "product_examples": [
      "Бизнес-партнерства и совместные предприятия между компаниями",
      "Аффилированные программы и партнерские сети",
      "Политические коалиции и блоки"
    ],
    "education_examples": [
      "Междисциплинарные исследовательские группы, объединяющие специалистов из разных областей",
      "Совместные проекты между студентами разных курсов или факультетов",
      "Моделирование международных отношений, переговоров и создания альянсов (модель ООН, исторические симуляции)",
      "Изучение социальных сетей и теории коалиций в социологии или политологии"
    ],
    "abuse_risks": [
      "Создание несправедливых монополий или картелей, подавляющих новичков и одиночек",
      "Вероломное нарушение союзов в неподходящий момент (предательство), ведущее к конфликтам",
      "Давление с целью вступления в союз или исключения из него"
    ],
    "ethical_constraints": [
      "Система должна позволять существование как союзов, так и успешных одиночных стратегий",
      "Должны быть прозрачные механизмы создания и расторжения союзов",
      "В образовательных симуляциях важно изучать как benefits, так и риски альянсов (потеря суверенитета, обязательства)"
    ],
    "toxicity_level": "medium",
    "risk_color": "yellow",
    "scaling_risk": "В больших экосистемах союзы могут стать слишком могущественными и начать диктовать правила всему сообществу, вынуждая разработчиков вмешиваться. Управление сложной сетью взаимных договоров между десятками групп становится нетривиальной задачей. Риск возникновения 'вечных' союзов, которые стагнируют игру.",
    "related_mechanics": ["diplomacy", "temporary_cooperation", "coalition_building"]
  },
  {
    "id": "negotiation",
    "name": "Переговоры",
    "layer": "social",
    "description": "Процесс коммуникации между игроками с целью достижения соглашения об обмене ресурсами, условиях союза, разделе территорий или разрешении конфликта. Требует коммуникативных навыков и понимания мотивов других.",
    "tags": ["торг", "коммуникация", "сделка", "разрешение_конфликтов"],
    "interaction_type": ["verbal", "mental", "social"],
    "motivation": {
      "type": "hybrid",
      "notes": "Экстринсивная: получение лучших условий для себя в сделке. Интринсивная: интеллектуальное удовольствие от процесса убеждения, чтения оппонента, нахождения взаимовыгодных решений (win-win)."
    },
    "game_examples": [
      {
        "title": "Торговые и дипломатические игры (Catan, Diplomacy)",
        "details": "Игроки торгуются за ресурсы, предлагая обмен, или ведут дипломатические переговоры о границах и союзах."
      },
      {
        "title": "Ролевые игры с социальным взаимодействием",
        "details": "Уговаривание NPC или других игроков через диалоговые деревья с проверками навыков (Charisma в Fallout)."
      }
    ],
    "product_examples": [
      "Платформы для торговли и аукционов (eBay, Christie's), где есть возможность предложить свою цену",
      "Инструменты для согласования контрактов и условий сотрудничества (DocuSign с обсуждением пунктов)",
      "Сервисы, где цена или условия услуги обсуждаемы (некоторые фриланс-биржи, рынок недвижимости)"
    ],
    "education_examples": [
      "Деловые переговоры как отдельный курс или симуляция (заключение контракта, разрешение трудового спора)",
      "Модель ООН или других международных организаций, где студенты представляют страны и ведут переговоры по резолюциям",
      "Ролевые игры по медиации и разрешению конфликтов",
      "Изучение теории игр и принятия решений на примерах переговоров"
    ],
    "abuse_risks": [
      "Манипуляция, давление, использование неполной информации или введение в заблуждение",
      "Эскалация конфликта, если переговоры проваливаются",
      "Затягивание процесса, саботаж переговоров как тактический прием"
    ],
    "ethical_constraints": [
      "Переговоры должны основываться на принципах честности и уважения, даже в конкурентной среде",
      "Система может предоставлять инструменты для фиксации соглашений и отслеживания их выполнения",
      "В образовании важно учить этическим нормам ведения переговоров и распознаванию манипуляций"
    ],
    "toxicity_level": "medium",
    "risk_color": "yellow",
    "scaling_risk": "В массовых многопользовательских играх переговоры между лидерами крупных альянсов могут затрагивать тысячи игроков, чьи интересы не были учтены. Асинхронные переговоры через текстовые чаты могут привести к недопониманию. Сложность модерирования переговоров на предмет оскорблений или реальных угроз.",
    "related_mechanics": ["diplomacy", "bargaining", "conflict_resolution"]
  },
  {
    "id": "social_status",
    "name": "Социальный статус",
    "layer": "social",
    "description": "Положение пользователя в неформальной или формальной иерархии сообщества, определяемое достижениями, репутацией, владением редкими предметами или признанием со стороны других.",
    "tags": ["иерархия", "престиж", "признание", "элитарность"],
    "interaction_type": ["mental", "social"],
    "motivation": {
      "type": "extrinsic",
      "notes": "Желание получить уважение, внимание и влияние в сообществе. Доступ к эксклюзивным социальным кругам, возможностям или информации. Подтверждение собственной значимости и компетентности в глазах других."
    },
    "game_examples": [
      {
        "title": "Игры с престижными предметами или званиями (World of Warcraft)",
        "details": "Редкие титулы (например, 'Повелитель аспектов'), mount'ы (Аш'ал Алёный) или трансмогрификация, показывающие прошлые достижения."
      },
      {
        "title": "Социальные игры вроде Second Life",
        "details": "Статус определяется виртуальной собственностью, креативностью аватара и социальными связями."
      }
    ],
    "product_examples": [
      "Системы статусов в авиакомпаниях или отелях (Silver, Gold, Platinum), дающие привилегии",
      "Эксклюзивные клубы или членства (American Express Centurion Card)",
      "Социальные сети, где статус определяется количеством подписчиков или вовлеченностью"
    ],
    "education_examples": [
      "Система академических званий и степеней (бакалавр, магистр, PhD, профессор)",
      "Признание в научном сообществе через индекс цитирования, награды, членство в академиях",
      "Статус в студенческом самоуправлении или как активиста/организатора мероприятий",
      "Портфолио достижений, которое служит показателем статуса среди сверстников"
    ],
    "abuse_risks": [
      "Формирование элитарных, закрытых групп и социальное расслоение сообщества",
      "Токсичное поведение высокостатусных игроков, ощущающих безнаказанность",
      "Чрезмерная гонка за статусом в ущерб реальному опыту или обучению"
    ],
    "ethical_constraints": [
      "Статус должен быть заработан через достижения или позитивный вклад, а не просто куплен",
      "Система должна обеспечивать социальную мобильность — возможность повысить статус",
      "Высокий статус не должен давать несправедливых преимуществ в конкурентных аспектах, если это не является целью"
    ],
    "toxicity_level": "medium",
    "risk_color": "yellow",
    "scaling_risk": "В больших сообществах поддержание значимости статуса сложно — слишком много людей могут достичь верхних уровней, что приводит к инфляции. Могут возникать параллельные, неофициальные иерархии, конфликтующие с системной. Риск создания 'касты' старых игроков, которые смотрят свысока на новичков.",
    "related_mechanics": ["reputation_system", "prestige", "social_hierarchy"]
  },
  {
    "id": "leaderboard",
    "name": "Лидерборд",
    "layer": "social",
    "description": "Публичный ранжированный список игроков или команд, отсортированный по определенному показателю (очки, время, победы и т.д.). Визуализирует социальное сравнение и определяет лучших.",
    "tags": ["рейтинг", "сравнение", "топ", "соревнование"],
    "interaction_type": ["mental"],
    "motivation": {
      "type": "extrinsic",
      "notes": "Ясная, измеримая цель — подняться в рейтинге. Признание и видимость для всего сообщества. Соревновательный азарт от сравнения своих результатов с другими."
    },
    "game_examples": [
      {
        "title": "Аркадные игры и игровые автоматы",
        "details": "Классический 'Hall of Fame' с тремя лучшими результатами (инициалы и очки)."
      },
      {
        "title": "Сезонные ранговые режимы в конкурентных играх",
        "details": "Глобальный или региональный лидерборд, показывающий топ-500 или топ-1000 игроков по MMR/ELO."
      }
    ],
    "product_examples": [
      "Рейтинги приложений в App Store / Google Play",
      "Списки лучших продавцов, авторов или исполнителей на платформах",
      "Табло продуктивности в компаниях (может быть токсичным)"
    ],
    "education_examples": [
      "Рейтинг успеваемости студентов на курсе (требует крайней осторожности и часто неэтичен)",
      "Табло результатов на олимпиадах, конкурсах или интеллектуальных играх",
      "Публичное признание лучших проектов, исследований или эссе (например, 'Работа месяца')",
      "Использование в игровых образовательных платформах (Kahoot!, Quizizz) для мотивации в рамках одного занятия"
    ],
    "abuse_risks": [
      "Сильная демотивация и выгорание у тех, кто никогда не попадет в топ (эффект 'проигравших')",
      "Читерство и эксплуатация системы для накрутки показателей",
      "Токсичная концентрация только на метрике лидерборда в ущерб другим аспектам опыта или обучения"
    ],
    "ethical_constraints": [
      "Лидерборды должны быть опциональными, и пользователи должны иметь возможность скрыть свои результаты",
      "Важно иметь multiple leaderboards по разным критериям, чтобы разные типы навыков и вкладов признавались",
      "В образовании следует избегать постоянных публичных рейтингов, которые могут стигматизировать отстающих; лучше использовать временные, анонимные или групповые лидерборды."
    ],
    "toxicity_level": "high",
    "risk_color": "red",
    "scaling_risk": "В глобальных лидербордах первые места практически недостижимы для обычных игроков, что может сделать механику нерелевантной для большинства. Обеспечение честности и защиты от накруток в масштабе — технически сложная задача. Лидерборды могут стимулировать нездоровую гипер-специализацию на одной метрике.",
    "related_mechanics": ["competition", "social_comparison", "ranking"]
  },
  {
    "id": "voting",
    "name": "Голосование",
    "layer": "social",
    "description": "Механизм коллективного принятия решений, при котором каждый участник группы выражает свое предпочтение, а итоговое решение определяется по определенным правилам (простое большинство, квалифицированное большинство и т.д.).",
    "tags": ["демократия", "выбор", "консенсус", "сообщество"],
    "interaction_type": ["mental", "social"],
    "motivation": {
      "type": "intrinsic",
      "notes": "Чувство сопричастности и влияния на развитие сообщества или системы. Удовлетворение от того, что твой голос имеет значение. Справедливость процесса, основанного на равенстве участников."
    },
    "game_examples": [
      {
        "title": "Игры с голосованием за изгнание (Among Us, Town of Salem)",
        "details": "После обсуждения игроки голосуют, кого они подозревают в том, что он предатель/мафия."
      },
      {
        "title": "Краудсорсинговые решения в играх (Minecraft с плагинами)",
        "details": "Игроки сервера голосуют за смену времени суток, погоды или принятие новых правил."
      }
    ],
    "product_examples": [
      "Пользовательские голосования за новые функции продукта (UserVoice, фидбек-форумы)",
      "Внутренние опросы в компаниях для принятия решений",
      "Краудсорсинговые платформы для оценки идей или контента"
    ],
    "education_examples": [
      "Принятие решений в студенческом совете или учебной группе",
      "Голосование за тему следующего урока, формат экзамена или список литературы (в разумных пределах)",
      "Оценка проектов или презентаций друг друга (peer assessment) по четким критериям",
      "Изучение избирательных систем, теории общественного выбора и демократических процессов на практике"
    ],
    "abuse_risks": [
      "Манипуляции, сговор и накрутка голосов",
      "Тирания большинства, игнорирующая мнение меньшинства",
      "Апатия и низкая явка, если голосование воспринимается как не влияющее на результат"
    ],
    "ethical_constraints": [
      "Правила голосования должны быть прозрачными, а процесс — защищенным от манипуляций",
      "Должны быть механизмы учета мнения меньшинства или вето для критических решений",
      "Голосование по вопросам, напрямую затрагивающим пользователей, должно быть обязательным к рассмотрению, а не декоративным"
    ],
    "toxicity_level": "low",
    "risk_color": "green",
    "scaling_risk": "В очень больших сообществах прямое голосование по каждому вопросу становится непрактичным, требуется система представительства. Обеспечение безопасности и уникальности каждого голоса технически сложно. Риск того, что активное меньшинство будет определять решения за пассивное большинство.",
    "related_mechanics": ["democratic_decision", "community_governance", "polling"]
  }
]
