[
  {
    "id": "movement",
    "name": "Перемещение",
    "layer": "space",
    "description": "Способность пользователя или его аватара изменять свое положение в виртуальном, физическом или концептуальном пространстве системы. Базовое действие для навигации и исследования.",
    "tags": ["навигация", "переход", "контроль", "агентность"],
    "interaction_type": ["physical", "mental"],
    "motivation": {
      "type": "intrinsic",
      "notes": "Фундаментальная потребность в контроле над своим положением и исследовании среды. Чувство свободы, агентности и непосредственного взаимодействия с миром. В концептуальном пространстве — это контроль над фокусом внимания и прогрессом."
    },
    "game_examples": [
      {
        "title": "Практически все 3D и 2D игры",
        "implementation": "Управление персонажем с помощью клавиш, джойстика или мыши для ходьбы, бега, прыжков"
      },
      {
        "title": "Шутеры от первого лица (Doom, Half-Life)",
        "implementation": "Свободное перемещение по уровню для поиска целей, укрытий и предметов"
      }
    ],
    "product_examples": [
      "Навигация по меню и разделам приложения",
      "Скроллинг ленты новостей или документов",
      "Переход между вкладками браузера или рабочего стола"
    ],
    "education_examples": [
      "Переход между модулями, уроками или темами в системе управления обучением (LMS)",
      "Навигация по интерактивной временной шкале, карте знаний или концепт-карте",
      "Физическое перемещение по станциям или зонам в классе, организованном по методу ротации",
      "Управление взглядом в VR-симуляторах или 3D-моделях для изучения анатомии, архитектуры"
    ],
    "abuse_risks": [
      "Дезинформация через неинтуитивную или запутанную навигацию (dark patterns)",
      "Искусственное замедление перемещения для монетизации (покупка скорости)",
      "Укачивание и дискомфорт (киберболезнь) при определенных типах движения в VR/3D"
    ],
    "ethical_constraints": [
      "Навигация должна быть интуитивно понятной и доступной для людей с разными возможностями",
      "Свобода перемещения не должна ограничиваться без педагогической или функциональной необходимости",
      "В образовательных симуляторах движение должно быть физически точным (если это цель обучения), а не аркадным"
    ],
    "toxicity_level": "low",
    "risk_color": "green",
    "scaling_risk": "В больших виртуальных пространствах с множеством пользователей возникают технические проблемы синхронизации их перемещений и предотвращения коллизий. Сложность проектирования навигации, которая остается удобной при постоянном добавлении нового контента и разделов. Риск фрагментации опыта, если пользователи могут полностью избегать важных областей.",
    "related_mechanics": ["exploration", "navigation", "player_agency"]
  },
  {
    "id": "limited_space",
    "name": "Ограниченное пространство",
    "layer": "space",
    "description": "Наличие физических, виртуальных или концептуальных границ, которые ограничивают доступную для действий площадь или объем. Создает вызов, стратегию и управляет плотностью взаимодействия.",
    "tags": ["границы", "теснота", "ограничения", "концентрация"],
    "interaction_type": ["mental"],
    "motivation": {
      "type": "hybrid",
      "notes": "Экстринсивная: необходимость эффективно использовать каждый доступный ресурс (место). Интринсивная: интеллектуальный вызов решения проблемы в стесненных условиях, творческий подход к организации."
    },
    "game_examples": [
      {
        "title": "Пазлы (Tetris, различные головоломки)",
        "implementation": "Фигуры нужно размещать в ограниченном прямоугольном поле"
      },
      {
        "title": "Выживание в ограниченной среде (подводная лодка, космический корабль в некоторых симуляторах)",
        "implementation": "Действия происходят в тесных отсеках с ограниченными ресурсами"
      }
    ],
    "product_examples": [
      "Ограниченное количество элементов на экране или в интерфейсе (например, дашборд)",
      "Лимит на размер загружаемого файла или длину сообщения",
      "Физические ограничения устройства (размер экрана, память)"
    ],
    "education_examples": [
      "Работа с ограниченным набором данных, реагентов или материалов в лабораторной работе",
      "Написание эссе или решения задачи в рамках строгого лимита слов или времени",
      "Проектирование конструкции или модели с заданными габаритными ограничениями",
      "Изучение исторических событий, происходивших в географически ограниченных регионах (осажденный город, остров)"
    ],
    "abuse_risks": [
      "Чрезмерные ограничения, парализующие творчество и делающие задачу нерешаемой",
      "Искусственное создание дефицита пространства для продажи его расширения",
      "Повышение стресса и фрустрации, особенно у людей с клаустрофобией или потребностью в просторе"
    ],
    "ethical_constraints": [
      "Ограничения должны быть педагогически или функционально обоснованы",
      "Должны существовать четкие и справедливые правила того, что считается 'пространством'",
      "В групповой работе ограничения пространства не должны приводить к конфликтам за ресурсы"
    ],
    "toxicity_level": "medium",
    "risk_color": "yellow",
    "scaling_risk": "С ростом сложности проекта или системы определение 'ограниченного пространства' может стать неочевидным и субъективным. Балансировка ограничений для пользователей с разным уровнем навыков сложна. При работе в группах ограничения могут привести к конфликтам, если пространство считается общим, но распределено неравно.",
    "related_mechanics": ["resource_scarcity", "puzzle_solving", "constraint_based_design"]
  },
  {
    "id": "zone_control",
    "name": "Контроль зоны",
    "layer": "space",
    "description": "Механика, при которой пользователь или группа должны установить и поддерживать доминирование над определенной областью пространства в течение времени. Фокусируется на удержании позиции, а не просто на ее достижении.",
    "tags": ["доминирование", "территория", "удержание", "стратегия"],
    "interaction_type": ["mental", "social"],
    "motivation": {
      "type": "hybrid",
      "notes": "Экстринсивная: конкретная, часто командная цель с четкими критериями успеха. Интринсивная: чувство власти и контроля над частью мира, стратегическое удовольствие от защиты и атаки позиций, коллективное достижение."
    },
    "game_examples": [
      {
        "title": "Шутеры (Control Point в Team Fortress 2, Domination в Call of Duty)",
        "implementation": "Команда должна стоять на точке захвата, чтобы накапливать очки"
      },
      {
        "title": "Стратегии в реальном времени (StarCraft)",
        "implementation": "Контроль за ресурсными узлами и ключевыми проходами на карте"
      }
    ],
    "product_examples": [
      "Рынки, где компании борются за долю (контроль) в определенном сегменте или регионе",
      "Системы бронирования, где пользователь 'удерживает' слот на определенное время",
      "Инструменты совместной работы, где можно 'заблокировать' часть документа для эксклюзивного редактирования"
    ],
    "education_examples": [
      "Групповые проекты, где каждая команда отвечает за свой раздел исследования или часть презентации (контроль зоны знания)",
      "Деловые игры или симуляции рынка, где 'компании' борются за контроль над сегментами",
      "Изучение истории через моделирование контроля территорий империями или государствами",
      "Научные эксперименты, где нужно поддерживать стабильные условия (температуру, pH) в 'зоне' — контроль параметров"
    ],
    "abuse_risks": [
      "Поощрение чрезмерно агрессивного и конфликтного поведения",
      "Создание токсичной среды доминирования, где новички или слабые игроки не имеют шансов",
      "Фрустрация от потери контроля после длительных усилий по его удержанию"
    ],
    "ethical_constraints": [
      "В образовательном контексте акцент должен смещаться с агрессивного 'захвата' на ответственное 'управление' территорией/знанием",
      "Должны быть механизмы, предотвращающие вечное доминирование одной группы/игрока",
      "Правила контроля должны быть ясными и обеспечивать возможность 'возвращения' в игру после потери контроля"
    ],
    "toxicity_level": "high",
    "risk_color": "red",
    "scaling_risk": "Балансировка контроля зон для большого количества игроков/команд крайне сложна. Возникает проблема 'снежного кома': контролирующий ресурсную зону получает преимущество для контроля следующих. В больших пространствах может возникнуть ситуация, где основные зоны контролируются старыми игроками, а новичкам нечего делать.",
    "related_mechanics": ["territory_expansion", "pvp_conflict", "strategic_planning"]
  },
  {
    "id": "territory_expansion",
    "name": "Расширение территории",
    "layer": "space",
    "description": "Процесс увеличения контролируемой пользователем или его фракцией области пространства. Часто связан с затратами ресурсов и риском перерастяжения. Создает чувство роста и прогресса.",
    "tags": ["рост", "экспансия", "колонизация", "влияние"],
    "interaction_type": ["mental"],
    "motivation": {
      "type": "hybrid",
      "notes": "Экстринсивная: получение доступа к новым ресурсам, возможностям и стратегическим позициям. Интринсивная: глубокое удовлетворение от наблюдения за ростом 'своей' территории, чувство строителя и первооткрывателя."
    },
    "game_examples": [
      {
        "title": "4X стратегии (Civilization)",
        "implementation": "Основание новых городов, расширение границ культурным влиянием, захват земель армией"
      },
      {
        "title": "RTS (Age of Empires)",
        "implementation": "Строительство зданий, которые расширяют 'линию видимости' и зону контроля"
      }
    ],
    "product_examples": [
      "Расширение бизнеса на новые рынки или регионы",
      "Увеличение зоны покрытия сервиса (например, каршеринга или доставки)",
      "Рост базы пользователей или сообщества"
    ],
    "education_examples": [
      "Построение концепт-карты или ментальной карты, которая расширяется по мере изучения темы",
      "Исторический анализ расширения империй, распространения культур или научных идей",
      "Исследовательский проект, где 'территория' — это охваченные источники, рассмотренные гипотезы или собранные данные",
      "Изучение языка через постепенное расширение активного словарного запаса и грамматических конструкций"
    ],
    "abuse_risks": [
      "Поощрение бездумной, агрессивной экспансии без учета устойчивости ('синдром империи')",
      "Создание непреодолимого разрыва между игроками, рано начавшими расширяться, и остальными",
      "Моделирование и нормализация колониалистских или империалистических практик без критического осмысления"
    ],
    "ethical_constraints": [
      "В историческом или социальном контексте расширение должно изучаться критически, с учетом его последствий для коренного населения/среды",
      "Механика должна учитывать логистические и управленческие сложности реальной экспансии, а не быть простым кликом",
      "Не должно быть единственного оптимального пути 'пассивного' расширения, не требующего взаимодействия"
    ],
    "toxicity_level": "medium",
    "risk_color": "yellow",
    "scaling_risk": "В больших игровых мирах экспансия может привести к тому, что игроки редко будут пересекаться, снижая социальное взаимодействие. Балансировка стоимости и выгоды от расширения на разных этапах игры сложна. Риск создания 'пустых' территорий, не представляющих ценности, просто для заполнения карты.",
    "related_mechanics": ["snowball_effect", "frontier_exploration", "growth_management"]
  },
  {
    "id": "position_loss",
    "name": "Потеря позиции",
    "layer": "space",
    "description": "Вынужденное или наказательное перемещение пользователя из текущей, часто advantageous, позиции в пространстве на менее выгодную или опасную. Создает негативные последствия и риск.",
    "tags": ["отступление", "наказание", "сброс", "неудача"],
    "interaction_type": ["mental"],
    "motivation": {
      "type": "extrinsic",
      "notes": "Отрицательное подкрепление, обучающее избегать определенных действий или ситуаций. Повышает значимость текущей позиции, создавая страх ее потери. Добавляет драматизма и эмоциональных взлетов и падений."
    },
    "game_examples": [
      {
        "title": "Платформеры (Super Mario)",
        "implementation": "Падение в яму или касание врага возвращает Марио на начало уровня или контрольную точку"
      },
      {
        "title": "Шахматы",
        "implementation": "Потеря ключевой фигуры или поля ухудшает позицию"
      }
    ],
    "product_examples": [
      "Потеря прогресса в форме из-за ошибки валидации и возврата на предыдущую страницу",
      "Сброс настроек или позиции в интерфейсе при обновлении или сбое",
      "Понижение в рейтинге или списке лидеров после периода бездействия или ошибок"
    ],
    "education_examples": [
      "Необходимость пересдать экзамен или заново пройти модуль при неудовлетворительном результате",
      "В групповой работе — потеря роли или ответственности из-за невыполнения обязательств",
      "В симуляторах (пилотных, медицинских) — 'смерть' пациента или авария, возвращающая к началу сценария",
      "Потеря привилегий (доступа к оборудованию, свободы выбора темы) из-за нарушения правил"
    ],
    "abuse_risks": [
      "Чрезмерная суровость, демотивирующая пользователя и заставляющая его бросить попытку",
      "Несправедливость, если потеря позиции вызвана факторами вне контроля пользователя (баг, действия другого игрока)",
      "Создание 'ловушки неудачника', где потеря одной позиции ведет к каскадным потерям, из которых невозможно восстановиться"
    ],
    "ethical_constraints": [
      "Потеря позиции должна быть соразмерна 'проступку' или ошибке",
      "Должна быть возможность восстановить позицию или хотя бы частично компенсировать потерю разумными усилиями",
      "В образовании наказание должно быть корректирующим и обучающим, а не карательным"
    ],
    "toxicity_level": "high",
    "risk_color": "red",
    "scaling_risk": "Сложно персонализировать последствия потери позиции для разных пользователей. Для одного это здоровый вызов, для другого — непреодолимое препятствие. В многопользовательской среде потеря позиции одним игроком может негативно сказаться на всей команде, вызывая межличностные конфликты.",
    "related_mechanics": ["setback", "punishment", "progress_rollback"]
  },
  {
    "id": "safe_zone",
    "name": "Безопасная зона",
    "layer": "space",
    "description": "Область пространства, специально обозначенная или понимаемая как защищенная от угроз, наказаний или давления. Позволяет пользователю отдохнуть, перегруппироваться, поэкспериментировать без риска.",
    "tags": ["убежище", "отдых", "эксперимент", "защита"],
    "interaction_type": ["mental"],
    "motivation": {
      "type": "intrinsic",
      "notes": "Удовлетворяет базовую потребность в безопасности и контроле. Позволяет снизить стресс, спланировать дальнейшие действия, попробовать новое без страха неудачи. Создает точку психологической опоры в опасном мире."
    },
    "game_examples": [
      {
        "title": "Хабы и города в RPG (Skyrim, The Witcher)",
        "implementation": "Города, где нельзя атаковать/быть атакованным, есть торговцы, квестодатели"
      },
      {
        "title": "Спавн-пойнты или базы в выживалках (Minecraft)",
        "implementation": "Область, где игрок появляется после смерти, часто укрепленная и защищенная"
      }
    ],
    "product_examples": [
      "Режим 'песочницы' или 'демо' в программном обеспечении",
      "Черновики или приватные режимы в соцсетях и блогах",
      "Изолированные тестовые среды (staging environment) для разработчиков"
    ],
    "education_examples": [
      "Учебные группы или консультационные часы, где можно задавать 'глупые вопросы' без осуждения",
      "Пробные тесты или тренировочные задания, не влияющие на итоговую оценку",
      "Лабораторные работы в симуляторе перед работой с реальным оборудованием",
      "Пространство для мозгового штурма и генерации идей без критики на ранних этапах"
    ],
    "abuse_risks": [
      "Формирование зависимости от безопасной зоны, нежелание покидать ее для реального прогресса",
      "Использование безопасной зоны для эксплуатации системы (фарм ресурсов без риска, например)",
      "Создание иллюзии безопасности, которая затем резко разрушается (подрыв доверия)"
    ],
    "ethical_constraints": [
      "Безопасная зона должна быть временным убежищем, а не постоянным местом пребывания",
      "Правила безопасности внутри зоны должны быть четкими и соблюдаться системой (например, абсолютный запрет PvP)",
      "В образовании важно постепенно выводить учеников из зоны комфорта, а не держать их в ней постоянно"
    ],
    "toxicity_level": "low",
    "risk_color": "green",
    "scaling_risk": "В многопользовательских мирах безопасные зоны могут стать перегруженными и нефункциональными из-за скопления игроков. Могут возникнуть конфликты из-за разного понимания 'безопасности' (например, вербальные оскорбления в зоне, защищенной только от физического урона). Сложность модерации и поддержания порядка в крупных безопасных зонах.",
    "related_mechanics": ["sanctuary", "training_grounds", "stress_relief"]
  }
]