[
  {
    "id": "timer",
    "name": "Таймер",
    "layer": "time",
    "description": "Визуализированный отсчет времени до наступления или окончания события, действия, периода. Создает ощущение срочности, ограничения и управляет темпом взаимодействия.",
    "tags": ["отсчет", "срочность", "дедлайн", "визуализация"],
    "interaction_type": ["mental"],
    "motivation": {
      "type": "extrinsic",
      "notes": "Создает ясный, объективный и неотвратимый лимит, фокусирующий внимание и усилия. Стимулирует действие за счет страха упустить возможность по истечении времени."
    },
    "game_examples": [
      {
        "title": "Игры на скорость (Speedrun)",
        "implementation": "Таймер, показывающий общее время прохождения уровня или игры"
      },
      {
        "title": "Стратегии в реальном времени (StarCraft)",
        "implementation": "Таймер до прибытия подкрепления или завершения исследования"
      }
    ],
    "product_examples": [
      "Обратный отсчет до окончания акции или скидки",
      "Таймер сессии (например, в банковском приложении)",
      "Время, оставшееся до завершения загрузки или обработки"
    ],
    "education_examples": [
      "Таймер на экзамене или контрольной работе",
      "Ограниченное время для ответа на вопрос в интерактивном опросе",
      "Срок сдачи проекта или домашнего задания",
      "Время, отведенное на выступление или презентацию"
    ],
    "abuse_risks": [
      "Вызывание чрезмерного стресса и тревожности",
      "Поощрение поверхностной работы в ущерб качеству",
      "Несправедливость по отношению к людям, которым нужно больше времени по объективным причинам"
    ],
    "ethical_constraints": [
      "Временные рамки должны быть реалистичными для достижения цели",
      "Должны быть предусмотрены accommodations для людей с особенностями",
      "Пользователи должны быть четко предупреждены о начале отсчета"
    ],
    "toxicity_level": "medium",
    "risk_color": "yellow",
    "scaling_risk": "При одновременном запуске множества таймеров для разных пользователей возникает сложность их синхронизации и управления. Также риск технических сбоев (таймеры сбиваются), что особенно критично в оценках и тестах. При персонализации времени для разных пользователей может возникнуть восприятие несправедливости.",
    "related_mechanics": ["time_pressure", "limited_window", "deadline"]
  },
  {
    "id": "cooldown",
    "name": "Кулдаун",
    "layer": "time",
    "description": "Период времени после выполнения действия, в течение которого это действие нельзя повторить или оно менее эффективно. Создает ритм, стратегическое планирование и предотвращает злоупотребление.",
    "tags": ["восстановление", "задержка", "ритм", "ограничение"],
    "interaction_type": ["mental"],
    "motivation": {
      "type": "hybrid",
      "notes": "Экстринсивная: вынуждает планировать использование мощных способностей и искать альтернативы. Интринсивная: добавляет стратегическую глубину через управление временными ресурсами и создает естественные паузы в активности."
    },
    "game_examples": [
      {
        "title": "MOBA (Dota 2, League of Legends)",
        "implementation": "Кулдауны на ультимативные и мощные способности героев"
      },
      {
        "title": "MMORPG",
        "implementation": "Время восстановления здоровья, маны или специальных умений"
      }
    ],
    "product_examples": [
      "Ограничение на частоту отправки сообщений или запросов (anti-spam)",
      "Время ожидания перед повторной попыткой входа при ошибке пароля",
      "Период невозможности отмены действия (например, удаления аккаунта)"
    ],
    "education_examples": [
      "Время, которое должно пройти перед повторной попыткой сдачи теста",
      "Ограничение на частоту обращения за помощью к преподавателю или консультанту",
      "Период 'перерыва' между интенсивными учебными сессиями (техника Pomodoro)",
      "Кулдаун на использование подсказок или справочных материалов"
    ],
    "abuse_risks": [
      "Искусственное замедление прогресса для монетизации (покупка ускорения)",
      "Чрезмерные ограничения, нарушающие естественный поток деятельности",
      "Неучет индивидуальных темпов и потребностей пользователей"
    ],
    "ethical_constraints": [
      "Длительность кулдауна должна быть обоснована балансом или педагогической целью",
      "Пользователи должны четко видеть оставшееся время восстановления",
      "Должны быть веские причины для введения кулдауна, а не просто для замедления"
    ],
    "toxicity_level": "low",
    "risk_color": "green",
    "scaling_risk": "При масштабировании сложно персонализировать длительность кулдаунов для разных пользователей. Универсальные значения могут быть слишком строгими для одних и слишком мягкими для других. Также техническая сложность отслеживания миллионов одновременных кулдаунов с точностью.",
    "related_mechanics": ["renewable_resource", "action_cost", "time_management"]
  },
  {
    "id": "turn_queue",
    "name": "Очередь ходов",
    "layer": "time",
    "description": "Упорядоченная последовательность, определяющая, когда каждый участник (игрок, система) может совершить действие. Создает структурированное пошаговое взаимодействие.",
    "tags": ["очередность", "порядок", "фазы", "структура"],
    "interaction_type": ["mental"],
    "motivation": {
      "type": "intrinsic",
      "notes": "Обеспечивает справедливость и предсказуемость, давая каждому участнику равное время для принятия решений. Создает пространство для стратегического планирования в ожидании своего хода."
    },
    "game_examples": [
      {
        "title": "Пошаговые стратегии (Civilization)",
        "implementation": "Игроки делают ходы в определенном порядке, часто циклическом"
      },
      {
        "title": "Карточные игры (покер)",
        "implementation": "Ходы делаются по часовой стрелке от дилера"
      }
    ],
    "product_examples": [
      "Очередь на техническую поддержку или обслуживание",
      "Система тикетов, где запросы обрабатываются в порядке поступления",
      "Очередь на доступ к ограниченному ресурсу или функции бета-тестирования"
    ],
    "education_examples": [
      "Очередь выступлений на семинаре или защите проектов",
      "Расписание консультаций с преподавателем (запись по времени)",
      "Поочередное выполнение этапов группового проекта",
      "Система, где студенты отвечают на вопросы в порядке поднятия руки (виртуальной очереди)"
    ],
    "abuse_risks": [
      "Манипуляция очередью (например, постоянное 'перехватывание' хода)",
      "Длинные очереди, приводящие к фрустрации и отказу от участия",
      "Несправедливые алгоритмы определения порядка (например, favoring paying users)"
    ],
    "ethical_constraints": [
      "Правила определения и изменения очереди должны быть прозрачными",
      "Должны существовать механизмы для срочных случаев (приоритетная очередь)",
      "Время ожидания в очереди должно быть разумным и предсказуемым"
    ],
    "toxicity_level": "low",
    "risk_color": "green",
    "scaling_risk": "С ростом числа участников время ожидания своего хода может стать чрезмерным. Сложность управления динамическими очередями, где порядок может меняться. Риск создания 'очереди ради очереди' без реальной необходимости в строгом порядке.",
    "related_mechanics": ["turn_based", "fairness", "waiting_mechanic"]
  },
  {
    "id": "turn_based",
    "name": "Пошаговая система",
    "layer": "time",
    "description": "Время разделено на дискретные отрезки (ходы, раунды, фазы), в течение которых происходят определенные действия. Создает тактическую глубину, снижает стресс реального времени.",
    "tags": ["фазы", "раунды", "дискретность", "планирование"],
    "interaction_type": ["mental"],
    "motivation": {
      "type": "intrinsic",
      "notes": "Устраняет давление немедленной реакции, позволяя глубоко обдумать действия. Создает удовольствие от стратегического планирования, анализа позиции и предсказания действий оппонентов."
    },
    "game_examples": [
      {
        "title": "Шахматы, шашки",
        "implementation": "Классическая пошаговая система, где игроки делают ходы по очереди"
      },
      {
        "title": "Пошаговые RPG (Final Fantasy традиционные)",
        "implementation": "Боевая система, где участники выбирают действия в каждом раунде"
      }
    ],
    "product_examples": [
      "Система рецензирования или утверждения документов поэтапно",
      "Процесс онбординга с четкими шагами, которые нужно завершить последовательно",
      "Интерактивные руководства, где следующий шаг открывается после выполнения предыдущего"
    ],
    "education_examples": [
      "Модульная структура курса, где следующий модуль открывается после завершения предыдущего",
      "Поэтапное выполнение исследовательского проекта: обзор литературы → методология → эксперимент → анализ",
      "Обучение через case studies, разбираемые шаг за шагом",
      "Языковые упражнения, где нельзя перейти к сложным предложениям, не освоив базовую грамматику"
    ],
    "abuse_risks": [
      "Чрезмерная фрагментация, разрушающая целостность восприятия",
      "Искусственное замедление прогресса через обязательное ожидание между шагами",
      "Жесткая последовательность, не учитывающая альтернативные пути обучения"
    ],
    "ethical_constraints": [
      "Разбиение на шаги должно быть педагогически обоснованным, а не произвольным",
      "Должна быть возможность просмотра общего плана и возврата к предыдущим шагам",
      "Система должна допускать некоторую гибкость и персонализацию последовательности"
    ],
    "toxicity_level": "low",
    "risk_color": "green",
    "scaling_risk": "При большом количестве пользователей на разных шагах сложно поддерживать актуальность и баланс каждого этапа. Риск создания 'узких мест', где многие пользователи застревают на одном шаге. Также сложность обновления контента: изменение одного шага может потребовать переработки всей цепочки.",
    "related_mechanics": ["action_chain", "progression_gating", "sequential_learning"]
  },
  {
    "id": "real_time",
    "name": "Реальное время",
    "layer": "time",
    "description": "Взаимодействие происходит в непрерывном времени, синхронизированном с реальным ходом времени. Требует быстрых реакций, одновременных действий и создает динамичное, напряженное взаимодействие.",
    "tags": ["непрерывность", "синхронность", "реакция", "динамика"],
    "interaction_type": ["physical", "mental"],
    "motivation": {
      "type": "hybrid",
      "notes": "Экстринсивная: острые ощущения от немедленной обратной связи и разрешения ситуаций. Интринсивная: чувство потока, полного погружения в 'здесь и сейчас', развитие моторных навыков и скорости реакции."
    },
    "game_examples": [
      {
        "title": "Экшн-игры (Call of Duty, Fortnite)",
        "implementation": "Все действия происходят в реальном времени, требуя быстрых решений и реакций"
      },
      {
        "title": "Симуляторы (гонки, полеты)",
        "implementation": "Непрерывное управление транспортным средством в реальном времени"
      }
    ],
    "product_examples": [
      "Живые трансляции или видео-звонки",
      "Совместное редактирование документов в реальном времени (Google Docs)",
      "Торговые платформы с реальными котировками",
      "Мониторинг систем в реальном времени (датчики, аналитика)"
    ],
    "education_examples": [
      "Интерактивные вебинары или виртуальные классы с живым общением",
      "Лабораторные работы с реальным оборудованием, требующие синхронных действий",
      "Тренажеры экстренных ситуаций (медицинские, технические)",
      "Изучение языка через разговорную практику с носителем в реальном времени"
    ],
    "abuse_risks": [
      "Создание непреодолимого барьера для людей с медленной реакцией или ограничениями",
      "Высокий уровень стресса, ведущий к выгоранию",
      "Несправедливость из-за технических факторов (плохое соединение, лаги)"
    ],
    "ethical_constraints": [
      "Режим реального времени не должен быть единственным способом взаимодействия",
      "Должны быть компенсации для пользователей с техническими проблемами",
      "Интенсивность должна соответствовать цели (не превращать обучение в стресс-тест)"
    ],
    "toxicity_level": "medium",
    "risk_color": "yellow",
    "scaling_risk": "Техническая сложность синхронизации действий тысяч пользователей в реальном времени (сетевые лаги, рассинхронизация). С увеличением масштаба растут требования к инфраструктуре. Также сложность модерации живых взаимодействий в больших масштабах.",
    "related_mechanics": ["synchronous_interaction", "time_pressure", "live_feedback"]
  },
  {
    "id": "async_interaction",
    "name": "Асинхронное взаимодействие",
    "layer": "time",
    "description": "Участники взаимодействуют в разное время, оставляя действия, сообщения или контент для других, которые будут восприняты позже. Создает гибкость и инклюзивность.",
    "tags": ["гибкость", "отложенность", "инклюзивность", "независимость"],
    "interaction_type": ["mental"],
    "motivation": {
      "type": "intrinsic",
      "notes": "Уважение к индивидуальным ритмам и расписаниям. Позволяет глубоко обдумать ответы и действия без давления немедленной реакции. Обеспечивает участие людей из разных часовых поясов и с разной доступностью."
    },
    "game_examples": [
      {
        "title": "Пошаговые стратегии по переписке (Play-by-Email)",
        "implementation": "Игроки делают ход, когда у них есть время, игра длится дни или недели"
      },
      {
        "title": "Мобильные казуальные игры",
        "implementation": "Отправка ресурсов или помощи друзьям, которые получат их при следующем входе"
      }
    ],
    "product_examples": [
      "Электронная почта, форумы,留言板",
      "Система тикетов, где ответ может прийти через часы",
      "Приложения для совместной работы с историей изменений (типа Figma, где можно проследить правки)"
    ],
    "education_examples": [
      "Форумы курсов, где обсуждения ведутся в течение дней",
      "Выполнение заданий и получение фидбека от преподавателя в удобное время",
      "Записи лекций и вебинаров для просмотра в любое время",
      "Портфолио проектов, которое оценивается асинхронно"
    ],
    "abuse_risks": [
      "Потеря чувства срочности и вовлеченности, прокрастинация",
      "Накопление незавершенных взаимодействий ('inbox overload')",
      "Непонимания из-за отсутствия немедленного уточнения и контекста реального времени"
    ],
    "ethical_constraints": [
      "Должны быть установлены разумные ожидания по времени ответа",
      "Важные срочные вопросы должны иметь альтернативные каналы синхронной связи",
      "Система должна помогать управлять асинхронными задачами (напоминания, приоритеты)"
    ],
    "toxicity_level": "low",
    "risk_color": "green",
    "scaling_risk": "С ростом числа пользователей и асинхронных взаимодействий возникает проблема информационной перегрузки и сложности навигации по истории. Также риск возникновения 'мертвых' обсуждений или действий, на которые никто не отвечает. Сложность модерации отсроченного контента.",
    "related_mechanics": ["delayed_feedback", "flexible_pacing", "timezone_independence"]
  },
  {
    "id": "limited_window",
    "name": "Ограниченное окно действия",
    "layer": "time",
    "description": "Возможность совершить действие или получить награду доступна только в течение определенного, обычно короткого, периода времени. Создает эксклюзивность и срочность.",
    "tags": ["эксклюзивность", "доступность", "миссия", "событие"],
    "interaction_type": ["mental"],
    "motivation": {
      "type": "extrinsic",
      "notes": "Сильный внешний стимул через страх упустить выгоду (FOMO). Создает ощущение уникальности и редкости возможности, побуждая к немедленному действию."
    },
    "game_examples": [
      {
        "title": "Сезонные ивенты в играх (Fortnite, Genshin Impact)",
        "implementation": "Уникальные задания, награды или контент, доступные только несколько недель"
      },
      {
        "title": "Лимитированные миссии",
        "implementation": "Специальные задания, появляющиеся на 24-48 часов"
      }
    ],
    "product_examples": [
      "Временные скидки 'Flash Sale' (например, Black Friday)",
      "Окно раннего доступа к новому продукту для первых N пользователей",
      "Лимитированный прием заявок на программу или грант"
    ],
    "education_examples": [
      "Дедлайн подачи заявки на конкурс, стажировку или программу обмена",
      "Окно для сдачи теста или задания (например, с 9:00 до 21:00 в определенный день)",
      "Временный доступ к платному курсу по промокоду",
      "Вебинар или мастер-класс, который не будет записан"
    ],
    "abuse_risks": [
      "Эксплуатация FOMO для манипуляции и создания искусственного ажиотажа",
      "Несправедливость по отношению к пользователям, которые физически не могли участвовать (разница во времени, занятость)",
      "Стресс и тревожность из-за постоянного страха что-то упустить"
    ],
    "ethical_constraints": [
      "Ограниченные окна должны иметь веское обоснование (организационное, логистическое), а не быть чисто манипулятивными",
      "Должны учитываться разные часовые пояса и жизненные обстоятельства",
      "Критически важный функционал или контент не должен быть доступен только в ограниченные окна"
    ],
    "toxicity_level": "high",
    "risk_color": "red",
    "scaling_risk": "При работе с глобальной аудиторией сложно выбрать время окна, справедливое для всех часовых поясов. Также техническая сложность управления одновременным пиковым спросом в момент открытия окна. Риск недовольства пользователей, пропустивших окно, которое может перерасти в негативные отзывы.",
    "related_mechanics": ["fomo", "seasonal_events", "time_exclusive"]
  },
  {
    "id": "time_pressure",
    "name": "Давление времени",
    "layer": "time",
    "description": "Психологическое ощущение нехватки времени для выполнения задачи, создаваемое явными (таймер) или неявными (соревнование, ожидание других) механизмами. Ускоряет темп, влияет на качество решений.",
    "tags": ["стресс", "темп", "решение", "эффективность"],
    "interaction_type": ["mental"],
    "motivation": {
      "type": "extrinsic",
      "notes": "Заставляет действовать быстрее и принимать решения с меньшим анализом. Может повысить продуктивность за счет фокусировки и устранения прокрастинации, а также добавляет азарта и интенсивности."
    },
    "game_examples": [
      {
        "title": "Головоломки на время (Portal, The Talos Principle с таймером)",
        "implementation": "Необходимо решить puzzle до истечения времени"
      },
      {
        "title": "Соревновательные режимы",
        "implementation": "Давление со стороны противника, который действует параллельно"
      }
    ],
    "product_examples": [
      "Ограниченное время для завершения оформления заказа в корзине",
      "Обратный отсчет на аукционе для повышения ставки",
      "Уведомления 'Ваша сессия скоро истечет'"
    ],
    "education_examples": [
      "Экзамены с жестким лимитом времени",
      "Интерактивные опросы, где время на ответ ограничено",
      "Групповые обсуждения с регламентом выступления",
      "Задания на развитие скорости чтения или счета"
    ],
    "abuse_risks": [
      "Чрезмерный стресс, парализующий мышление (синдром 'пустого листа')",
      "Поощрение некачественной, поверхностной работы",
      "Дискриминация людей, которые по природе медленнее или имеют особенности (тревожность, ADHD)"
    ],
    "ethical_constraints": [
      "Давление времени должно быть педагогически оправдано (например, для развития навыка работы в условиях дедлайна)",
      "Должны существовать альтернативные задания или условия для тех, кто не справляется с давлением",
      "Интенсивность давления должна соответствовать цели, а не быть произвольной"
    ],
    "toxicity_level": "high",
    "risk_color": "red",
    "scaling_risk": "Сложно калибровать оптимальный уровень давления для разнородной аудитории. То, что для одних является здоровым вызовом, для других — непреодолимым стрессом. При масштабировании персонализация становится технически сложной. Также риск системных ошибок, когда давление времени возникает из-за лагов интерфейса, а не реальной сложности задачи.",
    "related_mechanics": ["timer", "stress_test", "performance_under_pressure"]
  }
]