[
  {
    "id": "random_outcome",
    "name": "Случайный результат",
    "layer": "uncertainty",
    "description": "Исход действия полностью или частично определяется генератором случайных чисел (RNG), а не навыком или выбором пользователя. Создает непредсказуемость и элемент удачи.",
    "tags": ["удача", "рандомизация", "непредсказуемость", "RNG"],
    "interaction_type": ["mental"],
    "motivation": {
      "type": "hybrid",
      "notes": "Экстринсивная: надежда на благоприятный исход, возможность получить больше, чем заслуживаешь. Интринсивная: волнение от неопределенности, эмоциональные взлеты и падения, создание уникальных, неповторяющихся ситуаций."
    },
    "game_examples": [
      {
        "title": "Настольные игры с кубиками (Монополия)",
        "implementation": "Продвижение по полю определяется броском кубика"
      },
      {
        "title": "Roguelike игры",
        "implementation": "Генерация уровней, встречаемых врагов и выпадающего лута случайна"
      }
    ],
    "product_examples": [
      "Розыгрыши призов или лотереи среди пользователей",
      "Рекомендательные системы, показывающие контент в случайном порядке для разнообразия",
      "Система распределения бонусов или скидок случайным выбранным клиентам"
    ],
    "education_examples": [
      "Случайный выбор студента для ответа у доски (жребий)",
      "Варианты контрольной работы, генерируемые случайным образом из банка вопросов",
      "Распределение тем для проектов или эссе случайным образом среди студентов",
      "Использование случайных чисел в задачах по статистике или теории вероятностей"
    ],
    "abuse_risks": [
      "Формирование иррациональной веры в удачу и суеверий",
      "Несправедливость: одинаковые усилия приводят к радикально разным результатам",
      "Разочарование и демотивация при неблагоприятных исходах, ощущение отсутствия контроля"
    ],
    "ethical_constraints": [
      "Случайность не должна быть единственным фактором, определяющим критически важные результаты (например, итоговую оценку)",
      "Пользователи должны понимать степень влияния случайности на исход",
      "Должны существовать механизмы компенсации или пересмотра при явно несправедливых результатах"
    ],
    "toxicity_level": "medium",
    "risk_color": "yellow",
    "scaling_risk": "При большом количестве пользователей закон больших чисел нивелирует уникальность 'удачи', и распределение результатов становится предсказуемым. Случайность может восприниматься как нечестность, если алгоритмы не являются криптографически стойкими или прозрачными. Сложность отладки и воспроизведения багов, связанных с RNG.",
    "related_mechanics": ["probability_event", "risk_action", "luck_based"]
  },
  {
    "id": "probability_event",
    "name": "Вероятностное событие",
    "layer": "uncertainty",
    "description": "Событие, которое происходит с известной (или объявленной) вероятностью. Пользователь знает шансы, но не точный исход. Создает пространство для расчета рисков и стратегического планирования.",
    "tags": ["шансы", "риск", "расчет", "ожидание"],
    "interaction_type": ["mental"],
    "motivation": {
      "type": "intrinsic",
      "notes": "Интеллектуальное удовольствие от оценки вероятностей, расчета математического ожидания и принятия решений на основе неполной, но количественной информации. Развивает аналитическое мышление."
    },
    "game_examples": [
      {
        "title": "Карточные игры (покер)",
        "implementation": "Игрок рассчитывает вероятность собрать определенную комбинацию на основе известных карт"
      },
      {
        "title": "RPG с системой критического удара",
        "implementation": "Атака имеет 15% шанс нанести двойной урон"
      }
    ],
    "product_examples": [
      "Показ рекламы с определенной частотой (например, 1 рекламный блок на 10 постов)",
      "Система рекомендаций, где вероятность показа товара зависит от схожести профилей",
      "Алгоритмы A/B тестирования, случайно назначающие пользователям версию продукта"
    ],
    "education_examples": [
      "Задачи на теорию вероятностей и статистику с реальными или смоделированными данными",
      "Симуляторы принятия решений в условиях неопределенности (бизнес, медицина)",
      "Адаптивное тестирование, где сложность следующего вопроса зависит от вероятности правильного ответа",
      "Изучение научного метода через эксперименты со случайной выборкой"
    ],
    "abuse_risks": [
      "Манипуляция заявленными вероятностями (несоответствие заявленного и реального шанса)",
      "Эксплуатация когнитивных искажений (например, игнорирование низкой вероятности при высокой награде)",
      "Превращение расчета вероятностей в рутину, лишенную контекста и смысла"
    ],
    "ethical_constraints": [
      "Заявленные вероятности должны соответствовать реальным (требует аудита и прозрачности)",
      "Система не должна поощрять игнорирование низковероятных, но катастрофических рисков",
      "В образовательном контексте вероятности должны быть педагогическим инструментом, а не просто элементом геймплея"
    ],
    "toxicity_level": "low",
    "risk_color": "green",
    "scaling_risk": "При масштабировании микроскопические отклонения в генераторе случайных чисел или в логике расчета вероятностей могут привести к макроскопическим искажениям результатов, заметным для пользователей. Сложность обеспечения криптографической стойкости и верификации 'честности' вероятностей в распределенных системах.",
    "related_mechanics": ["controlled_random", "risk_calculation", "expected_value"]
  },
  {
    "id": "hidden_probability",
    "name": "Скрытая вероятность",
    "layer": "uncertainty",
    "description": "Вероятность наступления события неизвестна пользователю. Система может использовать фиксированные или динамические шансы, но не раскрывает их. Создает атмосферу тайны и необходимость эмпирического обучения.",
    "tags": ["непрозрачность", "открытие", "эмпирика", "тайна"],
    "interaction_type": ["mental"],
    "motivation": {
      "type": "intrinsic",
      "notes": "Стимулирует любопытство и исследовательское поведение: пользователь собирает данные, строит гипотезы и пытается вывести закономерности самостоятельно. Создает ощущение открытия тайн системы."
    },
    "game_examples": [
      {
        "title": "Игры с скрытыми механиками (Dark Souls)",
        "implementation": "Шанс выпадения редкого предмета с конкретного врага не указан, определяется сообществом"
      },
      {
        "title": "Старые RPG",
        "implementation": "Шанс успеха в диалогах или действиях (кража, убеждение) часто скрыт"
      }
    ],
    "product_examples": [
      "Алгоритмы ранжирования в соцсетях или поисковых системах (чёрный ящик)",
      "Скрытая логика определения цены для пользователя (динамическое ценообразование)",
      "Необъявленные критерии для получения статуса или наград"
    ],
    "education_examples": [
      "Изучение научного метода: проведение экспериментов для выявления неизвестных закономерностей",
      "Исследовательские проекты, где студенты должны сами обнаружить взаимосвязи в данных",
      "Симуляторы сложных систем (экология, экономика), где точные формулы взаимодействия не даются",
      "Задачи на дедукцию и сбор улик, где полная картина скрыта"
    ],
    "abuse_risks": [
      "Восприятие как несправедливости или манипуляции, ведущее к недоверию к системе",
      "Формирование ложных паттернов и суеверий (апофения) на основе ограниченных данных",
      "Эксплуатация: система может незаметно подстраивать вероятности против пользователя"
    ],
    "ethical_constraints": [
      "Скрытие вероятностей не должно использоваться для обмана или несправедливого преимущества системы",
      "В образовательном контексте скрытые механизмы должны в конечном итоге быть раскрыты или объяснимы",
      "Критически важные для прогресса вероятности не должны быть полностью скрыты"
    ],
    "toxicity_level": "high",
    "risk_color": "red",
    "scaling_risk": "При активном сообществе пользователи коллективно разгадывают скрытые вероятности, что может свести на нет задуманную тайну. Также возникает риск утечки 'дата-майнерами' реальных цифр, что может вызвать скандал, если они окажутся несправедливыми. Сложность поддержания баланса, если вероятности должны оставаться скрытыми, но при этом быть справедливыми.",
    "related_mechanics": ["information_revelation", "discovery", "obfuscation"]
  },
  {
    "id": "controlled_random",
    "name": "Контролируемый рандом",
    "layer": "uncertainty",
    "description": "Система, которая кажется случайной для пользователя, но на самом деле управляется скрытыми правилами (например, псевдослучайное распределение, гарантии после серии неудач). Балансирует удачу и справедливость.",
    "tags": ["псевдослучайность", "баланс", "компенсация", "управление"],
    "interaction_type": ["mental"],
    "motivation": {
      "type": "hybrid",
      "notes": "Сохраняет волнение случайности, но предотвращает крайне негативные эмоции от длительных полос невезения. Создает иллюзию справедливого мира, где усилия в конечном итоге вознаграждаются."
    },
    "game_examples": [
      {
        "title": "Dota 2, League of Legends",
        "implementation": "Pseudo-random distribution (PRD) для критических ударов: каждый промах увеличивает шанс крита в следующей атаке"
      },
      {
        "title": "Гача-игры (Genshin Impact)",
        "implementation": "Система 'пити' (pity system): гарантированная выдача редкого предмета после определенного количества неудачных попыток"
      }
    ],
    "product_examples": [
      "Алгоритмы ленты новостей, которые кажутся хронологическими, но на самом деле ранжируются",
      "Системы распределения бонусов, которые учитывают историю активности пользователя",
      "Динамическое ценообразование со скрытым потолком или защитой от злоупотреблений"
    ],
    "education_examples": [
      "Адаптивное тестирование, где сложность следующего вопроса зависит от предыдущих ответов, но студент не знает точного алгоритма",
      "Система выдачи индивидуальных заданий, которая учитывает прошлые успехи и пробелы",
      "Распределение проектных ролей, которое выглядит случайным, но балансирует сильные и слабые стороны команды"
    ],
    "abuse_risks": [
      "Манипуляция: система может создавать иллюзию контроля, оставаясь полностью предопределенной в пользу монетизации",
      "Разочарование при раскрытии механики ('значит, это не настоящая удача')",
      "Сложность понимания истинных правил, ведущая к неправильным стратегиям"
    ],
    "ethical_constraints": [
      "Управляющие правила должны иметь целью улучшение опыта пользователя, а не увеличение монетизации",
      "Полное раскрытие механик может быть излишним, но система не должна преднамеренно вводить в заблуждение",
      "В образовании такие системы должны иметь педагогическое обоснование (например, адаптация к уровню)"
    ],
    "toxicity_level": "medium",
    "risk_color": "yellow",
    "scaling_risk": "Сложность проектирования и тонкой настройки управляющих правил для миллионов пользователей с разным поведением. Риск того, что 'умная' система будет делать предсказуемые ошибки в edge cases. При обнаружении паттернов пользователи могут начать их эксплуатировать, что потребует постоянной корректировки алгоритмов.",
    "related_mechanics": ["probability_event", "adaptive_difficulty", "fairness_mechanic"]
  },
  {
    "id": "content_generation",
    "name": "Генерация контента",
    "layer": "uncertainty",
    "description": "Автоматическое создание уровней, задач, миров, диалогов или других элементов контента с использованием алгоритмических или процедурных методов. Обеспечивает высокую реиграбельность и уникальный опыт для каждого пользователя.",
    "tags": ["процедурность", "уникальность", "реиграбельность", "алгоритмы"],
    "interaction_type": ["mental"],
    "motivation": {
      "type": "intrinsic",
      "notes": "Чувство исследования неизвестного, предвкушение открытия нового. Каждое взаимодействие уникально, что поддерживает интерес в долгосрочной перспективе и дает ощущение, что мир живой и безграничный."
    },
    "game_examples": [
      {
        "title": "Roguelike/roguelite (The Binding of Isaac, Spelunky)",
        "implementation": "Уровни, враги, предметы и их расположение генерируются случайно при каждом новом забеге"
      },
      {
        "title": "No Man's Sky, Minecraft",
        "implementation": "Процедурная генерация практически бесконечных миров"
      }
    ],
    "product_examples": [
      "Генерация уникальных кодов скидок или промо-кодов",
      "Алгоритмическое создание персонализированных дашбордов или отчетов",
      "Генератор бизнес-идей или креативных концепций на основе введенных параметров"
    ],
    "education_examples": [
      "Генераторы задач по математике, физике, программированию с уникальными числовыми данными",
      "Создание индивидуальных планов обучения или траекторий на основе начального теста",
      "Симуляторы для отработки навыков, где условия сценария генерируются динамически (медицина, пилотирование)",
      "Инструменты для создания уникальных writing prompts или тем для исследований"
    ],
    "abuse_risks": [
      "Качество сгенерированного контента может быть неравномерным: от блестящего до бессмысленного",
      "Студенты могут эксплуатировать систему, перезапуская генерацию, пока не получат легкий вариант",
      "Потеря кураторского контроля и педагогического замысла, контент становится 'бездушным'"
    ],
    "ethical_constraints": [
      "Сгенерированный контент должен проходить проверку на корректность и педагогическую ценность",
      "Пользователи должны быть предупреждены, что контент создан алгоритмически",
      "Не должно быть возможности генерации вредоносного, оскорбительного или дезинформирующего контента"
    ],
    "toxicity_level": "low",
    "risk_color": "green",
    "scaling_risk": "Обеспечение высокого и стабильного качества генерируемого контента в промышленных масштабах — серьезная техническая задача. Риск повторения паттернов или генерации однообразного контента при увеличении объема. Сложность модерации и контроля динамически создаваемого контента.",
    "related_mechanics": ["discovery", "replayability", "personalization"]
  },
  {
    "id": "random_reward",
    "name": "Случайная награда",
    "layer": "uncertainty",
    "description": "Вознаграждение, тип, количество или качество которого определяется случайным образом. Создает сильный эмоциональный отклик (радость от неожиданной большой награды) и поддерживает интерес.",
    "tags": ["лотерея", "сюрприз", "переменное_подкрепление", "награда"],
    "interaction_type": ["mental"],
    "motivation": {
      "type": "extrinsic",
      "notes": "Основано на принципе переменного подкрепления (variable ratio schedule) — самом мощном с точки бихевиоризма. Непредсказуемость награды приводит к более частому и устойчивому повторению действия в надежде на выигрыш."
    },
    "game_examples": [
      {
        "title": "Loot boxes (косметические или игровые)",
        "implementation": "Заплатив или выполнив действие, игрок получает ящик с одним или несколькими случайными предметами"
      },
      {
        "title": "Игры с случайным дропом",
        "implementation": "Победа над врагом дает шанс выпадения редкого оружия или ресурса"
      }
    ],
    "product_examples": [
      "Сюрприз-боксы или мистери-боксы в услугах подписки",
      "Случайный бонус к кэшбэку или скидке при оплате",
      "Розыгрыш призов среди пользователей, совершивших действие"
    ],
    "education_examples": [
      "Бонусные баллы, случайно присуждаемые за активность на уроке или форуме",
      "Случайный выбор студента, чей ответ или проект будет разобран детально (как награда)",
      "Дополнительные материалы или доступ к эксклюзивному контенту в качестве неожиданной награды за упорство",
      "Использование в педагогике как аналог 'счастливого билета'"
    ],
    "abuse_risks": [
      "Высокий потенциал формирования лудоманического (игрового) поведения и зависимости",
      "Эксплуатационная механика, побуждающая к бесконечным повторениям в погоне за редкой наградой",
      "Несправедливость и разочарование, которые могут перевесить положительные эмоции"
    ],
    "ethical_constraints": [
      "Особенно регулируема в играх (законы о лутбоксах). В образовании требует крайней осторожности.",
      "Не должна быть основным способом оценки или продвижения.",
      "Должна быть прозрачность в шансах получения разных уровней наград."
    ],
    "toxicity_level": "high",
    "risk_color": "red",
    "scaling_risk": "Психологический и регуляторный риск возрастает с масштабом. Случайные награды могут нормализовать азартные механики для молодой аудитории. При широком внедрении может привести к общественному backlash и законодательным ограничениям. Технически сложно обеспечить истинную случайность и защиту от взлома.",
    "related_mechanics": ["variable_reward", "gambling_mechanic", "addiction_risk"]
  },
  {
    "id": "reward_schedule",
    "name": "График наград",
    "layer": "uncertainty",
    "description": "Заранее определенный, но неочевидный для пользователя паттерн или правило, по которому выдаются награды. Контролирует частоту и предсказуемость подкрепления для достижения желаемого поведения.",
    "tags": ["подкрепление", "паттерн", "бихевиоризм", "контроль"],
    "interaction_type": ["mental"],
    "motivation": {
      "type": "extrinsic",
      "notes": "Научно обоснованный метод формирования и поддержания привычек. Разные графики (фиксированный интервал, переменный интервал, фиксированное соотношение, переменное соотношение) вызывают разное поведение, от стабильного до очень устойчивого к угасанию."
    },
    "game_examples": [
      {
        "title": "Социальные и мобильные игры",
        "implementation": "Ежедневный бонус (фиксированный интервал) vs. случайные награды за победы (переменное соотношение)"
      },
      {
        "title": "Инкрементальные игры (Cookie Clicker)",
        "implementation": "Золотые печеньки, появляющиеся по переменному графику"
      }
    ],
    "product_examples": [
      "Программы лояльности с бонусами в определенные дни (фиксированный интервал)",
      "Случайные купоны на бесплатную доставку после N заказов (переменное соотношение)",
      "Уведомления и напоминания, отправляемые по оптимальному графику для удержания"
    ],
    "education_examples": [
      "Расписание контрольных работ (фиксированный интервал) vs. неожиданные мини-викторины (переменный интервал)",
      "Выдача похвалы или одобрения за каждое X обращение за помощью (фиксированное соотношение) vs. случайное поощрение инициативы",
      "Использование принципов интервального повторения (spaced repetition) для планирования повторения материала"
    ],
    "abuse_risks": [
      "Манипуляция поведением на подсознательном уровне, ограничивающая автономию",
      "Формирование нездоровых привычек или зависимости от системы вознаграждений",
      "Этическая проблема использования бихевиористских методов без информированного согласия"
    ],
    "ethical_constraints": [
      "Дизайнеры и педагоги должны осознавать мощь этих механизмов и использовать их ответственно",
      "В идеале, графики должны способствовать переходу от внешней к внутренней мотивации",
      "Особенно осторожно следует применять в образовании, чтобы не подменять интерес к предмету погоней за наградой"
    ],
    "toxicity_level": "medium",
    "risk_color": "yellow",
    "scaling_risk": "Сложность тонкой настройки и персонализации графиков наград для миллионов пользователей с разной психологией. Универсальный график может быть оптимальным для среднего пользователя, но неэффективным или вредным для значительных меньшинств. Риск того, что пользователи 'поймут' график и будут эксплуатировать его (например, активность только перед наградой).",
    "related_mechanics": ["random_reward", "habit_formation", "behavioral_design"]
  }
]